{"url": "https://www.w3schools.com", "title": "W3Schools Online Web Tutorials", "text": "W3Schools Online Web Tutorials Tutorials References Exercises Certificates Menu Search field × See More Sign In ★ +1 Get Certified Upgrade For Teachers Spaces Get Certified Upgrade For Teachers Spaces  My W3Schools Tutorials References Exercises Certificates Spaces Get Certified Plus Academy All our Services Logout     × Tutorials Tutorials filter input × HTML and CSS Learn HTML Tutorial Reference Learn CSS Tutorial Reference Learn RWD Tutorial Learn Bootstrap Overview Learn W3.CSS Tutorial Reference Learn Sass Tutorial Reference Learn Colors Tutorial Reference Learn Icons Tutorial Reference Learn SVG Tutorial Reference Learn Canvas Tutorial Reference Learn Graphics Tutorial Learn UTF-8 and Emojis Reference Learn How To Tutorial Data Analytics Learn AI Tutorial Learn Generative AI Tutorial Learn ChatGPT-3.5 Tutorial Learn ChatGPT-4 Tutorial Learn Google Bard Tutorial Learn Machine Learning Tutorial Learn DSA Tutorial Learn Data Science Tutorial Learn NumPy Tutorial Learn Pandas Tutorial Learn SciPy Tutorial Learn Matplotlib Tutorial Learn Statistics Tutorial Learn Excel Tutorial Learn Google Sheets Tutorial Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter JavaScript Learn JavaScript Tutorial Reference Learn React Tutorial Learn jQuery Tutorial Reference Learn Vue Tutorial Reference Learn Angular Tutorial Learn AngularJS Tutorial Reference Learn JSON Tutorial Reference Learn AJAX Tutorial Learn AppML Tutorial Reference Learn W3.JS Tutorial Reference Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter Backend Learn Python Tutorial Reference Learn SQL Tutorial Reference Learn MySQL Tutorial Reference Learn PHP Tutorial Reference Learn Java Tutorial Reference Learn C Tutorial Reference Learn C++ Tutorial Reference Learn C# Tutorial Learn R Tutorial Learn Kotlin Tutorial Learn Rust Tutorial Learn Go Tutorial Learn Django Tutorial Reference Learn PostgreSQL Tutorial Learn TypeScript Tutorial Learn ASP Tutorial Reference Learn Node.js Tutorial Reference Learn Raspberry Pi Tutorial Learn Git Tutorial Learn Bash Tutorial Learn MongoDB Tutorial Learn XML Tutorial Reference Data Analytics Learn AI Tutorial Learn Generative AI Tutorial Learn ChatGPT-3.5 Tutorial Learn ChatGPT-4 Tutorial Learn Google Bard Tutorial Learn Machine Learning Tutorial Learn DSA Tutorial Learn Data Science Tutorial Learn NumPy Tutorial Learn Pandas Tutorial Learn SciPy Tutorial Learn Matplotlib Tutorial Learn Statistics Tutorial Learn Excel Tutorial Learn Google Sheets Tutorial Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter × References References filter input × HTML and CSS HTML Tags Reference CSS Reference W3.CSS Reference Bootstrap 3 Reference Bootstrap 4 Reference Color Names Icons Reference SVG Reference Canvas Reference Sass Reference UTF-8 Charset Reference UTF-8 Emojis Reference JavaScript JavaScript Reference jQuery Reference Vue Reference Angular Reference JSON Reference AppML Reference W3.JS Reference Backend Python Reference SQL Reference MySQL Reference PHP Reference Java Reference C Reference C++ Reference Django Reference ASP Reference Node.js Reference XML Reference × Exercises Excercises filter input × HTML and CSS HTML Exercise Quiz CSS Exercise Quiz Bootstrap 3 Exercise Quiz Bootstrap 4 Exercise Quiz Bootstrap 5 Exercise Quiz Data Analytics DSA Exercise Quiz NumPy Exercise Quiz Pandas Exercise Quiz SciPy Exercise Quiz Excel Exercise What is an Exercise? What is a Quiz? JavaScript JavaScript Exercise Quiz React Exercise Quiz jQuery Exercise Quiz Vue Exercise Quiz Angular Exercise Quiz Backend Python Exercise Quiz SQL Exercise Quiz MySQL Exercise Quiz PHP Exercise Quiz Java Exercise Quiz C Exercise Quiz C++ Exercise Quiz C# Exercise Quiz R Exercise Quiz Kotlin Exercise Quiz Django Exercise Quiz Node.js Exercise Quiz PostgreSQL Exercise Quiz TypeScript Exercise Quiz Git Exercise Quiz Bash Exercise Quiz Go Exercise MongoDB Exercise Data Analytics DSA Exercise Quiz NumPy Exercise Quiz Pandas Exercise Quiz SciPy Exercise Quiz Excel Exercise What is an Exercise? What is a Quiz? × Certificates Filter field for certifications × HTML and CSS HTML Certificate Course CSS Certificate Course Bootstrap 3 Certificate Course Bootstrap 4 Certificate Course Bootstrap 5 Certificate Data Analytics DSA Certificate Data Analytics Course NumPy Certificate Course Pandas Certificate Course Excel Certificate Social Media Course What is a Certificate? Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course JavaScript JavaScript Certificate Course React Certificate Course jQuery Certificate Course Vue Certificate Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course Backend Python Certificate Course SQL Certificate Course MySQL Certificate PHP Certificate Course Java Certificate Course C Certificate C++ Certificate Course C# Certificate Course R Course Django Certificate NodeJS Certificate TypeScript Certificate Course XML Certificate Course Cyber Security Certificate Course Accessibility Certificate Course Data Analytics DSA Exam Data Analytics Course NumPy Course Pandas Course Excel Certificate Social Media Course What is a Certificate? × All Our Services Dark mode  Services filter input × W3Schools offers a wide range of services and products for beginners and professionals, helping millions of people everyday to learn and master new skills. Free Tutorials Enjoy our free tutorials like millions of other internet users since 1999 References Explore our selection of references covering all popular coding languages Create a Website Create your own website with W3Schools Spaces - no setup required Exercises Test your skills with different exercises Quizzes Test yourself with multiple choice questions Get Certified Document your knowledge Log in / Sign Up Create a free W3Schools Account to Improve Your Learning Experience My Learning Track your learning progress at W3Schools and collect rewards Upgrade Become a PLUS user and unlock powerful features (ad-free, hosting, support,..) Where To Start Not sure where you want to start? Follow our guided path Code Editor (Try it) With our online code editor, you can edit code and view the result in your browser Videos Learn the basics of HTML in a fun and engaging video tutorial Templates We have created a bunch of responsive website templates you can use - for free! Web Hosting Host your own website, and share it to the world with W3Schools Spaces Create a Server Create your own server using Python, PHP, React.js, Node.js, Java, C#, etc. How To's Large collection of code snippets for HTML, CSS and JavaScript CSS Framework Build fast and responsive sites using our free W3.CSS framework Browser Statistics Read long term trends of browser usage Typing Speed Test your typing speed Color Picker Use our color picker to find different RGB, HEX and HSL colors. Code Game W3Schools Coding Game! Help the lynx collect pine cones Newsletter Join our newsletter and get access to exclusive content every month For Teachers Contact us about W3Schools Academy for educational institutions For Businesses Contact us about W3Schools Academy for your organization Contact Us About sales: sales@w3schools.com About errors: help@w3schools.com Emojis Reference Check out our refererence page with all the emojis supported in HTML 😊 UTF-8 Reference Check out our full UTF-8 Character reference     × ❮ ❯ HTML CSS JAVASCRIPT SQL PYTHON JAVA PHP HOW TO W3.CSS C C++ C# BOOTSTRAP REACT MYSQL JQUERY EXCEL XML DJANGO NUMPY PANDAS NODEJS DSA TYPESCRIPT ANGULAR ANGULARJS GIT POSTGRESQL MONGODB ASP AI R GO KOTLIN SASS VUE GEN AI SCIPY CYBERSECURITY DATA SCIENCE INTRO TO PROGRAMMING BASH RUST Learn to Code With the world's largest web developer site. Not Sure Where To Begin? HTML The language for building web pages Learn HTML Video Tutorial HTML Reference Get Certified HTML Example: <!DOCTYPE html> <html> <head> <title>HTML Tutorial</title> </head> <body> <h1>This is a heading</h1> <p>This is a paragraph.</p> </body> </html> Try it Yourself CSS The language for styling web pages Learn CSS CSS Reference Get Certified CSS Example: body { background-color: lightblue; } h1 { color: white; text-align: center; } p { font-family: verdana; } Try it Yourself JavaScript The language for programming web pages Learn JavaScript JavaScript Reference Get Certified JavaScript Example: <button onclick=\"myFunction()\">Click Me!</button> <script> function myFunction() { let x = document.getElementById(\"demo\"); x.style.fontSize = \"25px\"; x.style.color = \"red\"; } </script> Try it Yourself Python A popular programming language Learn Python Python Reference Get Certified Python Example: if 5 > 2: print(\"Five is greater than two!\") Try it Yourself SQL A language for accessing databases Learn SQL SQL Reference Get Certified SQL Example: SELECT * FROM Customers WHERE Country='Mexico'; Try it Yourself PHP A web server programming language Learn PHP jQuery A JS library for developing web pages Learn jQuery Java A programming language Learn Java C++ A programming language Learn C++ W3.CSS A CSS framework for faster and better responsive web pages Learn W3.CSS Bootstrap A CSS framework for designing better web pages Learn Bootstrap C C# R Kotlin Node.js React JSON Vue MySQL XML Sass Icons RWD Graphics SVG Canvas Raspberry Pi Cyber Security Colors Git Matplotlib NumPy Pandas SciPy ASP AngularJS AppML Go TypeScript Django MongoDB Statistics Data Science PostgreSQL HowTo Rust Spaces Typing Speed Excel DSA - D ata S tructures and A lgorithms Machine Learning Artificial Intelligence Introduction to Programming Bash Log in / Sign Up Create a free account to track your progress, and get access to more features and learning materials. Sign Up for Free Code Editor With our online code editor, you can edit code and view the result in your browser Frontend Backend Try Frontend Editor (HTML/CSS/JS) Try Backend Editor (Python/PHP/Java/C..) W3Schools Spaces If you want to create your own website, check out W3Schools Spaces . It is free to use, and does not require any setup: Learn More Become a Plus User And unlock powerful features: Browse W3Schools without ads Build and host Websites Unlimited challenges Unlimited practice tests Get extra credits Priority support Learn More For Teachers Streamline your teaching: Manage your classroom Ready-to-use learning materials Customize study plans Track student progress Interactive coding challenges Learn More Color Picker W3Schools' famous color picker: Code Game Help the Lynx collect pine cones! Play Game Exercises and Quizzes Test your skills! Exercises Quizzes Web Templates Browse our selection of free responsive HTML Templates Browse Templates Kickstart your career Get certified by completing a course Get started w 3 s c h o o l s C E R T I F I E D . 2 0 2 5 How To Section Code snippets for HTML, CSS and JavaScript For example, how to create a slideshow: Learn How To ★ +1 Sign in to track progress PLUS SPACES GET CERTIFIED FOR TEACHERS FOR BUSINESS CONTACT US × Contact Sales If you want to use W3Schools services as an educational institution, team or enterprise, send us an e-mail: sales@w3schools.com Report Error If you want to report an error, or if you want to make a suggestion, send us an e-mail: help@w3schools.com Top Tutorials HTML Tutorial CSS Tutorial JavaScript Tutorial How To Tutorial SQL Tutorial Python Tutorial W3.CSS Tutorial Bootstrap Tutorial PHP Tutorial Java Tutorial C++ Tutorial jQuery Tutorial Top References HTML Reference CSS Reference JavaScript Reference SQL Reference Python Reference W3.CSS Reference Bootstrap Reference PHP Reference HTML Colors Java Reference AngularJS Reference jQuery Reference Top Examples HTML Examples CSS Examples JavaScript Examples How To Examples SQL Examples Python Examples W3.CSS Examples Bootstrap Examples PHP Examples Java Examples XML Examples jQuery Examples Get Certified HTML Certificate CSS Certificate JavaScript Certificate Front End Certificate SQL Certificate Python Certificate PHP Certificate jQuery Certificate Java Certificate C++ Certificate C# Certificate XML Certificate     FORUM ABOUT ACADEMY W3Schools is optimized for learning and training. Examples might be simplified to improve reading and learning. Tutorials, references, and examples are constantly reviewed to avoid errors, but we cannot warrant full correctness of all content. While using W3Schools, you agree to have read and accepted our terms of use , cookie and privacy policy . Copyright 1999-2025 by Refsnes Data. All Rights Reserved. W3Schools is Powered by W3.CSS ."}
{"url": "https://www.w3schools.com/w3css/default.asp", "title": "W3.CSS Home", "text": "W3.CSS Home Tutorials References Exercises Certificates Menu Search field × See More Sign In ★ +1 Get Certified Upgrade For Teachers Spaces Get Certified Upgrade For Teachers Spaces  My W3Schools Tutorials References Exercises Certificates Spaces Get Certified Plus Academy All our Services Logout     × Tutorials Tutorials filter input × HTML and CSS Learn HTML Tutorial Reference Learn CSS Tutorial Reference Learn RWD Tutorial Learn Bootstrap Overview Learn W3.CSS Tutorial Reference Learn Sass Tutorial Reference Learn Colors Tutorial Reference Learn Icons Tutorial Reference Learn SVG Tutorial Reference Learn Canvas Tutorial Reference Learn Graphics Tutorial Learn UTF-8 and Emojis Reference Learn How To Tutorial Data Analytics Learn AI Tutorial Learn Generative AI Tutorial Learn ChatGPT-3.5 Tutorial Learn ChatGPT-4 Tutorial Learn Google Bard Tutorial Learn Machine Learning Tutorial Learn DSA Tutorial Learn Data Science Tutorial Learn NumPy Tutorial Learn Pandas Tutorial Learn SciPy Tutorial Learn Matplotlib Tutorial Learn Statistics Tutorial Learn Excel Tutorial Learn Google Sheets Tutorial Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter JavaScript Learn JavaScript Tutorial Reference Learn React Tutorial Learn jQuery Tutorial Reference Learn Vue Tutorial Reference Learn Angular Tutorial Learn AngularJS Tutorial Reference Learn JSON Tutorial Reference Learn AJAX Tutorial Learn AppML Tutorial Reference Learn W3.JS Tutorial Reference Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter Backend Learn Python Tutorial Reference Learn SQL Tutorial Reference Learn MySQL Tutorial Reference Learn PHP Tutorial Reference Learn Java Tutorial Reference Learn C Tutorial Reference Learn C++ Tutorial Reference Learn C# Tutorial Learn R Tutorial Learn Kotlin Tutorial Learn Rust Tutorial Learn Go Tutorial Learn Django Tutorial Reference Learn PostgreSQL Tutorial Learn TypeScript Tutorial Learn ASP Tutorial Reference Learn Node.js Tutorial Reference Learn Raspberry Pi Tutorial Learn Git Tutorial Learn Bash Tutorial Learn MongoDB Tutorial Learn XML Tutorial Reference Data Analytics Learn AI Tutorial Learn Generative AI Tutorial Learn ChatGPT-3.5 Tutorial Learn ChatGPT-4 Tutorial Learn Google Bard Tutorial Learn Machine Learning Tutorial Learn DSA Tutorial Learn Data Science Tutorial Learn NumPy Tutorial Learn Pandas Tutorial Learn SciPy Tutorial Learn Matplotlib Tutorial Learn Statistics Tutorial Learn Excel Tutorial Learn Google Sheets Tutorial Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter × References References filter input × HTML and CSS HTML Tags Reference CSS Reference W3.CSS Reference Bootstrap 3 Reference Bootstrap 4 Reference Color Names Icons Reference SVG Reference Canvas Reference Sass Reference UTF-8 Charset Reference UTF-8 Emojis Reference JavaScript JavaScript Reference jQuery Reference Vue Reference Angular Reference JSON Reference AppML Reference W3.JS Reference Backend Python Reference SQL Reference MySQL Reference PHP Reference Java Reference C Reference C++ Reference Django Reference ASP Reference Node.js Reference XML Reference × Exercises Excercises filter input × HTML and CSS HTML Exercise Quiz CSS Exercise Quiz Bootstrap 3 Exercise Quiz Bootstrap 4 Exercise Quiz Bootstrap 5 Exercise Quiz Data Analytics DSA Exercise Quiz NumPy Exercise Quiz Pandas Exercise Quiz SciPy Exercise Quiz Excel Exercise What is an Exercise? What is a Quiz? JavaScript JavaScript Exercise Quiz React Exercise Quiz jQuery Exercise Quiz Vue Exercise Quiz Angular Exercise Quiz Backend Python Exercise Quiz SQL Exercise Quiz MySQL Exercise Quiz PHP Exercise Quiz Java Exercise Quiz C Exercise Quiz C++ Exercise Quiz C# Exercise Quiz R Exercise Quiz Kotlin Exercise Quiz Django Exercise Quiz Node.js Exercise Quiz PostgreSQL Exercise Quiz TypeScript Exercise Quiz Git Exercise Quiz Bash Exercise Quiz Go Exercise MongoDB Exercise Data Analytics DSA Exercise Quiz NumPy Exercise Quiz Pandas Exercise Quiz SciPy Exercise Quiz Excel Exercise What is an Exercise? What is a Quiz? × Certificates Filter field for certifications × HTML and CSS HTML Certificate Course CSS Certificate Course Bootstrap 3 Certificate Course Bootstrap 4 Certificate Course Bootstrap 5 Certificate Data Analytics DSA Certificate Data Analytics Course NumPy Certificate Course Pandas Certificate Course Excel Certificate Social Media Course What is a Certificate? Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course JavaScript JavaScript Certificate Course React Certificate Course jQuery Certificate Course Vue Certificate Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course Backend Python Certificate Course SQL Certificate Course MySQL Certificate PHP Certificate Course Java Certificate Course C Certificate C++ Certificate Course C# Certificate Course R Course Django Certificate NodeJS Certificate TypeScript Certificate Course XML Certificate Course Cyber Security Certificate Course Accessibility Certificate Course Data Analytics DSA Exam Data Analytics Course NumPy Course Pandas Course Excel Certificate Social Media Course What is a Certificate? × All Our Services Dark mode  Services filter input × W3Schools offers a wide range of services and products for beginners and professionals, helping millions of people everyday to learn and master new skills. Free Tutorials Enjoy our free tutorials like millions of other internet users since 1999 References Explore our selection of references covering all popular coding languages Create a Website Create your own website with W3Schools Spaces - no setup required Exercises Test your skills with different exercises Quizzes Test yourself with multiple choice questions Get Certified Document your knowledge Log in / Sign Up Create a free W3Schools Account to Improve Your Learning Experience My Learning Track your learning progress at W3Schools and collect rewards Upgrade Become a PLUS user and unlock powerful features (ad-free, hosting, support,..) Where To Start Not sure where you want to start? Follow our guided path Code Editor (Try it) With our online code editor, you can edit code and view the result in your browser Videos Learn the basics of HTML in a fun and engaging video tutorial Templates We have created a bunch of responsive website templates you can use - for free! Web Hosting Host your own website, and share it to the world with W3Schools Spaces Create a Server Create your own server using Python, PHP, React.js, Node.js, Java, C#, etc. How To's Large collection of code snippets for HTML, CSS and JavaScript CSS Framework Build fast and responsive sites using our free W3.CSS framework Browser Statistics Read long term trends of browser usage Typing Speed Test your typing speed Color Picker Use our color picker to find different RGB, HEX and HSL colors. Code Game W3Schools Coding Game! Help the lynx collect pine cones Newsletter Join our newsletter and get access to exclusive content every month For Teachers Contact us about W3Schools Academy for educational institutions For Businesses Contact us about W3Schools Academy for your organization Contact Us About sales: sales@w3schools.com About errors: help@w3schools.com Emojis Reference Check out our refererence page with all the emojis supported in HTML 😊 UTF-8 Reference Check out our full UTF-8 Character reference     × ❮ ❯ HTML CSS JAVASCRIPT SQL PYTHON JAVA PHP HOW TO W3.CSS C C++ C# BOOTSTRAP REACT MYSQL JQUERY EXCEL XML DJANGO NUMPY PANDAS NODEJS DSA TYPESCRIPT ANGULAR ANGULARJS GIT POSTGRESQL MONGODB ASP AI R GO KOTLIN SASS VUE GEN AI SCIPY CYBERSECURITY DATA SCIENCE INTRO TO PROGRAMMING BASH RUST W3.CSS W3.CSS HOME W3.CSS Intro W3.CSS Colors W3.CSS Containers W3.CSS Panels W3.CSS Borders W3.CSS Cards W3.CSS Defaults W3.CSS Fonts W3.CSS Google W3.CSS Text W3.CSS Round W3.CSS Padding W3.CSS Margins W3.CSS RTL W3.CSS Display W3.CSS Buttons W3.CSS Notes W3.CSS Quotes W3.CSS Alerts W3.CSS Tables W3.CSS Lists W3.CSS Images W3.CSS Inputs W3.CSS Badges W3.CSS Tags W3.CSS Icons W3.CSS Grid W3.CSS Flexbox W3.CSS Flex Items W3.CSS Rows W3.CSS Cells W3.CSS Responsive W3.CSS Dark Mode W3.CSS Animations W3.CSS Effects W3.CSS Bars W3.CSS Dropdowns W3.CSS Accordions W3.CSS Navigation W3.CSS Sidebar W3.CSS Tabs W3.CSS Pagination W3.CSS Progress Bars W3.CSS Slideshow W3.CSS Modal W3.CSS Tooltips W3.CSS Code W3.CSS Filters W3.CSS Trends W3.CSS Case W3.CSS Material W3.CSS Validation W3.CSS Versions W3.CSS Mobile W3.CSS Colors W3.CSS Color Classes W3.CSS Color Material W3.CSS Color Flat UI W3.CSS Color Metro UI W3.CSS Color Win8 W3.CSS Color iOS W3.CSS Color Fashion W3.CSS Color Libraries W3.CSS Color Schemes W3.CSS Color Themes W3.CSS Color Generator Web Building Web Intro Web HTML Web CSS Web JavaScript Web Layout Web Band Web Catering Web Restaurant Web Architect Examples W3.CSS Examples W3.CSS Demos W3.CSS Templates W3.CSS Certificate References W3.CSS Reference W3.CSS Downloads W3.CSS Tutorial ❮ Home Next ❯ W3 CSS W3.CSS is a CSS framework for developing websites and web apps. It provides equality for all browsers (Chrome, Edge, Firefox, Safari, Opera) on all devices (Desktop, Laptop, Tablet, Mobile). W3.CSS is free, open source, and uses standard CSS only (no JavaScript). Start learning W3.CSS now » Note w3-grid and w3-flex is new in W3.CSS 5.0 . w3-grid vs w3-flex w3-grid is for two-dimensional layout, with rows AND columns. w3-flex is for one-dimensional layout, with rows OR columns. Example <div class=\"w3-container w3-teal\"> <h1>My Header</h1> </div> <img src=\"img_car.jpg\" alt=\"Car\"> <div class=\"w3-container\"> <p>A car is a wheeled, self-powered motor vehicle used for transportation.</p> </div> <div class=\"w3-container w3-teal\"> <p>My Footer</p> </div> Try It Yourself » A Quality Alternative to Bootstrap W3.CSS is a modern CSS framework developed by the W3Schools team. It's similar to Bootstrap when it comes to build responsive, mobile-friendly websites, but it is lighter, simpler, and faster, and does not rely on JavaScript or external libraries like jQuery. \"Make it as simple as possible, but not simpler.\" Albert Einstein How To Use W3.CSS To use W3.CSS in your web site, just add a link to w3.css from your web pages: Example <link rel=\"stylesheet\" href=\"https://www.w3schools.com/w3css/5/w3.css\"> Try It Yourself » Or download w3.css from: https://www.w3schools.com/w3css/5/w3.css and add a local link to your downloaded w3.css file: Example <link rel=\"stylesheet\" href=\"w3.css\"> W3.CSS Crash Course How to create web page that looks nice on all devices (desktop, laptop, tablet, and phone). Start the Crash Course » » » W3.CSS Web Site Templates We have created 50 responsive W3CSS templates for you to use. You are free to modify, save, share, use or do whatever you want with them: Catering Template See Demo » Portfolio Template See Demo » Architect Template See Demo » Cafe Template See Demo » Wedding Template See Demo » House Design Template See Demo » Food Template See Demo » See All Templates » ❮ Previous Next ❯ ★ +1 Sign in to track progress COLOR PICKER REMOVE ADS PLUS SPACES GET CERTIFIED FOR TEACHERS FOR BUSINESS CONTACT US × Contact Sales If you want to use W3Schools services as an educational institution, team or enterprise, send us an e-mail: sales@w3schools.com Report Error If you want to report an error, or if you want to make a suggestion, send us an e-mail: help@w3schools.com Top Tutorials HTML Tutorial CSS Tutorial JavaScript Tutorial How To Tutorial SQL Tutorial Python Tutorial W3.CSS Tutorial Bootstrap Tutorial PHP Tutorial Java Tutorial C++ Tutorial jQuery Tutorial Top References HTML Reference CSS Reference JavaScript Reference SQL Reference Python Reference W3.CSS Reference Bootstrap Reference PHP Reference HTML Colors Java Reference AngularJS Reference jQuery Reference Top Examples HTML Examples CSS Examples JavaScript Examples How To Examples SQL Examples Python Examples W3.CSS Examples Bootstrap Examples PHP Examples Java Examples XML Examples jQuery Examples Get Certified HTML Certificate CSS Certificate JavaScript Certificate Front End Certificate SQL Certificate Python Certificate PHP Certificate jQuery Certificate Java Certificate C++ Certificate C# Certificate XML Certificate     FORUM ABOUT ACADEMY W3Schools is optimized for learning and training. Examples might be simplified to improve reading and learning. Tutorials, references, and examples are constantly reviewed to avoid errors, but we cannot warrant full correctness of all content. While using W3Schools, you agree to have read and accepted our terms of use , cookie and privacy policy . Copyright 1999-2025 by Refsnes Data. All Rights Reserved. W3Schools is Powered by W3.CSS ."}
{"url": "https://www.w3schools.com/about/about_copyright.asp", "title": "About Terms of Service", "text": "About Terms of Service Tutorials References Exercises Certificates Menu Search field × See More Sign In ★ +1 Get Certified Upgrade For Teachers Spaces Get Certified Upgrade For Teachers Spaces  My W3Schools Tutorials References Exercises Certificates Spaces Get Certified Plus Academy All our Services Logout     × Tutorials Tutorials filter input × HTML and CSS Learn HTML Tutorial Reference Learn CSS Tutorial Reference Learn RWD Tutorial Learn Bootstrap Overview Learn W3.CSS Tutorial Reference Learn Sass Tutorial Reference Learn Colors Tutorial Reference Learn Icons Tutorial Reference Learn SVG Tutorial Reference Learn Canvas Tutorial Reference Learn Graphics Tutorial Learn UTF-8 and Emojis Reference Learn How To Tutorial Data Analytics Learn AI Tutorial Learn Generative AI Tutorial Learn ChatGPT-3.5 Tutorial Learn ChatGPT-4 Tutorial Learn Google Bard Tutorial Learn Machine Learning Tutorial Learn DSA Tutorial Learn Data Science Tutorial Learn NumPy Tutorial Learn Pandas Tutorial Learn SciPy Tutorial Learn Matplotlib Tutorial Learn Statistics Tutorial Learn Excel Tutorial Learn Google Sheets Tutorial Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter JavaScript Learn JavaScript Tutorial Reference Learn React Tutorial Learn jQuery Tutorial Reference Learn Vue Tutorial Reference Learn Angular Tutorial Learn AngularJS Tutorial Reference Learn JSON Tutorial Reference Learn AJAX Tutorial Learn AppML Tutorial Reference Learn W3.JS Tutorial Reference Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter Backend Learn Python Tutorial Reference Learn SQL Tutorial Reference Learn MySQL Tutorial Reference Learn PHP Tutorial Reference Learn Java Tutorial Reference Learn C Tutorial Reference Learn C++ Tutorial Reference Learn C# Tutorial Learn R Tutorial Learn Kotlin Tutorial Learn Rust Tutorial Learn Go Tutorial Learn Django Tutorial Reference Learn PostgreSQL Tutorial Learn TypeScript Tutorial Learn ASP Tutorial Reference Learn Node.js Tutorial Reference Learn Raspberry Pi Tutorial Learn Git Tutorial Learn Bash Tutorial Learn MongoDB Tutorial Learn XML Tutorial Reference Data Analytics Learn AI Tutorial Learn Generative AI Tutorial Learn ChatGPT-3.5 Tutorial Learn ChatGPT-4 Tutorial Learn Google Bard Tutorial Learn Machine Learning Tutorial Learn DSA Tutorial Learn Data Science Tutorial Learn NumPy Tutorial Learn Pandas Tutorial Learn SciPy Tutorial Learn Matplotlib Tutorial Learn Statistics Tutorial Learn Excel Tutorial Learn Google Sheets Tutorial Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter × References References filter input × HTML and CSS HTML Tags Reference CSS Reference W3.CSS Reference Bootstrap 3 Reference Bootstrap 4 Reference Color Names Icons Reference SVG Reference Canvas Reference Sass Reference UTF-8 Charset Reference UTF-8 Emojis Reference JavaScript JavaScript Reference jQuery Reference Vue Reference Angular Reference JSON Reference AppML Reference W3.JS Reference Backend Python Reference SQL Reference MySQL Reference PHP Reference Java Reference C Reference C++ Reference Django Reference ASP Reference Node.js Reference XML Reference × Exercises Excercises filter input × HTML and CSS HTML Exercise Quiz CSS Exercise Quiz Bootstrap 3 Exercise Quiz Bootstrap 4 Exercise Quiz Bootstrap 5 Exercise Quiz Data Analytics DSA Exercise Quiz NumPy Exercise Quiz Pandas Exercise Quiz SciPy Exercise Quiz Excel Exercise What is an Exercise? What is a Quiz? JavaScript JavaScript Exercise Quiz React Exercise Quiz jQuery Exercise Quiz Vue Exercise Quiz Angular Exercise Quiz Backend Python Exercise Quiz SQL Exercise Quiz MySQL Exercise Quiz PHP Exercise Quiz Java Exercise Quiz C Exercise Quiz C++ Exercise Quiz C# Exercise Quiz R Exercise Quiz Kotlin Exercise Quiz Django Exercise Quiz Node.js Exercise Quiz PostgreSQL Exercise Quiz TypeScript Exercise Quiz Git Exercise Quiz Bash Exercise Quiz Go Exercise MongoDB Exercise Data Analytics DSA Exercise Quiz NumPy Exercise Quiz Pandas Exercise Quiz SciPy Exercise Quiz Excel Exercise What is an Exercise? What is a Quiz? × Certificates Filter field for certifications × HTML and CSS HTML Certificate Course CSS Certificate Course Bootstrap 3 Certificate Course Bootstrap 4 Certificate Course Bootstrap 5 Certificate Data Analytics DSA Certificate Data Analytics Course NumPy Certificate Course Pandas Certificate Course Excel Certificate Social Media Course What is a Certificate? Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course JavaScript JavaScript Certificate Course React Certificate Course jQuery Certificate Course Vue Certificate Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course Backend Python Certificate Course SQL Certificate Course MySQL Certificate PHP Certificate Course Java Certificate Course C Certificate C++ Certificate Course C# Certificate Course R Course Django Certificate NodeJS Certificate TypeScript Certificate Course XML Certificate Course Cyber Security Certificate Course Accessibility Certificate Course Data Analytics DSA Exam Data Analytics Course NumPy Course Pandas Course Excel Certificate Social Media Course What is a Certificate? × All Our Services Dark mode  Services filter input × W3Schools offers a wide range of services and products for beginners and professionals, helping millions of people everyday to learn and master new skills. Free Tutorials Enjoy our free tutorials like millions of other internet users since 1999 References Explore our selection of references covering all popular coding languages Create a Website Create your own website with W3Schools Spaces - no setup required Exercises Test your skills with different exercises Quizzes Test yourself with multiple choice questions Get Certified Document your knowledge Log in / Sign Up Create a free W3Schools Account to Improve Your Learning Experience My Learning Track your learning progress at W3Schools and collect rewards Upgrade Become a PLUS user and unlock powerful features (ad-free, hosting, support,..) Where To Start Not sure where you want to start? Follow our guided path Code Editor (Try it) With our online code editor, you can edit code and view the result in your browser Videos Learn the basics of HTML in a fun and engaging video tutorial Templates We have created a bunch of responsive website templates you can use - for free! Web Hosting Host your own website, and share it to the world with W3Schools Spaces Create a Server Create your own server using Python, PHP, React.js, Node.js, Java, C#, etc. How To's Large collection of code snippets for HTML, CSS and JavaScript CSS Framework Build fast and responsive sites using our free W3.CSS framework Browser Statistics Read long term trends of browser usage Typing Speed Test your typing speed Color Picker Use our color picker to find different RGB, HEX and HSL colors. Code Game W3Schools Coding Game! Help the lynx collect pine cones Newsletter Join our newsletter and get access to exclusive content every month For Teachers Contact us about W3Schools Academy for educational institutions For Businesses Contact us about W3Schools Academy for your organization Contact Us About sales: sales@w3schools.com About errors: help@w3schools.com Emojis Reference Check out our refererence page with all the emojis supported in HTML 😊 UTF-8 Reference Check out our full UTF-8 Character reference     × ❮ ❯ HTML CSS JAVASCRIPT SQL PYTHON JAVA PHP HOW TO W3.CSS C C++ C# BOOTSTRAP REACT MYSQL JQUERY EXCEL XML DJANGO NUMPY PANDAS NODEJS DSA TYPESCRIPT ANGULAR ANGULARJS GIT POSTGRESQL MONGODB ASP AI R GO KOTLIN SASS VUE GEN AI SCIPY CYBERSECURITY DATA SCIENCE INTRO TO PROGRAMMING BASH RUST About Us About W3Schools About Terms About Privacy About Cookies Terms of Service ❮ Previous Next ❯ Introduction Welcome to W3Schools. By visiting W3Schools.com (\"Website\") or using our products and services (\"Services\"), you agree to the terms and conditions (hereafter referred to as the \"Terms\"). The Terms apply to everyone using the Website, including without limitation, visitors, vendors, customers, merchants, and content contributors. Please read the Terms carefully before using the Website or the Services. By accessing any part of the Website, you agree to be bound by the Terms. If you don't agree with the Terms, you shouldn't access the Website or use our Services. Overview The Website is operated and managed by Refsnes Data AS (\"Refsnes\") and W3Schools Network AS (\"Network\"), collectively referred to as \"W3Schools\". Refsnes provides the Website including all content, information, and related tools. Network operates certain solutions (such as Spaces, Academy, Courses, Challenges, and My Learning) and a billing system. The two entities Refsnes and Network are separately responsible for the Services they provide, manage and operate. Any new features or tools added to the Website shall be subject to the Terms. You can review the most current version of the Terms at any time on this page. We reserve the right to update, change, or replace parts of the Terms by posting updates or changes at the Website. Please check this page periodically for changes. Your continued use of or access to the Website after posting any changes constitutes acceptance of such changes. Use of the Website and the Services Our Service is generally not intended for users under the age of 16. We do not knowingly collect personal information from anyone under the age of 13 in ways not allowed by the Children's Online Privacy Protection Act (COPPA). If you are a parent or legal guardian and believe that your child has shared personal information in a way that is not allowed by law, please contact us at help@w3schools.com. We will look into it and delete the information as required by law. When a school uses our Services in an educational setting, it is the school's responsibility to ensure it has the legal right to share student information with us. This includes getting parental consent where the law requires it, such as under COPPA. By using our services on behalf of students, the school confirms that it has obtained or holds all the necessary permissions. Some parts of the Services require you to create an account. When you register, we collect information about you, like your name and email address. Your account information and how we use your data are detailed in our Privacy Policy . You agree not to use our products for illegal or unauthorized purposes. You must comply with all laws, rules, and regulations, including copyright laws. Do not transmit any viruses, worms, or harmful code through the Services. If you breach our Terms, we may terminate your access to the Services immediately. At our sole discretion, we reserve the right to remove or restrict your account and any content you've created, such as websites or other user-generated data. Intellectual Property Rights and Fair Use All content provided by W3Schools, including text, graphics, logos, images, and software, is owned by W3Schools. Any use beyond what is specifically allowed under the Terms is forbidden, ref. the Norwegian \"Lov om opphavsrett til Ã¥ndsverk m.v.\" Fair Use You can still use W3Schools copyright material under fair use for: Research News reporting Citations Commentary Fair use also includes: Linking to W3Schools Including references to W3Schools in search engines Using W3Schools in Teaching Fair use allows the use of copyrighted material in teaching, provided it meets the following guidelines: Permitted Use Copying examples and code snippets for non-profit teaching or research Copying small portions suitable for classroom instruction Not Permitted Use Copying for profitable or commercial use Mass or verbatim copying Copying large portions of material Privacy and Cookies By using the Website and the Services, any users thereby consent to W3Schools collecting, using, and processing the user's personal data as outlined in the Privacy Policy . Users have certain rights regarding their data. For more information on these rights and how to exercise them, please see our Privacy Policy . We use cookies and similar tracking technologies to improve user experience. For more information on how we use cookies, please see our Cookie Policy . Products and Services To keep our offerings current, product descriptions and prices are subject to change at any time without prior notice. Without warning, we can discontinue the supply of any Services if our rules and guidelines or applicable laws are violated. We seek to maintain high standards and to provide accurate information. However, we cannot guarantee that every product, service, or element of information will meet your expectations. Modifications to the Service and Prices By ordering a subscription, the price for such subscription will remain firm for the period the subscription is purchased for. We reserve the right to adjust prices for any subsequent period(s). We are not liable to you or any third party for any loss suffered due to modifications to the Website, price adjustments, suspension or discontinuation of the Service. Accuracy and Completeness of Information We do our best to provide accurate and current information. However, we cannot guarantee that everything on the Website is complete or always up to date. Please do not rely solely on the material at the Website when making important decisions. You are using the information on the Website at your own risk. Some of the content you find on the Website may be historical. Since historical information may become incorrect we provide at the Website such information for reference only. We can change the contents of the Website at any time without creating a liability for W3Schools. It's your responsibility to keep track of any changes. If you find any errors, please let us know at help@w3schools.com so we can correct them. Refund Policy Exams and Courses: You can withdraw from a course or exam within 14 days of receiving your initial access (marked by the date we send you the access email). If you have already used any exam attempts, the purchase is final and not eligible for a refund. For questions or issues related to the product you have purchased, please contact us at hello@w3schools.com . Plans and Subscriptions: We do not provide refunds for plans or subscriptions. You may cancel your subscription anytime, but no refunds will be issued for the period you paid for. Domains We provide a domain purchasing service that seamlessly integrates with the W3Schools web hosting and development platform (\"Spaces\"). It allows you to search, select, and purchase a domain that automatically links to your Spaces. When you buy a domain, you become its sole owner and must follow all related terms and conditions. W3Schools works with third-party providers, such as Amazon and its Route 53 services, for domain registration and distribution. You can review their terms here: Amazon Route 53 Domain Registration Agreement Amazon Registrar Policy Page Gandi Contract Page As the distributor, W3Schools handles purchasing and billing. If you have any complaints, claims, or concerns about these third-party products, please contact us at support@w3schools.com . The mutual agreement for a domain renews automatically each year. If you don't want to continue with a domain purchase from us, you must cancel the renewal before the end of the current agreement. See the Billing and Account Information section for more billing information. We are not liable for any harm, errors, or omissions caused by the domain registry administrator's actions, including domain registration or renewal requests. Before purchasing a domain, please review all associated third-party policies and practices to ensure you understand their terms. Billing and Account Information We reserve the right to refuse any order placed with us. At our sole discretion, we can limit or cancel the quantities purchased by any individual, household, or for any specific order. These restrictions also apply to orders made under the same customer account, using the same payment method, or associated with the same billing or shipping address. If we need to change or cancel an order, we will email you using the email address you provided at the time of purchase. Please know that you agree to provide current, complete, and accurate purchase and account information for all orders made through our website. You must keep your account details updated at all times, including your email address and payment method, so we can process your transactions and contact you if needed. Optional Tools and Third-Party Links We sometimes provide access to third-party tools we do not develop, monitor, or control. These tools are offered \"as is\" and \"as available,\" without warranties, endorsements, or promises. We are not responsible for any issues or damages that arise from your use of these optional third-party tools. If you choose to use these tools, you do so at your own risk. Before you proceed with any such tools, please ensure you understand and agree to the terms set by the third-party provider. The Website may include links to external websites or services we do not operate or control. While we try to avoid linking to harmful or offensive content, we cannot guarantee the accuracy or quality of third-party materials, products, or services. We are not liable for any harm or damages you experience with third-party websites or services. Before you engage in any transaction with a third party, review their policies and practices to ensure you are comfortable with them. If you have complaints, claims, concerns, or questions about third-party products or services, please direct them to the appropriate third party. Errors, Inaccuracies, and Omissions Occasionally, the information on the Website or the Service contains typographical errors, inaccuracies, or omissions related to product descriptions, pricing, promotions, offers, product shipping charges, transit times, or availability. We reserve the right to correct these errors, inaccuracies, or omissions and to change or update information or cancel orders if the information on the Website or the Services is inaccurate. We can do this at any time without prior notice, including after you have placed an order. Prohibited Use In addition to other restrictions described in these Terms, the following activities are forbidden when using the Website or its content: Engaging in any unlawful activity Encouraging others to engage in unlawful activities Violating international, national, regional, or local laws, regulations, or rules Infringing upon our intellectual property rights or those of others Harassing, abusing, insulting, harming, defaming, slandering, disparaging, intimidating, or discriminating against any individual or group, including but not limited to those defined by gender, sexual orientation, religion, ethnicity, race, age, national origin, or disability Providing false or misleading information Uploading or transmitting viruses, malicious code, or any harmful elements designed to affect the functionality or operation of the Service, any related website, other websites, or the broader Internet Collecting or tracking personal information about others without authorization Engaging in spamming, phishing, pharming, pretexting, spidering, crawling, or scraping Using the Website or its content for offensive or unethical purposes Interfering with or attempting to bypass the security features of the Service, related websites, other websites, or the Internet in general We reserve the right to terminate your use of the Website or the Services if you engage in prohibited activities. Disclaimer of Warranties and Limitation of Liability We do not guarantee that using the Service will be uninterrupted, timely, secure, or error-free. We do not guarantee that results obtained using the Service will be accurate or reliable. You create and own your user-generated content and are fully responsible for it. W3Schools is not liable for any errors or faults in your user-generated content. By using the Service, you accept that you do so at your own risk. Unless otherwise stated, we offer the Website and the Services \"as is\" and \"as available\" without express or implied warranties or guarantees. Under no circumstances shall W3Schools, its directors, officers, employees, affiliates, agents, contractors, interns, suppliers, service providers, or licensors be held liable for any injury, loss, claim, or any direct, indirect, incidental, punitive, special, or consequential damages of any kind. Indemnification By using our Services, you agree that W3Schools and its related parties (owners, subsidiaries, affiliates, partners, officers, directors, agents, contractors, licensors, service providers, subcontractors, suppliers, interns, and employees) are not responsible for any third-party claims or lawsuits that come from your violation of these Terms, any referenced documents, or any laws or rights of others. In addition, W3Schools reserves the right to claim from you a reasonable attorney's fee incurred by W3Schools and/or its Associates in relation to your breach. Entire Agreement If we fail to exercise or enforce any right or provision of these Terms, this does not mean we give up that right or provision. These Terms and any policies or rules on the Website make up the entire agreement between you and W3Schools. They govern your use of the Service and replace any previous agreements or discussions, whether written or spoken between you and W3Schools. Any uncertainty in interpreting these Terms should not be used to disadvantage the party responsible for drafting them. Governing Law and Jurisdiction These Terms and any separate agreements whereby we provide you with the Services shall be governed by and construed in accordance with the laws of Norway unless otherwise agreed to and accepted by W3Schools. In that case, it will only apply to the signing entity. You acknowledge that these Terms form a contract between you and W3Schools, even if they are presented electronically and not physically signed. This contract governs your use of the Services. Changes to the Terms You can review this page's most up-to-date version of these Terms anytime. We reserve the right to update, change, or replace any part of these Terms by posting updates on our website. It's your responsibility to check our website regularly for changes. If you continue to use or access the Website or the Service after we post changes, you thereby accept those changes. Contact Information If you have any questions or concerns about these Terms, please contact us at help@w3schools.com Last updated: 2025.05.19 ❮ Previous Next ❯ ★ +1 Sign in to track progress COLOR PICKER REMOVE ADS PLUS SPACES GET CERTIFIED FOR TEACHERS FOR BUSINESS CONTACT US × Contact Sales If you want to use W3Schools services as an educational institution, team or enterprise, send us an e-mail: sales@w3schools.com Report Error If you want to report an error, or if you want to make a suggestion, send us an e-mail: help@w3schools.com Top Tutorials HTML Tutorial CSS Tutorial JavaScript Tutorial How To Tutorial SQL Tutorial Python Tutorial W3.CSS Tutorial Bootstrap Tutorial PHP Tutorial Java Tutorial C++ Tutorial jQuery Tutorial Top References HTML Reference CSS Reference JavaScript Reference SQL Reference Python Reference W3.CSS Reference Bootstrap Reference PHP Reference HTML Colors Java Reference AngularJS Reference jQuery Reference Top Examples HTML Examples CSS Examples JavaScript Examples How To Examples SQL Examples Python Examples W3.CSS Examples Bootstrap Examples PHP Examples Java Examples XML Examples jQuery Examples Get Certified HTML Certificate CSS Certificate JavaScript Certificate Front End Certificate SQL Certificate Python Certificate PHP Certificate jQuery Certificate Java Certificate C++ Certificate C# Certificate XML Certificate     FORUM ABOUT ACADEMY W3Schools is optimized for learning and training. Examples might be simplified to improve reading and learning. Tutorials, references, and examples are constantly reviewed to avoid errors, but we cannot warrant full correctness of all content. While using W3Schools, you agree to have read and accepted our terms of use , cookie and privacy policy . Copyright 1999-2025 by Refsnes Data. All Rights Reserved. W3Schools is Powered by W3.CSS ."}
{"url": "https://www.w3schools.com/about/about_privacy.asp", "title": "About Privacy", "text": "About Privacy Tutorials References Exercises Certificates Menu Search field × See More Sign In ★ +1 Get Certified Upgrade For Teachers Spaces Get Certified Upgrade For Teachers Spaces  My W3Schools Tutorials References Exercises Certificates Spaces Get Certified Plus Academy All our Services Logout     × Tutorials Tutorials filter input × HTML and CSS Learn HTML Tutorial Reference Learn CSS Tutorial Reference Learn RWD Tutorial Learn Bootstrap Overview Learn W3.CSS Tutorial Reference Learn Sass Tutorial Reference Learn Colors Tutorial Reference Learn Icons Tutorial Reference Learn SVG Tutorial Reference Learn Canvas Tutorial Reference Learn Graphics Tutorial Learn UTF-8 and Emojis Reference Learn How To Tutorial Data Analytics Learn AI Tutorial Learn Generative AI Tutorial Learn ChatGPT-3.5 Tutorial Learn ChatGPT-4 Tutorial Learn Google Bard Tutorial Learn Machine Learning Tutorial Learn DSA Tutorial Learn Data Science Tutorial Learn NumPy Tutorial Learn Pandas Tutorial Learn SciPy Tutorial Learn Matplotlib Tutorial Learn Statistics Tutorial Learn Excel Tutorial Learn Google Sheets Tutorial Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter JavaScript Learn JavaScript Tutorial Reference Learn React Tutorial Learn jQuery Tutorial Reference Learn Vue Tutorial Reference Learn Angular Tutorial Learn AngularJS Tutorial Reference Learn JSON Tutorial Reference Learn AJAX Tutorial Learn AppML Tutorial Reference Learn W3.JS Tutorial Reference Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter Backend Learn Python Tutorial Reference Learn SQL Tutorial Reference Learn MySQL Tutorial Reference Learn PHP Tutorial Reference Learn Java Tutorial Reference Learn C Tutorial Reference Learn C++ Tutorial Reference Learn C# Tutorial Learn R Tutorial Learn Kotlin Tutorial Learn Rust Tutorial Learn Go Tutorial Learn Django Tutorial Reference Learn PostgreSQL Tutorial Learn TypeScript Tutorial Learn ASP Tutorial Reference Learn Node.js Tutorial Reference Learn Raspberry Pi Tutorial Learn Git Tutorial Learn Bash Tutorial Learn MongoDB Tutorial Learn XML Tutorial Reference Data Analytics Learn AI Tutorial Learn Generative AI Tutorial Learn ChatGPT-3.5 Tutorial Learn ChatGPT-4 Tutorial Learn Google Bard Tutorial Learn Machine Learning Tutorial Learn DSA Tutorial Learn Data Science Tutorial Learn NumPy Tutorial Learn Pandas Tutorial Learn SciPy Tutorial Learn Matplotlib Tutorial Learn Statistics Tutorial Learn Excel Tutorial Learn Google Sheets Tutorial Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter × References References filter input × HTML and CSS HTML Tags Reference CSS Reference W3.CSS Reference Bootstrap 3 Reference Bootstrap 4 Reference Color Names Icons Reference SVG Reference Canvas Reference Sass Reference UTF-8 Charset Reference UTF-8 Emojis Reference JavaScript JavaScript Reference jQuery Reference Vue Reference Angular Reference JSON Reference AppML Reference W3.JS Reference Backend Python Reference SQL Reference MySQL Reference PHP Reference Java Reference C Reference C++ Reference Django Reference ASP Reference Node.js Reference XML Reference × Exercises Excercises filter input × HTML and CSS HTML Exercise Quiz CSS Exercise Quiz Bootstrap 3 Exercise Quiz Bootstrap 4 Exercise Quiz Bootstrap 5 Exercise Quiz Data Analytics DSA Exercise Quiz NumPy Exercise Quiz Pandas Exercise Quiz SciPy Exercise Quiz Excel Exercise What is an Exercise? What is a Quiz? JavaScript JavaScript Exercise Quiz React Exercise Quiz jQuery Exercise Quiz Vue Exercise Quiz Angular Exercise Quiz Backend Python Exercise Quiz SQL Exercise Quiz MySQL Exercise Quiz PHP Exercise Quiz Java Exercise Quiz C Exercise Quiz C++ Exercise Quiz C# Exercise Quiz R Exercise Quiz Kotlin Exercise Quiz Django Exercise Quiz Node.js Exercise Quiz PostgreSQL Exercise Quiz TypeScript Exercise Quiz Git Exercise Quiz Bash Exercise Quiz Go Exercise MongoDB Exercise Data Analytics DSA Exercise Quiz NumPy Exercise Quiz Pandas Exercise Quiz SciPy Exercise Quiz Excel Exercise What is an Exercise? What is a Quiz? × Certificates Filter field for certifications × HTML and CSS HTML Certificate Course CSS Certificate Course Bootstrap 3 Certificate Course Bootstrap 4 Certificate Course Bootstrap 5 Certificate Data Analytics DSA Certificate Data Analytics Course NumPy Certificate Course Pandas Certificate Course Excel Certificate Social Media Course What is a Certificate? Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course JavaScript JavaScript Certificate Course React Certificate Course jQuery Certificate Course Vue Certificate Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course Backend Python Certificate Course SQL Certificate Course MySQL Certificate PHP Certificate Course Java Certificate Course C Certificate C++ Certificate Course C# Certificate Course R Course Django Certificate NodeJS Certificate TypeScript Certificate Course XML Certificate Course Cyber Security Certificate Course Accessibility Certificate Course Data Analytics DSA Exam Data Analytics Course NumPy Course Pandas Course Excel Certificate Social Media Course What is a Certificate? × All Our Services Dark mode  Services filter input × W3Schools offers a wide range of services and products for beginners and professionals, helping millions of people everyday to learn and master new skills. Free Tutorials Enjoy our free tutorials like millions of other internet users since 1999 References Explore our selection of references covering all popular coding languages Create a Website Create your own website with W3Schools Spaces - no setup required Exercises Test your skills with different exercises Quizzes Test yourself with multiple choice questions Get Certified Document your knowledge Log in / Sign Up Create a free W3Schools Account to Improve Your Learning Experience My Learning Track your learning progress at W3Schools and collect rewards Upgrade Become a PLUS user and unlock powerful features (ad-free, hosting, support,..) Where To Start Not sure where you want to start? Follow our guided path Code Editor (Try it) With our online code editor, you can edit code and view the result in your browser Videos Learn the basics of HTML in a fun and engaging video tutorial Templates We have created a bunch of responsive website templates you can use - for free! Web Hosting Host your own website, and share it to the world with W3Schools Spaces Create a Server Create your own server using Python, PHP, React.js, Node.js, Java, C#, etc. How To's Large collection of code snippets for HTML, CSS and JavaScript CSS Framework Build fast and responsive sites using our free W3.CSS framework Browser Statistics Read long term trends of browser usage Typing Speed Test your typing speed Color Picker Use our color picker to find different RGB, HEX and HSL colors. Code Game W3Schools Coding Game! Help the lynx collect pine cones Newsletter Join our newsletter and get access to exclusive content every month For Teachers Contact us about W3Schools Academy for educational institutions For Businesses Contact us about W3Schools Academy for your organization Contact Us About sales: sales@w3schools.com About errors: help@w3schools.com Emojis Reference Check out our refererence page with all the emojis supported in HTML 😊 UTF-8 Reference Check out our full UTF-8 Character reference     × ❮ ❯ HTML CSS JAVASCRIPT SQL PYTHON JAVA PHP HOW TO W3.CSS C C++ C# BOOTSTRAP REACT MYSQL JQUERY EXCEL XML DJANGO NUMPY PANDAS NODEJS DSA TYPESCRIPT ANGULAR ANGULARJS GIT POSTGRESQL MONGODB ASP AI R GO KOTLIN SASS VUE GEN AI SCIPY CYBERSECURITY DATA SCIENCE INTRO TO PROGRAMMING BASH RUST About Us About W3Schools About Terms About Privacy About Cookies Privacy Policy ❮ Previous Next ❯ Introduction This Privacy Policy explains how we collect, use, and share your personal information when you use www.w3schools.com (the âWebsiteâ) and or our product and or our services (the âServicesâ). We categorize our users as either \"Customers\" or \"Free Users\": Customers are users who have entered into an agreement with us or our resellers, either alone or with others, to access ad-free paid Services Free Users use the Website and the Services for free When we refer to \"Users\" without specifying Customers or Free Users, we mean both groups. By using or accessing the Website and the Services in any way, you agree to follow the practices and policies outlined in this Privacy Policy. About W3Schools W3Schools is an online platform for learning web development and programming skills, offering tutorials, courses, certifications and various subscription plans. Our educational resources and interactive tools enable users to learn programming languages, build projects, track their progress and practice coding through exercises and quizzes. We fund the Website by showing adverts to our Free Users as you browse the Website. Visit the Website Use the Services Interact with us in any way, such as by email requests, receiving support or by filling out a form (collectively \"Support\") Information We Collect We collect information about you based on how you interact with us, your choices, the products and features you use, your location, in accordance with applicable laws. This information comes either directly from you or automatically through your use of the Services. Information That You Provide Directly We collect the following information when you use the Website and or the Services. Contact Information: When you register, inquire about, or purchase our Services, participate in our marketing activities, or seek support, we collect your contact details. This includes your full name, email address, phone number, and location. Account Information: To create, update, or manage your account on the Website, we collect information like your email address, full name and phone number. Transactional Information: We gather payment and transaction details related to your use of the Services, such as encrypted payment card data and billing address. Support and Troubleshooting Information: If you contact us for Support, we collect information about your preferences and any further details you provide. This includes messages, chat content and attachments, which help us assist you and comply with legal obligations. Voluntary Information: Any other information you choose to provide, such as profile updates or feedback on your experience with the Services. By providing this information, you confirm that you own or have permission to share it. Information from Sub-Processors We receive information about you from our sub-processors who support our business operations. We use this information only for the purposes described in this policy. Information We Automatically Collect When you use the Website and or the Services, we automatically collect certain information about you, your device, and how you interact with us as follows: Telemetry Information. We collect anonymous statistical data and aggregated, de-identified information about how you use the Website and or the Services. Usage Information. We track how you interact with the Website and or the Services. This includes clicks, pages viewed, searches, the web browser used, page response times, errors, date and time stamps, request details (like speed and frequency), the site you came from (\"referring page\"), the site you visit after ours (\"exit page\"), and the time spent on the Website. Device Information. We collect details about your device and how it interacts with the Website and or the Services. This includes browser type and settings, device type, screen size, operating system, model, language preferences, internet service provider, mobile network, push notification tokens, system activity, hardware settings, application version, and unique device identifiers like device type ID. Service-Generated Information. We use data generated by your use of the Services, such as log files, diagnostics, capacity, and usage information, to determine storage needs, performance data from our servers, data settings, and system configurations, including your chosen privacy and security settings. Cookies. We use cookies and similar tracking technologies to collect information from your browser, depending on your settings when using the Website and or the Services. As explained in our Cookie Policy , you can choose to delete or not accept our cookies. Sometimes, in compliance with applicable laws or our customer agreements, we combine the information we collect from different sources. For example, we might merge usage data with your feedback to improve the Services or inform you about relevant products. How We Use Information We use your information to operate, improve, and maintain the Website and or the Services. Here are the ways we may use your information: Service Operation: We use your information to run and manage the Website and or the Services effectively. This includes operating, delivering, monitoring, and maintaining the Services, as well as troubleshooting and performing system maintenance and upgrades. Product Development and Improvement: Your information helps us enhance the Services and develop new features. In addition we use your information to improve functionality, quality, and user experience. Support: We use your information to provide customer assistance and technical support. This includes responding to your requests and inquiries to ensure a smooth experience with the Services. Account Administration: We use your information to create and manage your account, complete transactions and send information such as purchase confirmations, receipts, and invoices. Marketing and Promotional Activities: We use your information to personalize and enhance our marketing efforts. This includes developing and improving our marketing activities, analyzing trends and usage to provide content or features that match your interests and preferences and informing you about promotions, offers, updates, and new products or services that might interest you. We may send you newsletters, promotional emails, and other marketing communications tailored to your interactions with the Services. Security: We use your information to protect you and the Services by seeking to detect and to investigate, prevent and or respond to potential threats, fraudulent transactions, unauthorized access and other malicious or illegal activities. Legal, Safety, and Compliance: We use your information to comply with applicable laws and regulations. This involves meeting legal obligations, responding to court orders, and ensuring compliance with our terms and policies. For Free Users Only: We use your personal information to provide you with targeted advertisements or marketing communications that we believe may interest you. These ads are managed by partners who specialize in advertising across multiple websites. They collect anonymous data about the websites you visit to personalize ads for you, ensure you don't see the same ads too frequently, and report to advertisers on which ads are effective. For more information about targeted advertising, visit the Network Advertising Initiative's (\"NAI\") educational page at http://www.networkadvertising.org/understanding-online-advertising/how-does-it-work How We Share Your Information We share your information to provide the Website and or the Services, comply with legal obligations, and as part of our regular business activities. We only share your information with those who need it to ensure that proper protections and agreements are in place. Sub-processors. To deliver the Website, the Services, and the Support, we share your information with our sub-processors (Overview). We only use sub-processors who have adequate contractual obligations in their standard agreements.They act based on our instructions and in line with our Privacy Policy, along with strict confidentiality and security measures. This includes: Cloud Services: For data hosting, storage, and content delivery Billing and Payments: To manage and process transactions Customer Support: To address and resolve inquiries and support requests Security Monitoring: To protect against fraud or illegal or harmful activities Domain Registration: To register domains and manage related services for you Analytics: To understand the performance and impact of our sites and services For legal reasons. We will share your information if we believe itÂ´s necessary to: Comply with applicable laws, regulations, legal processes, or governmental requests Enforce our agreements, Terms of Service and this Privacy Policy Detect, prevent, or address fraud, security or technical issues Protect the rights, property or safety of W3Schools, our Users, or the public Business transfers. Suppose W3Schools is involved in a merger, acquisition, or sale of assets. In that case, we will continue to ensure the confidentiality of your information. For Free Users Only: We share your information with partners who specialize in advertising across multiple websites. This sharing allows us to personalize your experience and provide you with targeted advertisements. We use sub-processors for this purpose; you can review their Privacy Policy here: Google: Privacy Policy Snigel: Privacy Policy Buy Sell Ads: Privacy Policy Opting Out of Targeted Advertising: W3Schools: Manage Consent Digital Advertising Alliance: http://optout.aboutads.info/ Your Online Choice: https://www.youronlinechoices.com. Note: Opting out will not turn off ads; it will only stop them from being tailored to your interests. Your Privacy Rights You have choices and rights regarding how we collect and use your information. Here's a summary of those options and how to exercise them: Opt-out of Marketing Communications. You can opt out of receiving marketing emails by clicking the \"Unsubscribe\" link in any marketing email or by contacting us directly. Please note that if you are a Customer, you will still receive transactional communications related to the Website and or the Services. Account Preferences. You can update or correct certain account information at any time by logging into your account or contacting our support team. If you wish to delete your account, please follow the instructions provided in our documentation. We will retain certain information as described in the How We Retain Your Information section. Data Deletion. If you wish to delete your account and personal data, follow these steps. Go to your W3Schools Profile and click on 'Delete My Account' at the bottom of the page. Your account and related data will be deleted within 30 days. Be aware that deletion is permanent, content cannot be transferred to a new account, and no refunds will be issued for past purchases. Managing Cookies and Tracking Technologies. You can manage your cookie preferences as described in the Cookie Policy. Managing Vendor Consent You may update and customise your Vendor Consent preferences at any time by clicking here: Manage Consent Depending on your location, you may have additional rights concerning your personal information. These rights vary by jurisdiction. To learn more about your specific rights, please see the Jurisdiction-Specific Information . How We Secure Information We use appropriate administrative, technical and physical safeguards to protect your information from unauthorized access, use, alteration, destruction, loss or disclosure. We also require our sub-processors, who handle your information on our behalf, to follow industry-standard security measures and meet their privacy and security obligations. However, we are not responsible for how our sub-processors handle privacy and security beyond the information we provide to or receive from them. While we strive to protect your information, no security measures are entirely foolproof. If you have any questions about the security of the Website and the Services, please contact us using the information in the Contact Us section How We Retain Your Information We retain your information for the minimum period necessary to fulfill our legal and contractual obligations, develop the Website and or the Services, resolve disputes, enforce our rights, and for legitimate business purposes such as tax or accounting requirements, as described in this policy and recommended by industry standards. When we no longer have a legitimate business need to process your information, we delete or anonymize it. Third-Party Services The Website and the Services may contain links to or integrations with other websites or applications not operated or controlled by W3Schools. While we strive to avoid offensive or harmful content on these links, we are not responsible for the content, accuracy, or opinions expressed in these third-party services. We recommend you review each third-party service's terms and privacy policies before use to ensure they meet your compliance, privacy, and security requirements. How We Transfer Information When you access or use the Website and or the Services or provide your information, you consent to process your information in the United States or Europe, where we operate. W3Schools may store, process, and transmit your information outside your country of residence to provide the Website and the Services. These countries may have different data protection laws. They might not offer the same level of protection as your country or the country where you initially provided the information. As applicable laws require, whenever we transfer your information, we take appropriate steps to protect it, including using standard contractual clauses or other legal mechanisms. Our data privacy practices follow the EU-U.S. Data Privacy Framework (DPF). This means we comply with strict requirements for handling, storing, and sharing your information per the framework. You can read more about the framework here Minimum Age For Use Of Our Site Our Service is generally not intended for users under the age of 16. We do not knowingly collect personal information from anyone under the age of 13 in ways not allowed by the Children's Online Privacy Protection Act (COPPA). If you are a parent or legal guardian and believe that your child has shared personal information in a way that is not allowed by law, please contact us at help@w3schools.com. We will look into it and delete the information as required by law. Changes To This Privacy Policy We periodically review and update this Privacy Policy to reflect new Services or changes to our practices. You can see when this policy was last updated by referring to the \"Last Update\" date at the bottom of the policy. We encourage you to review the policy whenever you interact with us to stay informed about our privacy practices and how you can help protect your privacy. Contact us If you have any questions about this Privacy Policy, please contact us at help@w3schools.com Jurisdiction-Specific Information Depending on your location, certain data privacy rights and regulations may apply to you. Please refer to the sections below that are relevant to your jurisdiction: European Economic Area (EEA) and the United Kingdom (UK) This section applies to individuals located in the European Economic Area (EEA) and the United Kingdom (UK). Legal Bases for Processing Personal Data W3Schools processes your personal data only when we have a valid legal basis to do so. These include: Your Consent: When you have given us clear permission for specific purposes Contractual Necessity: When the processing is required to fulfill a contract with you or to take steps before entering into a contract Legitimate Interests: When processing is necessary for our legitimate business purposes, as long as your rights and freedoms are not overridden Legal Obligations: When we must process your data to comply with applicable laws International Data Transfer If your data is collected in Europe and stored outside of the European Economic Area (EEA), we ensure that your personal data is transferred with appropriate safeguards in place, such as Standard Contractual Clauses (SCCs) Your Rights If you are located in the European Union (EU) or Switzerland, you have the following rights regarding the personal data we hold about you: Right of Access: You have the right to request access to the personal data we process about you Right to Rectification: You can request that we correct any inaccurate or incomplete personal data without undue delay Right to Erasure: You can request the deletion of your personal data in certain circumstances, such as when it is no longer needed for the purposes for which it was collected Right to Restriction: You can ask us to limit the processing of your personal data in specific situations, such as when you contest its accuracy, allowing us time to verify its correctness Right to Data Portability: You can request a copy of your personal data in a structured, commonly used, and machine-readable format to transfer it to another organization Right to Object: You have the right to object to the processing of your personal data for purposes based on our legitimate interests or for direct marketing If you wish to exercise any of these rights, please contact us using the details provided at the end of this Privacy Policy. We will respond to your request within 30 days. To process your request, we need to verify your identity. In some cases, applicable laws may require or allow us to decline your request. If this happens, we will explain the reason, subject to legal restrictions. We retain personal data as needed to fulfill the purposes for which it was collected. This includes retaining information for our legitimate interests, such as complying with legal obligations, resolving disputes, preventing fraud, and enforcing agreements, even after a data subject request. If your personal data was processed by us on behalf of a business customer and you wish to exercise your rights, please contact that customer directly. If you prefer to contact us, include the name of the customer on whose behalf we processed your data. We will forward your request to them and support them to the extent required by applicable law in responding to your request. United States This section applies to individuals in the U.S. and supplements our Privacy Notice to comply with U.S. Data Privacy Laws, including the California Consumer Privacy Act (CCPA). Data Collection, Use, and Sharing We collect and process personal information in order to provide the Website and the Services for our Users. The types of data we collect include: Personal Identifiers: Name, email address, and IP address Customer Records: Billing address, subscription details, and payment information (processed securely and in encrypted form) Commercial Information: Information about your purchases, subscriptions, and engagement with our services Site Activity: Data about your interactions with the Website, such as pages visited, tutorials accessed, and performance metrics Geolocation Data: Approximate location derived from your IP address For detailed information about what we collect and the sources of this data, see the Information We Collect section. We collect and use this information to provide and improve our services, process transactions, ensure security, and for other business purposes outlined in the How We Use Information section. We disclose the following categories of information for business or commercial purposes: personal identifiers, commercial information, site activity, geolocation data, and inferred insights. We work with trusted partners, including service providers, payment processors, and advertising platforms, to operate the Website and manage the Services. For further details, see the How We Share Your Information section. Your Privacy Rights Under U.S. Data Privacy Laws, you have the following rights regarding the personal information we collect: Right of Access: You can request access to and receive a summary of the personal information we have collected about you Right to Know: You can request details about the categories and specific pieces of personal information we have collected in the last 12 months Right to Rectify or Update: You can ask us to correct inaccurate or incomplete personal information. We recommend updating your information in your Account Settings first, if possible Right to Delete or Limit: You can request that we delete your personal data or limit how we process it, in line with legal requirements Right to Object: You can object to the processing of your personal data, as permitted by applicable laws Right to Withdraw Consent: If you previously gave consent for us to process your data, you can withdraw it at any time Right to Request Information: You can ask for details about how we collect, share, and disclose your personal information from the last 12 months Right to Opt-Out of the Sale of Information: To opt out of the sale of your personal data Right to Opt-Out of Sharing for Advertising: To opt out of sharing your data for targeted advertising Right to Non-Discrimination: Exercising your privacy rights will not affect the services we provide to you Right to Data Portability: You can request a copy of your personal information in a format that is easy to use and transfer to another organization, when feasible Exercising Your Privacy Rights If you want to exercise any of these rights, contact us using the information in the Contact Us section. Clearly state which right you are exercising and provide details about your request. We will confirm receipt of your request within 10 days. To process your request, we will require information to verify your identity. If we cannot verify your identity, we will not be able to fulfill your request to access or delete your data. To verify your identity, we require you to provide certain identifying information related to your account (i.e., user ID) or details about your recent interactions with us. We cannot process your request unless we verify your identity and confirm that the personal information relates to you or the individual you are acting on behalf of. If you wish to authorize an agent to make a request on your behalf, you must provide a signed written permission authorizing them to act for you. Requests submitted by an agent without proper authorization will be denied. We process verified requests within 45 days. However, certain requests cannot be fulfilled if they conflict with: Federal, state, or local laws; Regulatory investigations; Subpoenas; or Legal claims or defenses. Appendix: Sub-Processors Company Location Service Airwallex EU Payment processing Amazon USA Cloud Infrastructure for the Website and the Services Brevo EU Market activities Buy Sell Ads USA Ad-Service Google, Inc USA Site analytics (web) and customer interactions (email) Paypal USA Payment processing Refinery 89 EU Ad-Service Revinova USA LMS platform - (Specific for AWS courses) Shopify USA E-commerce store Snigel EU Ad-Service Stripe USA Payment processing Zendesk EU Customer support and CRM system Last updated: 2025.05.19 ❮ Previous Next ❯ ★ +1 Sign in to track progress COLOR PICKER REMOVE ADS PLUS SPACES GET CERTIFIED FOR TEACHERS FOR BUSINESS CONTACT US × Contact Sales If you want to use W3Schools services as an educational institution, team or enterprise, send us an e-mail: sales@w3schools.com Report Error If you want to report an error, or if you want to make a suggestion, send us an e-mail: help@w3schools.com Top Tutorials HTML Tutorial CSS Tutorial JavaScript Tutorial How To Tutorial SQL Tutorial Python Tutorial W3.CSS Tutorial Bootstrap Tutorial PHP Tutorial Java Tutorial C++ Tutorial jQuery Tutorial Top References HTML Reference CSS Reference JavaScript Reference SQL Reference Python Reference W3.CSS Reference Bootstrap Reference PHP Reference HTML Colors Java Reference AngularJS Reference jQuery Reference Top Examples HTML Examples CSS Examples JavaScript Examples How To Examples SQL Examples Python Examples W3.CSS Examples Bootstrap Examples PHP Examples Java Examples XML Examples jQuery Examples Get Certified HTML Certificate CSS Certificate JavaScript Certificate Front End Certificate SQL Certificate Python Certificate PHP Certificate jQuery Certificate Java Certificate C++ Certificate C# Certificate XML Certificate     FORUM ABOUT ACADEMY W3Schools is optimized for learning and training. Examples might be simplified to improve reading and learning. Tutorials, references, and examples are constantly reviewed to avoid errors, but we cannot warrant full correctness of all content. While using W3Schools, you agree to have read and accepted our terms of use , cookie and privacy policy . Copyright 1999-2025 by Refsnes Data. All Rights Reserved. W3Schools is Powered by W3.CSS ."}
{"url": "https://www.w3schools.com/w3css/w3css_intro.asp", "title": "W3.CSS Intro", "text": "W3.CSS Intro Tutorials References Exercises Certificates Menu Search field × See More Sign In ★ +1 Get Certified Upgrade For Teachers Spaces Get Certified Upgrade For Teachers Spaces  My W3Schools Tutorials References Exercises Certificates Spaces Get Certified Plus Academy All our Services Logout     × Tutorials Tutorials filter input × HTML and CSS Learn HTML Tutorial Reference Learn CSS Tutorial Reference Learn RWD Tutorial Learn Bootstrap Overview Learn W3.CSS Tutorial Reference Learn Sass Tutorial Reference Learn Colors Tutorial Reference Learn Icons Tutorial Reference Learn SVG Tutorial Reference Learn Canvas Tutorial Reference Learn Graphics Tutorial Learn UTF-8 and Emojis Reference Learn How To Tutorial Data Analytics Learn AI Tutorial Learn Generative AI Tutorial Learn ChatGPT-3.5 Tutorial Learn ChatGPT-4 Tutorial Learn Google Bard Tutorial Learn Machine Learning Tutorial Learn DSA Tutorial Learn Data Science Tutorial Learn NumPy Tutorial Learn Pandas Tutorial Learn SciPy Tutorial Learn Matplotlib Tutorial Learn Statistics Tutorial Learn Excel Tutorial Learn Google Sheets Tutorial Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter JavaScript Learn JavaScript Tutorial Reference Learn React Tutorial Learn jQuery Tutorial Reference Learn Vue Tutorial Reference Learn Angular Tutorial Learn AngularJS Tutorial Reference Learn JSON Tutorial Reference Learn AJAX Tutorial Learn AppML Tutorial Reference Learn W3.JS Tutorial Reference Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter Backend Learn Python Tutorial Reference Learn SQL Tutorial Reference Learn MySQL Tutorial Reference Learn PHP Tutorial Reference Learn Java Tutorial Reference Learn C Tutorial Reference Learn C++ Tutorial Reference Learn C# Tutorial Learn R Tutorial Learn Kotlin Tutorial Learn Rust Tutorial Learn Go Tutorial Learn Django Tutorial Reference Learn PostgreSQL Tutorial Learn TypeScript Tutorial Learn ASP Tutorial Reference Learn Node.js Tutorial Reference Learn Raspberry Pi Tutorial Learn Git Tutorial Learn Bash Tutorial Learn MongoDB Tutorial Learn XML Tutorial Reference Data Analytics Learn AI Tutorial Learn Generative AI Tutorial Learn ChatGPT-3.5 Tutorial Learn ChatGPT-4 Tutorial Learn Google Bard Tutorial Learn Machine Learning Tutorial Learn DSA Tutorial Learn Data Science Tutorial Learn NumPy Tutorial Learn Pandas Tutorial Learn SciPy Tutorial Learn Matplotlib Tutorial Learn Statistics Tutorial Learn Excel Tutorial Learn Google Sheets Tutorial Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter × References References filter input × HTML and CSS HTML Tags Reference CSS Reference W3.CSS Reference Bootstrap 3 Reference Bootstrap 4 Reference Color Names Icons Reference SVG Reference Canvas Reference Sass Reference UTF-8 Charset Reference UTF-8 Emojis Reference JavaScript JavaScript Reference jQuery Reference Vue Reference Angular Reference JSON Reference AppML Reference W3.JS Reference Backend Python Reference SQL Reference MySQL Reference PHP Reference Java Reference C Reference C++ Reference Django Reference ASP Reference Node.js Reference XML Reference × Exercises Excercises filter input × HTML and CSS HTML Exercise Quiz CSS Exercise Quiz Bootstrap 3 Exercise Quiz Bootstrap 4 Exercise Quiz Bootstrap 5 Exercise Quiz Data Analytics DSA Exercise Quiz NumPy Exercise Quiz Pandas Exercise Quiz SciPy Exercise Quiz Excel Exercise What is an Exercise? What is a Quiz? JavaScript JavaScript Exercise Quiz React Exercise Quiz jQuery Exercise Quiz Vue Exercise Quiz Angular Exercise Quiz Backend Python Exercise Quiz SQL Exercise Quiz MySQL Exercise Quiz PHP Exercise Quiz Java Exercise Quiz C Exercise Quiz C++ Exercise Quiz C# Exercise Quiz R Exercise Quiz Kotlin Exercise Quiz Django Exercise Quiz Node.js Exercise Quiz PostgreSQL Exercise Quiz TypeScript Exercise Quiz Git Exercise Quiz Bash Exercise Quiz Go Exercise MongoDB Exercise Data Analytics DSA Exercise Quiz NumPy Exercise Quiz Pandas Exercise Quiz SciPy Exercise Quiz Excel Exercise What is an Exercise? What is a Quiz? × Certificates Filter field for certifications × HTML and CSS HTML Certificate Course CSS Certificate Course Bootstrap 3 Certificate Course Bootstrap 4 Certificate Course Bootstrap 5 Certificate Data Analytics DSA Certificate Data Analytics Course NumPy Certificate Course Pandas Certificate Course Excel Certificate Social Media Course What is a Certificate? Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course JavaScript JavaScript Certificate Course React Certificate Course jQuery Certificate Course Vue Certificate Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course Backend Python Certificate Course SQL Certificate Course MySQL Certificate PHP Certificate Course Java Certificate Course C Certificate C++ Certificate Course C# Certificate Course R Course Django Certificate NodeJS Certificate TypeScript Certificate Course XML Certificate Course Cyber Security Certificate Course Accessibility Certificate Course Data Analytics DSA Exam Data Analytics Course NumPy Course Pandas Course Excel Certificate Social Media Course What is a Certificate? × All Our Services Dark mode  Services filter input × W3Schools offers a wide range of services and products for beginners and professionals, helping millions of people everyday to learn and master new skills. Free Tutorials Enjoy our free tutorials like millions of other internet users since 1999 References Explore our selection of references covering all popular coding languages Create a Website Create your own website with W3Schools Spaces - no setup required Exercises Test your skills with different exercises Quizzes Test yourself with multiple choice questions Get Certified Document your knowledge Log in / Sign Up Create a free W3Schools Account to Improve Your Learning Experience My Learning Track your learning progress at W3Schools and collect rewards Upgrade Become a PLUS user and unlock powerful features (ad-free, hosting, support,..) Where To Start Not sure where you want to start? Follow our guided path Code Editor (Try it) With our online code editor, you can edit code and view the result in your browser Videos Learn the basics of HTML in a fun and engaging video tutorial Templates We have created a bunch of responsive website templates you can use - for free! Web Hosting Host your own website, and share it to the world with W3Schools Spaces Create a Server Create your own server using Python, PHP, React.js, Node.js, Java, C#, etc. How To's Large collection of code snippets for HTML, CSS and JavaScript CSS Framework Build fast and responsive sites using our free W3.CSS framework Browser Statistics Read long term trends of browser usage Typing Speed Test your typing speed Color Picker Use our color picker to find different RGB, HEX and HSL colors. Code Game W3Schools Coding Game! Help the lynx collect pine cones Newsletter Join our newsletter and get access to exclusive content every month For Teachers Contact us about W3Schools Academy for educational institutions For Businesses Contact us about W3Schools Academy for your organization Contact Us About sales: sales@w3schools.com About errors: help@w3schools.com Emojis Reference Check out our refererence page with all the emojis supported in HTML 😊 UTF-8 Reference Check out our full UTF-8 Character reference     × ❮ ❯ HTML CSS JAVASCRIPT SQL PYTHON JAVA PHP HOW TO W3.CSS C C++ C# BOOTSTRAP REACT MYSQL JQUERY EXCEL XML DJANGO NUMPY PANDAS NODEJS DSA TYPESCRIPT ANGULAR ANGULARJS GIT POSTGRESQL MONGODB ASP AI R GO KOTLIN SASS VUE GEN AI SCIPY CYBERSECURITY DATA SCIENCE INTRO TO PROGRAMMING BASH RUST W3.CSS W3.CSS HOME W3.CSS Intro W3.CSS Colors W3.CSS Containers W3.CSS Panels W3.CSS Borders W3.CSS Cards W3.CSS Defaults W3.CSS Fonts W3.CSS Google W3.CSS Text W3.CSS Round W3.CSS Padding W3.CSS Margins W3.CSS RTL W3.CSS Display W3.CSS Buttons W3.CSS Notes W3.CSS Quotes W3.CSS Alerts W3.CSS Tables W3.CSS Lists W3.CSS Images W3.CSS Inputs W3.CSS Badges W3.CSS Tags W3.CSS Icons W3.CSS Grid W3.CSS Flexbox W3.CSS Flex Items W3.CSS Rows W3.CSS Cells W3.CSS Responsive W3.CSS Dark Mode W3.CSS Animations W3.CSS Effects W3.CSS Bars W3.CSS Dropdowns W3.CSS Accordions W3.CSS Navigation W3.CSS Sidebar W3.CSS Tabs W3.CSS Pagination W3.CSS Progress Bars W3.CSS Slideshow W3.CSS Modal W3.CSS Tooltips W3.CSS Code W3.CSS Filters W3.CSS Trends W3.CSS Case W3.CSS Material W3.CSS Validation W3.CSS Versions W3.CSS Mobile W3.CSS Colors W3.CSS Color Classes W3.CSS Color Material W3.CSS Color Flat UI W3.CSS Color Metro UI W3.CSS Color Win8 W3.CSS Color iOS W3.CSS Color Fashion W3.CSS Color Libraries W3.CSS Color Schemes W3.CSS Color Themes W3.CSS Color Generator Web Building Web Intro Web HTML Web CSS Web JavaScript Web Layout Web Band Web Catering Web Restaurant Web Architect Examples W3.CSS Examples W3.CSS Demos W3.CSS Templates W3.CSS Certificate References W3.CSS Reference W3.CSS Downloads W3.CSS Demo (Kitchen Sink) ❮ Previous Next ❯ W3.CSS Colors The w3-color classes are inspired by modern colors used in marketing, road signs, and sticky notes: Purple Green Warning Cobalt Example <div class=\"w3-red\"> <h2>London</h2> <p>London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants.</p> </div> Try It Yourself » W3.CSS Containers The w3-container class is the most important of the W3.CSS classes. Containers provide equalities in a web page with: Common margins and paddings Common vertical and horizontal alignments This is a Header London London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants. This is a footer Example <div class=\"w3-container w3-teal\"> <h1>This is a Header</h1> </div> <div class=\"w3-container\"> <h2>London</h2> <p>London is the most populous city in the United Kingdom.</p> <p>It has a metropolitan area of over 9 million inhabitants.</p> </div> <div class=\"w3-container w3-teal\"> <p>This is a footer</p> </div> Try It Yourself » The w3-container class is typically used with HTML container elements like: <div> <header> <footer> <nav> <article> <section> <blockquote> <form> W3.CSS Panels The w3-panel class is a containers class with added top and bottom margin. I am a panel I am a panel I am a container I am a container Example <div class=\"w3-panel w3-red\"> <p>I am a panel</p> </div> Try It Yourself » Notes, and Quotes The w3-panel class can be used to display all kinds of notes and quotes: London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants. London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants. London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants. London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants. \"Make it as simple as possible, but not simpler.\" Albert Einstein W3.CSS Alerts The w3-panel class can also be used for all kinds of alerts: × DANGER Red often indicates a dangerous or negative situation. × WARNING Orange often indicates a warning that might need attention. × SUCCESS Green often indicates something successful or positive. × Info Blue often indicates a neutral informative change or action. × Note Yellow is often used for notifications. w3-danger, w3-warning, w3-sucess, w3-info, w3-note are new in version 5.0. Example <div class=\"w3-panel w3-warning\"> <h3>Warning!</h3> <p>Orange often indicates a warning that might need attention.</p> </div> Try It Yourself » W3.CSS Cards The w3-card classes are suitable for both images and notes: A Car A car is a wheeled, self-powered motor vehicle used for transportation. Most definitions of the term specify that cars are designed to run primarily on roads, to have seating for one to eight people, and to typically have four wheels. (Wikipedia) Amazing French Alps Example <div class=\"w3-card-4\"> <img src=\"img_snowtops.jpg\" alt=\"Alps\"> <div class=\"w3-container w3-center\"> <p>French Alps</p> </div> </div> Try It Yourself » W3.CSS Tables The w3-table classes can handle all kinds of tables: First Name Last Name Points Jill Smith 50 Eve Jackson 94 Adam Johnson 67 Anja Bore 100 Example <table class=\"w3-table w3-striped w3-border\"> Try It Yourself » W3.CSS Lists The w3-ul class can handle all kinds of lists: × Mike Web Designer × Jill Support × Jane Accountant × Jack Advisor Example <ul class=\"w3-ul w3-border\"> <li><h2>Names</h2></li> <li>Jill</li> <li>Eve</li> <li>Adam</li> </ul> Try It Yourself » W3.CSS Buttons The w3-button and w3-btn class provides buttons of all sizes and types. Button Button Button Button Button Button Disabled Button Button Button Button Button Button Wide buttons: Button Button One Two Three Circular or square buttons: + + + + + + W3.CSS Tags, Labels, Badges, and Signs The w3-tag and the w3-badge classes are capable of displaying all kinds of tags, labels, badges and signs: 2 8 A B New Warning Danger Info Falcon Ridge Parkway S A L E DO NOT BREATHE UNDER WATER W3.CSS Grid The w3-grid class creates a parent container for grid items. The children of the grid container automatically become grid items. 1 2 3 4 5 6 7 8 Example <div class=\"w3-grid\"\"> <div>1</div> <div>2</div> <div>3</div> <div>4</div> </div> Try it Yourself » W3.CSS Flexbox The w3-flex class defines a container for flexbox items. The children of the flexbox container automatically become flexbox items. 1 2 3 Example <div class=\"w3-flex\" style=\"gap:8px\"> <div>1</div> <div>2</div> <div>3</div> </div> Try it Yourself » Note w3-grid and w3-flex is new in W3.CSS 5.0 . w3-grid vs w3-flex w3-grid is for two-dimensional layout, with rows AND columns. w3-flex is for one-dimensional layout, with rows OR columns. W3.CSS Row The w3-row class supports a 12 column mobile-first fluid grid with small, medium, and large classes. 1/2 1/2 1/3 1/3 1/3 1/3 2/3 1/4 1/4 1/4 1/4 1/2 1/4 1/4 2/3 1/3 1/1 1/4 1/4 1/2 1/4 1/2 1/4 50px rest 1/4 rest 100px 45px rest Example w3-third w3-third w3-third <div class=\"w3-row\"> <div class=\"w3-third w3-container w3-green\"> <h2>w3-third</h2> </div> <div class=\"w3-third w3-container w3-yellow\"> <h2>w3-third</h2> </div> <div class=\"w3-third w3-container w3-red\"> <h2>w3-third</h2> </div> </div> Try It Yourself » W3.CSS Display The w3-display classes allow you to display HTML elements in specific positions: Top Left Top Right Bottom Left Bottom Right Left Right Middle Top Middle Bottom Middle Top Left Top Right Bottom Left Bottom Right Left Right Middle Top Middle Bottom Middle W3.CSS Modals The w3-modal class provides modal dialog in pure HTML: Click to Open Modal × Header Some text. Some text. Some text. Some text. Some text. Some text. Footer Modal Image: × W3.CSS Progress Bars Read more at W3.CSS Progress Bars 25% 50% 0 Click Me W3.CSS Dropdowns The w3-dropdown classes provide dropdowns: Hover Me! Link 1 Link 2 Link 3 Click Me! Link 1 Link 2 Link 3 W3.CSS Accordions Read more at W3.CSS Accordions Open Section 1 Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Open Section 2 Link 1 Link 2 Link 3 Open Section 3 Accordion with Images: French Alps W3.CSS Tabs Tabs are perfect for single page web applications, or for web pages capable of displaying different subjects. London Paris Tokyo London London is the capital of England. It is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants. Paris Paris is the capital of France. The Paris area is one of the largest population centers in Europe, with more than 12 million inhabitants. Tokyo Tokyo is the capital of Japan. It is the center of the Greater Tokyo Area, and the most populous metropolitan area in the world. Tabbed Image Gallery (Click on one of the pictures): × Nature × Snow × Mountains × Northern Lights W3.CSS Navigation The w3-bar class can be used to create a navigation bar: Home Link 1 Link 2 Link 3 Navigation bar with input: Home Link 1 Link 2 Go Navigation bar with dropdown: Home Link 1 Dropdown Link 1 Link 2 Link 3 Customized bars: Home Link 1 Link 2 Home Link 1 Link 2 Link 3 The w3-sidebar class creates a side navigation: W3.CSS Pagination W3.CSS provides simple ways for page pagination . « 1 2 3 4 5 » ❮ Previous Next ❯ ❮ ❯ Slideshows W3.CSS provide slideshows for cycling through images or other content: 1 / 3 Beautiful Nature 2 / 3 French Alps 3 / 3 Mountains ❮ ❯ Lightbox Combine Modals and Slideshows to create a lightbox (modal image gallery): × ❮ ❯ W3.CSS Animations The w3-animate classes provide an easy way to slide and fade in elements: Top Bottom Left Right Fade In Zoom Spin Animation is Fun! Animation is Fun! Animation is Fun! Animation is Fun! Animation is Fun! Animation is Fun! Animation is Fun! Animation is Fun! W3.CSS Images Styling images in W3CSS is easy: Nature W3.CSS Effects Add special effects to any element: Normal Opacity Grayscale Sepia W3.CSS Input Forms The w3-input classes are for input forms: Input Form Name Email Subject Milk Sugar Lemon (Disabled) Input Form Name Email Subject Male Female Don't know (Disabled) W3.CSS Filters Use W3.CSS Filters to search for a specific element inside a list, table, dropdown, etc: Name Country Alfreds Futterkiste Germany Berglunds snabbkop Sweden Island Trading UK Koniglich Essen Germany Laughing Bacchus Winecellars Canada Magazzini Alimentari Riuniti Italy North/South UK Paris specialites France W3.CSS Fonts With W3.CSS it is extremely easy to add fonts to a web page: Making the web beautiful! Making the web! W3.CSS Tooltips The w3-tooltip class can display all kinds of tooltips: Hover over this text! Tooltip content Hover over this text! Tooltip content Color Themes Color themes can easily be added to any web application: Theme Indigo Movies 2014 Frozen The response to the animations was ridiculous The Fault in Our Stars Touching, gripping and genuinely well made The Avengers A huge success for Marvel and Disney « » Theme Teal Movies 2014 Frozen The response to the animations was ridiculous The Fault in Our Stars Touching, gripping and genuinely well made The Avengers A huge success for Marvel and Disney « » Color themes are a perfect match for mobile applications. ❮ Previous Next ❯ ★ +1 Sign in to track progress COLOR PICKER REMOVE ADS PLUS SPACES GET CERTIFIED FOR TEACHERS FOR BUSINESS CONTACT US × Contact Sales If you want to use W3Schools services as an educational institution, team or enterprise, send us an e-mail: sales@w3schools.com Report Error If you want to report an error, or if you want to make a suggestion, send us an e-mail: help@w3schools.com Top Tutorials HTML Tutorial CSS Tutorial JavaScript Tutorial How To Tutorial SQL Tutorial Python Tutorial W3.CSS Tutorial Bootstrap Tutorial PHP Tutorial Java Tutorial C++ Tutorial jQuery Tutorial Top References HTML Reference CSS Reference JavaScript Reference SQL Reference Python Reference W3.CSS Reference Bootstrap Reference PHP Reference HTML Colors Java Reference AngularJS Reference jQuery Reference Top Examples HTML Examples CSS Examples JavaScript Examples How To Examples SQL Examples Python Examples W3.CSS Examples Bootstrap Examples PHP Examples Java Examples XML Examples jQuery Examples Get Certified HTML Certificate CSS Certificate JavaScript Certificate Front End Certificate SQL Certificate Python Certificate PHP Certificate jQuery Certificate Java Certificate C++ Certificate C# Certificate XML Certificate     FORUM ABOUT ACADEMY W3Schools is optimized for learning and training. Examples might be simplified to improve reading and learning. Tutorials, references, and examples are constantly reviewed to avoid errors, but we cannot warrant full correctness of all content. While using W3Schools, you agree to have read and accepted our terms of use , cookie and privacy policy . Copyright 1999-2025 by Refsnes Data. All Rights Reserved. W3Schools is Powered by W3.CSS ."}
{"url": "https://www.w3schools.com/w3css/w3css_colors.asp", "title": "W3.CSS Colors", "text": "W3.CSS Colors Tutorials References Exercises Certificates Menu Search field × See More Sign In ★ +1 Get Certified Upgrade For Teachers Spaces Get Certified Upgrade For Teachers Spaces  My W3Schools Tutorials References Exercises Certificates Spaces Get Certified Plus Academy All our Services Logout     × Tutorials Tutorials filter input × HTML and CSS Learn HTML Tutorial Reference Learn CSS Tutorial Reference Learn RWD Tutorial Learn Bootstrap Overview Learn W3.CSS Tutorial Reference Learn Sass Tutorial Reference Learn Colors Tutorial Reference Learn Icons Tutorial Reference Learn SVG Tutorial Reference Learn Canvas Tutorial Reference Learn Graphics Tutorial Learn UTF-8 and Emojis Reference Learn How To Tutorial Data Analytics Learn AI Tutorial Learn Generative AI Tutorial Learn ChatGPT-3.5 Tutorial Learn ChatGPT-4 Tutorial Learn Google Bard Tutorial Learn Machine Learning Tutorial Learn DSA Tutorial Learn Data Science Tutorial Learn NumPy Tutorial Learn Pandas Tutorial Learn SciPy Tutorial Learn Matplotlib Tutorial Learn Statistics Tutorial Learn Excel Tutorial Learn Google Sheets Tutorial Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter JavaScript Learn JavaScript Tutorial Reference Learn React Tutorial Learn jQuery Tutorial Reference Learn Vue Tutorial Reference Learn Angular Tutorial Learn AngularJS Tutorial Reference Learn JSON Tutorial Reference Learn AJAX Tutorial Learn AppML Tutorial Reference Learn W3.JS Tutorial Reference Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter Backend Learn Python Tutorial Reference Learn SQL Tutorial Reference Learn MySQL Tutorial Reference Learn PHP Tutorial Reference Learn Java Tutorial Reference Learn C Tutorial Reference Learn C++ Tutorial Reference Learn C# Tutorial Learn R Tutorial Learn Kotlin Tutorial Learn Rust Tutorial Learn Go Tutorial Learn Django Tutorial Reference Learn PostgreSQL Tutorial Learn TypeScript Tutorial Learn ASP Tutorial Reference Learn Node.js Tutorial Reference Learn Raspberry Pi Tutorial Learn Git Tutorial Learn Bash Tutorial Learn MongoDB Tutorial Learn XML Tutorial Reference Data Analytics Learn AI Tutorial Learn Generative AI Tutorial Learn ChatGPT-3.5 Tutorial Learn ChatGPT-4 Tutorial Learn Google Bard Tutorial Learn Machine Learning Tutorial Learn DSA Tutorial Learn Data Science Tutorial Learn NumPy Tutorial Learn Pandas Tutorial Learn SciPy Tutorial Learn Matplotlib Tutorial Learn Statistics Tutorial Learn Excel Tutorial Learn Google Sheets Tutorial Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter × References References filter input × HTML and CSS HTML Tags Reference CSS Reference W3.CSS Reference Bootstrap 3 Reference Bootstrap 4 Reference Color Names Icons Reference SVG Reference Canvas Reference Sass Reference UTF-8 Charset Reference UTF-8 Emojis Reference JavaScript JavaScript Reference jQuery Reference Vue Reference Angular Reference JSON Reference AppML Reference W3.JS Reference Backend Python Reference SQL Reference MySQL Reference PHP Reference Java Reference C Reference C++ Reference Django Reference ASP Reference Node.js Reference XML Reference × Exercises Excercises filter input × HTML and CSS HTML Exercise Quiz CSS Exercise Quiz Bootstrap 3 Exercise Quiz Bootstrap 4 Exercise Quiz Bootstrap 5 Exercise Quiz Data Analytics DSA Exercise Quiz NumPy Exercise Quiz Pandas Exercise Quiz SciPy Exercise Quiz Excel Exercise What is an Exercise? What is a Quiz? JavaScript JavaScript Exercise Quiz React Exercise Quiz jQuery Exercise Quiz Vue Exercise Quiz Angular Exercise Quiz Backend Python Exercise Quiz SQL Exercise Quiz MySQL Exercise Quiz PHP Exercise Quiz Java Exercise Quiz C Exercise Quiz C++ Exercise Quiz C# Exercise Quiz R Exercise Quiz Kotlin Exercise Quiz Django Exercise Quiz Node.js Exercise Quiz PostgreSQL Exercise Quiz TypeScript Exercise Quiz Git Exercise Quiz Bash Exercise Quiz Go Exercise MongoDB Exercise Data Analytics DSA Exercise Quiz NumPy Exercise Quiz Pandas Exercise Quiz SciPy Exercise Quiz Excel Exercise What is an Exercise? What is a Quiz? × Certificates Filter field for certifications × HTML and CSS HTML Certificate Course CSS Certificate Course Bootstrap 3 Certificate Course Bootstrap 4 Certificate Course Bootstrap 5 Certificate Data Analytics DSA Certificate Data Analytics Course NumPy Certificate Course Pandas Certificate Course Excel Certificate Social Media Course What is a Certificate? Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course JavaScript JavaScript Certificate Course React Certificate Course jQuery Certificate Course Vue Certificate Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course Backend Python Certificate Course SQL Certificate Course MySQL Certificate PHP Certificate Course Java Certificate Course C Certificate C++ Certificate Course C# Certificate Course R Course Django Certificate NodeJS Certificate TypeScript Certificate Course XML Certificate Course Cyber Security Certificate Course Accessibility Certificate Course Data Analytics DSA Exam Data Analytics Course NumPy Course Pandas Course Excel Certificate Social Media Course What is a Certificate? × All Our Services Dark mode  Services filter input × W3Schools offers a wide range of services and products for beginners and professionals, helping millions of people everyday to learn and master new skills. Free Tutorials Enjoy our free tutorials like millions of other internet users since 1999 References Explore our selection of references covering all popular coding languages Create a Website Create your own website with W3Schools Spaces - no setup required Exercises Test your skills with different exercises Quizzes Test yourself with multiple choice questions Get Certified Document your knowledge Log in / Sign Up Create a free W3Schools Account to Improve Your Learning Experience My Learning Track your learning progress at W3Schools and collect rewards Upgrade Become a PLUS user and unlock powerful features (ad-free, hosting, support,..) Where To Start Not sure where you want to start? Follow our guided path Code Editor (Try it) With our online code editor, you can edit code and view the result in your browser Videos Learn the basics of HTML in a fun and engaging video tutorial Templates We have created a bunch of responsive website templates you can use - for free! Web Hosting Host your own website, and share it to the world with W3Schools Spaces Create a Server Create your own server using Python, PHP, React.js, Node.js, Java, C#, etc. How To's Large collection of code snippets for HTML, CSS and JavaScript CSS Framework Build fast and responsive sites using our free W3.CSS framework Browser Statistics Read long term trends of browser usage Typing Speed Test your typing speed Color Picker Use our color picker to find different RGB, HEX and HSL colors. Code Game W3Schools Coding Game! Help the lynx collect pine cones Newsletter Join our newsletter and get access to exclusive content every month For Teachers Contact us about W3Schools Academy for educational institutions For Businesses Contact us about W3Schools Academy for your organization Contact Us About sales: sales@w3schools.com About errors: help@w3schools.com Emojis Reference Check out our refererence page with all the emojis supported in HTML 😊 UTF-8 Reference Check out our full UTF-8 Character reference     × ❮ ❯ HTML CSS JAVASCRIPT SQL PYTHON JAVA PHP HOW TO W3.CSS C C++ C# BOOTSTRAP REACT MYSQL JQUERY EXCEL XML DJANGO NUMPY PANDAS NODEJS DSA TYPESCRIPT ANGULAR ANGULARJS GIT POSTGRESQL MONGODB ASP AI R GO KOTLIN SASS VUE GEN AI SCIPY CYBERSECURITY DATA SCIENCE INTRO TO PROGRAMMING BASH RUST W3.CSS W3.CSS HOME W3.CSS Intro W3.CSS Colors W3.CSS Containers W3.CSS Panels W3.CSS Borders W3.CSS Cards W3.CSS Defaults W3.CSS Fonts W3.CSS Google W3.CSS Text W3.CSS Round W3.CSS Padding W3.CSS Margins W3.CSS RTL W3.CSS Display W3.CSS Buttons W3.CSS Notes W3.CSS Quotes W3.CSS Alerts W3.CSS Tables W3.CSS Lists W3.CSS Images W3.CSS Inputs W3.CSS Badges W3.CSS Tags W3.CSS Icons W3.CSS Grid W3.CSS Flexbox W3.CSS Flex Items W3.CSS Rows W3.CSS Cells W3.CSS Responsive W3.CSS Dark Mode W3.CSS Animations W3.CSS Effects W3.CSS Bars W3.CSS Dropdowns W3.CSS Accordions W3.CSS Navigation W3.CSS Sidebar W3.CSS Tabs W3.CSS Pagination W3.CSS Progress Bars W3.CSS Slideshow W3.CSS Modal W3.CSS Tooltips W3.CSS Code W3.CSS Filters W3.CSS Trends W3.CSS Case W3.CSS Material W3.CSS Validation W3.CSS Versions W3.CSS Mobile W3.CSS Colors W3.CSS Color Classes W3.CSS Color Material W3.CSS Color Flat UI W3.CSS Color Metro UI W3.CSS Color Win8 W3.CSS Color iOS W3.CSS Color Fashion W3.CSS Color Libraries W3.CSS Color Schemes W3.CSS Color Themes W3.CSS Color Generator Web Building Web Intro Web HTML Web CSS Web JavaScript Web Layout Web Band Web Catering Web Restaurant Web Architect Examples W3.CSS Examples W3.CSS Demos W3.CSS Templates W3.CSS Certificate References W3.CSS Reference W3.CSS Downloads W3.CSS Colors ❮ Previous Next ❯ Red Pink Purple Deep Purple Indigo Blue Light Blue Cyan Aqua Teal Green Light Green Lime Sand Khaki Yellow Amber Orange Deep Orange Blue Gray Brown White Light Gray Gray Dark Gray Black Pale Red Pale Yellow Pale Green Pale-Blue Note The color scheme used in W3.CSS is inspired by Material Design Colors (colors used in marketing, road signs, and sticky notes). New Colors in Version 5 Paper Cobalt Emerald Olive Taupe Sienna Crimson Asphalt Danger Warning Note Info Success Coloring HTML Elements The w3- color and w3-text- color classes can be used to color any HTML element: Containers: London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants. London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants. Buttons: Teal Blue Yellow Orange Red Purple Text: Red Purple Blue Green Orange Borders: Red Green Blue Yellow Gray Black Tables: Name Points Jill Smith 50 Eve Jackson 94 Adam Johnson 67 Cards: A car is a wheeled, self-powered motor vehicle used for transportation. Most definitions of the term specify that cars are designed to run primarily on roads, to have seating for one to eight people, to typically have four wheels. (Wikipedia) Background Colors The w3- color classes set the background color for any HTML element: London London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants. London London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants. London London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants. Example <div class=\"w3-red\"> <h2>London</h2> <p>London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants.</p> </div> <div class=\"w3-yellow\"> <h2>London</h2> <p>London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants.</p> </div> <div class=\"w3-gray\"> <h2>London</h2> <p>London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants.</p> </div> Try It Yourself » The colors gray and grey are interchangeable in all W3.CSS classes. Text Colors The w3-text- color classes set the text color of any HTML element: London London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants. London London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants. Example <div class=\"w3-text-red\"> <h2>London</h2> <p>London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants.</p> </div> Try It Yourself » Hover Colors The w3-hover- color classes define the background hover color for any HTML element: London London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants. Example <div class=\"w3-container w3-orange w3-hover-red\"> <h2>London</h2> <p>London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants.</p> </div> Try It Yourself » The w3-hover-text- color classes define the text hover color for any HTML element: London London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants. Example <div class=\"w3-container w3-orange w3-hover-text-white\"> <h2>London</h2> <p>London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants.</p> </div> Try It Yourself » Color libraries In addition to standard W3.CSS colors, W3.CSS can also use colors from a lot of different color libraries: Windows Colors: Lime Green Olive Emerald Teal Steel Cyan Blue Indigo Cobalt Violet Mauve Pink Magenta Red Orange Amber Yellow Brown Taupe Sienna Crimson Click here to Learn more about Windows colors Fashion Colors: Flame Greenery Marina Primrose Yellow Neutral Gray Shaded Spruce Navy Peony Tawny Port Click here to Learn more about fashion colors Highway Colors: Red Green Blue Yellow Click here to Learn more about color libraries You will learn a lot more about colors in later chapters of this tutorial. ❮ Previous Next ❯ ★ +1 Sign in to track progress COLOR PICKER REMOVE ADS PLUS SPACES GET CERTIFIED FOR TEACHERS FOR BUSINESS CONTACT US × Contact Sales If you want to use W3Schools services as an educational institution, team or enterprise, send us an e-mail: sales@w3schools.com Report Error If you want to report an error, or if you want to make a suggestion, send us an e-mail: help@w3schools.com Top Tutorials HTML Tutorial CSS Tutorial JavaScript Tutorial How To Tutorial SQL Tutorial Python Tutorial W3.CSS Tutorial Bootstrap Tutorial PHP Tutorial Java Tutorial C++ Tutorial jQuery Tutorial Top References HTML Reference CSS Reference JavaScript Reference SQL Reference Python Reference W3.CSS Reference Bootstrap Reference PHP Reference HTML Colors Java Reference AngularJS Reference jQuery Reference Top Examples HTML Examples CSS Examples JavaScript Examples How To Examples SQL Examples Python Examples W3.CSS Examples Bootstrap Examples PHP Examples Java Examples XML Examples jQuery Examples Get Certified HTML Certificate CSS Certificate JavaScript Certificate Front End Certificate SQL Certificate Python Certificate PHP Certificate jQuery Certificate Java Certificate C++ Certificate C# Certificate XML Certificate     FORUM ABOUT ACADEMY W3Schools is optimized for learning and training. Examples might be simplified to improve reading and learning. Tutorials, references, and examples are constantly reviewed to avoid errors, but we cannot warrant full correctness of all content. While using W3Schools, you agree to have read and accepted our terms of use , cookie and privacy policy . Copyright 1999-2025 by Refsnes Data. All Rights Reserved. W3Schools is Powered by W3.CSS ."}
{"url": "https://www.w3schools.com/w3css/tryit.asp?filename=tryw3css_responsive_third&stacked=h", "title": "W3Schools Tryit Editor", "text": "W3Schools Tryit Editor Run ❯ Get your own website ❯ Run Code Ctrl+Alt+R Save Code Ctrl+Alt+A Change Orientation Ctrl+Alt+O Change Theme Ctrl+Alt+D Go to Spaces Ctrl+Alt+P Privacy policy and Copyright 1999-2025 W3.CSS Mobile First Responsiveness Try to resize the window! w3-third The w3-third class uses 33% of the parent container. On screens smaller than 601 pixels it resizes to full screen. w3-third w3-third"}
{"url": "https://www.w3schools.com/w3css/tryit.asp?filename=tryw3css_flex", "title": "W3Schools Tryit Editor", "text": "W3Schools Tryit Editor Run ❯ Get your own website ❯ Run Code Ctrl+Alt+R Save Code Ctrl+Alt+A Change Orientation Ctrl+Alt+O Change Theme Ctrl+Alt+D Go to Spaces Ctrl+Alt+P Privacy policy and Copyright 1999-2025 W3.CSS 1 2 3"}
{"url": "https://www.w3schools.com/w3css/tryit.asp?filename=tryw3css_grid_template_columns_autofit", "title": "W3Schools Tryit Editor", "text": "W3Schools Tryit Editor Run ❯ Get your own website ❯ Run Code Ctrl+Alt+R Save Code Ctrl+Alt+A Change Orientation Ctrl+Alt+O Change Theme Ctrl+Alt+D Go to Spaces Ctrl+Alt+P Privacy policy and Copyright 1999-2025 Modern W3.CSS Template 1 2 3 4 5 6 7 8 9"}
{"url": "https://www.w3schools.com/w3css/tryit.asp?filename=tryw3css_lists_header", "title": "W3Schools Tryit Editor", "text": "W3Schools Tryit Editor Run ❯ Get your own website ❯ Run Code Ctrl+Alt+R Save Code Ctrl+Alt+A Change Orientation Ctrl+Alt+O Change Theme Ctrl+Alt+D Go to Spaces Ctrl+Alt+P Privacy policy and Copyright 1999-2025 W3.CSS List Header An example of how to add a heading element inside the list item. Names Jill Eve Adam"}
{"url": "https://www.w3schools.com/w3css/tryit.asp?filename=tryw3css_tables_border", "title": "W3Schools Tryit Editor", "text": "W3Schools Tryit Editor Run ❯ Get your own website ❯ Run Code Ctrl+Alt+R Save Code Ctrl+Alt+A Change Orientation Ctrl+Alt+O Change Theme Ctrl+Alt+D Go to Spaces Ctrl+Alt+P Privacy policy and Copyright 1999-2025 W3.CSS Border Around Table The w3-border class adds a border around the table. First Name Last Name Points Jill Smith 50 Eve Jackson 94 Adam Johnson 67"}
{"url": "https://www.w3schools.com/w3css/tryit.asp?filename=tryw3css_cards_photo", "title": "W3Schools Tryit Editor", "text": "W3Schools Tryit Editor Run ❯ Get your own website ❯ Run Code Ctrl+Alt+R Save Code Ctrl+Alt+A Change Orientation Ctrl+Alt+O Change Theme Ctrl+Alt+D Go to Spaces Ctrl+Alt+P Privacy policy and Copyright 1999-2025 W3.CSS Photo Card The Italian / Austrian Alps"}
{"url": "https://www.w3schools.com/w3css/tryit.asp?filename=tryw3css_colors_warning_ex", "title": "W3Schools Tryit Editor", "text": "W3Schools Tryit Editor Run ❯ Get your own website ❯ Run Code Ctrl+Alt+R Save Code Ctrl+Alt+A Change Orientation Ctrl+Alt+O Change Theme Ctrl+Alt+D Go to Spaces Ctrl+Alt+P Privacy policy and Copyright 1999-2025 W3.CSS WARNING Orange often indicates a warning that might need attention."}
{"url": "https://www.w3schools.com/w3css/tryit.asp?filename=tryw3css_panels_containers", "title": "W3Schools Tryit Editor", "text": "W3Schools Tryit Editor Run ❯ Get your own website ❯ Run Code Ctrl+Alt+R Save Code Ctrl+Alt+A Change Orientation Ctrl+Alt+O Change Theme Ctrl+Alt+D Go to Spaces Ctrl+Alt+P Privacy policy and Copyright 1999-2025 W3.CSS Displaying Panels Panels are the same as containers except for an added top and bottom margin. I am a panel I am a panel I am a container I am a container"}
{"url": "https://www.w3schools.com/w3css/tryit.asp?filename=tryw3css_intro_container", "title": "W3Schools Tryit Editor", "text": "W3Schools Tryit Editor Run ❯ Get your own website ❯ Run Code Ctrl+Alt+R Save Code Ctrl+Alt+A Change Orientation Ctrl+Alt+O Change Theme Ctrl+Alt+D Go to Spaces Ctrl+Alt+P Privacy policy and Copyright 1999-2025 W3.CSS This is a Header London London is the most populous city in the United Kingdom, with a metropolitan area of over 9 million inhabitants. This is a footer"}
{"url": "https://www.w3schools.com/w3css/tryit.asp?filename=tryw3css_intro_color", "title": "W3Schools Tryit Editor", "text": "W3Schools Tryit Editor Run ❯ Get your own website ❯ Run Code Ctrl+Alt+R Save Code Ctrl+Alt+A Change Orientation Ctrl+Alt+O Change Theme Ctrl+Alt+D Go to Spaces Ctrl+Alt+P Privacy policy and Copyright 1999-2025 W3.CSS Background Colors The w3-color classes define background colors for HTML elements"}
{"url": "https://www.w3schools.com/default.asp", "title": "W3Schools Online Web Tutorials", "text": "W3Schools Online Web Tutorials Tutorials References Exercises Certificates Menu Search field × See More Sign In ★ +1 Get Certified Upgrade For Teachers Spaces Get Certified Upgrade For Teachers Spaces  My W3Schools Tutorials References Exercises Certificates Spaces Get Certified Plus Academy All our Services Logout     × Tutorials Tutorials filter input × HTML and CSS Learn HTML Tutorial Reference Learn CSS Tutorial Reference Learn RWD Tutorial Learn Bootstrap Overview Learn W3.CSS Tutorial Reference Learn Sass Tutorial Reference Learn Colors Tutorial Reference Learn Icons Tutorial Reference Learn SVG Tutorial Reference Learn Canvas Tutorial Reference Learn Graphics Tutorial Learn UTF-8 and Emojis Reference Learn How To Tutorial Data Analytics Learn AI Tutorial Learn Generative AI Tutorial Learn ChatGPT-3.5 Tutorial Learn ChatGPT-4 Tutorial Learn Google Bard Tutorial Learn Machine Learning Tutorial Learn DSA Tutorial Learn Data Science Tutorial Learn NumPy Tutorial Learn Pandas Tutorial Learn SciPy Tutorial Learn Matplotlib Tutorial Learn Statistics Tutorial Learn Excel Tutorial Learn Google Sheets Tutorial Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter JavaScript Learn JavaScript Tutorial Reference Learn React Tutorial Learn jQuery Tutorial Reference Learn Vue Tutorial Reference Learn Angular Tutorial Learn AngularJS Tutorial Reference Learn JSON Tutorial Reference Learn AJAX Tutorial Learn AppML Tutorial Reference Learn W3.JS Tutorial Reference Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter Backend Learn Python Tutorial Reference Learn SQL Tutorial Reference Learn MySQL Tutorial Reference Learn PHP Tutorial Reference Learn Java Tutorial Reference Learn C Tutorial Reference Learn C++ Tutorial Reference Learn C# Tutorial Learn R Tutorial Learn Kotlin Tutorial Learn Rust Tutorial Learn Go Tutorial Learn Django Tutorial Reference Learn PostgreSQL Tutorial Learn TypeScript Tutorial Learn ASP Tutorial Reference Learn Node.js Tutorial Reference Learn Raspberry Pi Tutorial Learn Git Tutorial Learn Bash Tutorial Learn MongoDB Tutorial Learn XML Tutorial Reference Data Analytics Learn AI Tutorial Learn Generative AI Tutorial Learn ChatGPT-3.5 Tutorial Learn ChatGPT-4 Tutorial Learn Google Bard Tutorial Learn Machine Learning Tutorial Learn DSA Tutorial Learn Data Science Tutorial Learn NumPy Tutorial Learn Pandas Tutorial Learn SciPy Tutorial Learn Matplotlib Tutorial Learn Statistics Tutorial Learn Excel Tutorial Learn Google Sheets Tutorial Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter × References References filter input × HTML and CSS HTML Tags Reference CSS Reference W3.CSS Reference Bootstrap 3 Reference Bootstrap 4 Reference Color Names Icons Reference SVG Reference Canvas Reference Sass Reference UTF-8 Charset Reference UTF-8 Emojis Reference JavaScript JavaScript Reference jQuery Reference Vue Reference Angular Reference JSON Reference AppML Reference W3.JS Reference Backend Python Reference SQL Reference MySQL Reference PHP Reference Java Reference C Reference C++ Reference Django Reference ASP Reference Node.js Reference XML Reference × Exercises Excercises filter input × HTML and CSS HTML Exercise Quiz CSS Exercise Quiz Bootstrap 3 Exercise Quiz Bootstrap 4 Exercise Quiz Bootstrap 5 Exercise Quiz Data Analytics DSA Exercise Quiz NumPy Exercise Quiz Pandas Exercise Quiz SciPy Exercise Quiz Excel Exercise What is an Exercise? What is a Quiz? JavaScript JavaScript Exercise Quiz React Exercise Quiz jQuery Exercise Quiz Vue Exercise Quiz Angular Exercise Quiz Backend Python Exercise Quiz SQL Exercise Quiz MySQL Exercise Quiz PHP Exercise Quiz Java Exercise Quiz C Exercise Quiz C++ Exercise Quiz C# Exercise Quiz R Exercise Quiz Kotlin Exercise Quiz Django Exercise Quiz Node.js Exercise Quiz PostgreSQL Exercise Quiz TypeScript Exercise Quiz Git Exercise Quiz Bash Exercise Quiz Go Exercise MongoDB Exercise Data Analytics DSA Exercise Quiz NumPy Exercise Quiz Pandas Exercise Quiz SciPy Exercise Quiz Excel Exercise What is an Exercise? What is a Quiz? × Certificates Filter field for certifications × HTML and CSS HTML Certificate Course CSS Certificate Course Bootstrap 3 Certificate Course Bootstrap 4 Certificate Course Bootstrap 5 Certificate Data Analytics DSA Certificate Data Analytics Course NumPy Certificate Course Pandas Certificate Course Excel Certificate Social Media Course What is a Certificate? Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course JavaScript JavaScript Certificate Course React Certificate Course jQuery Certificate Course Vue Certificate Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course Backend Python Certificate Course SQL Certificate Course MySQL Certificate PHP Certificate Course Java Certificate Course C Certificate C++ Certificate Course C# Certificate Course R Course Django Certificate NodeJS Certificate TypeScript Certificate Course XML Certificate Course Cyber Security Certificate Course Accessibility Certificate Course Data Analytics DSA Exam Data Analytics Course NumPy Course Pandas Course Excel Certificate Social Media Course What is a Certificate? × All Our Services Dark mode  Services filter input × W3Schools offers a wide range of services and products for beginners and professionals, helping millions of people everyday to learn and master new skills. Free Tutorials Enjoy our free tutorials like millions of other internet users since 1999 References Explore our selection of references covering all popular coding languages Create a Website Create your own website with W3Schools Spaces - no setup required Exercises Test your skills with different exercises Quizzes Test yourself with multiple choice questions Get Certified Document your knowledge Log in / Sign Up Create a free W3Schools Account to Improve Your Learning Experience My Learning Track your learning progress at W3Schools and collect rewards Upgrade Become a PLUS user and unlock powerful features (ad-free, hosting, support,..) Where To Start Not sure where you want to start? Follow our guided path Code Editor (Try it) With our online code editor, you can edit code and view the result in your browser Videos Learn the basics of HTML in a fun and engaging video tutorial Templates We have created a bunch of responsive website templates you can use - for free! Web Hosting Host your own website, and share it to the world with W3Schools Spaces Create a Server Create your own server using Python, PHP, React.js, Node.js, Java, C#, etc. How To's Large collection of code snippets for HTML, CSS and JavaScript CSS Framework Build fast and responsive sites using our free W3.CSS framework Browser Statistics Read long term trends of browser usage Typing Speed Test your typing speed Color Picker Use our color picker to find different RGB, HEX and HSL colors. Code Game W3Schools Coding Game! Help the lynx collect pine cones Newsletter Join our newsletter and get access to exclusive content every month For Teachers Contact us about W3Schools Academy for educational institutions For Businesses Contact us about W3Schools Academy for your organization Contact Us About sales: sales@w3schools.com About errors: help@w3schools.com Emojis Reference Check out our refererence page with all the emojis supported in HTML 😊 UTF-8 Reference Check out our full UTF-8 Character reference     × ❮ ❯ HTML CSS JAVASCRIPT SQL PYTHON JAVA PHP HOW TO W3.CSS C C++ C# BOOTSTRAP REACT MYSQL JQUERY EXCEL XML DJANGO NUMPY PANDAS NODEJS DSA TYPESCRIPT ANGULAR ANGULARJS GIT POSTGRESQL MONGODB ASP AI R GO KOTLIN SASS VUE GEN AI SCIPY CYBERSECURITY DATA SCIENCE INTRO TO PROGRAMMING BASH RUST Learn to Code With the world's largest web developer site. Not Sure Where To Begin? HTML The language for building web pages Learn HTML Video Tutorial HTML Reference Get Certified HTML Example: <!DOCTYPE html> <html> <head> <title>HTML Tutorial</title> </head> <body> <h1>This is a heading</h1> <p>This is a paragraph.</p> </body> </html> Try it Yourself CSS The language for styling web pages Learn CSS CSS Reference Get Certified CSS Example: body { background-color: lightblue; } h1 { color: white; text-align: center; } p { font-family: verdana; } Try it Yourself JavaScript The language for programming web pages Learn JavaScript JavaScript Reference Get Certified JavaScript Example: <button onclick=\"myFunction()\">Click Me!</button> <script> function myFunction() { let x = document.getElementById(\"demo\"); x.style.fontSize = \"25px\"; x.style.color = \"red\"; } </script> Try it Yourself Python A popular programming language Learn Python Python Reference Get Certified Python Example: if 5 > 2: print(\"Five is greater than two!\") Try it Yourself SQL A language for accessing databases Learn SQL SQL Reference Get Certified SQL Example: SELECT * FROM Customers WHERE Country='Mexico'; Try it Yourself PHP A web server programming language Learn PHP jQuery A JS library for developing web pages Learn jQuery Java A programming language Learn Java C++ A programming language Learn C++ W3.CSS A CSS framework for faster and better responsive web pages Learn W3.CSS Bootstrap A CSS framework for designing better web pages Learn Bootstrap C C# R Kotlin Node.js React JSON Vue MySQL XML Sass Icons RWD Graphics SVG Canvas Raspberry Pi Cyber Security Colors Git Matplotlib NumPy Pandas SciPy ASP AngularJS AppML Go TypeScript Django MongoDB Statistics Data Science PostgreSQL HowTo Rust Spaces Typing Speed Excel DSA - D ata S tructures and A lgorithms Machine Learning Artificial Intelligence Introduction to Programming Bash Log in / Sign Up Create a free account to track your progress, and get access to more features and learning materials. Sign Up for Free Code Editor With our online code editor, you can edit code and view the result in your browser Frontend Backend Try Frontend Editor (HTML/CSS/JS) Try Backend Editor (Python/PHP/Java/C..) W3Schools Spaces If you want to create your own website, check out W3Schools Spaces . It is free to use, and does not require any setup: Learn More Become a Plus User And unlock powerful features: Browse W3Schools without ads Build and host Websites Unlimited challenges Unlimited practice tests Get extra credits Priority support Learn More For Teachers Streamline your teaching: Manage your classroom Ready-to-use learning materials Customize study plans Track student progress Interactive coding challenges Learn More Color Picker W3Schools' famous color picker: Code Game Help the Lynx collect pine cones! Play Game Exercises and Quizzes Test your skills! Exercises Quizzes Web Templates Browse our selection of free responsive HTML Templates Browse Templates Kickstart your career Get certified by completing a course Get started w 3 s c h o o l s C E R T I F I E D . 2 0 2 5 How To Section Code snippets for HTML, CSS and JavaScript For example, how to create a slideshow: Learn How To ★ +1 Sign in to track progress PLUS SPACES GET CERTIFIED FOR TEACHERS FOR BUSINESS CONTACT US × Contact Sales If you want to use W3Schools services as an educational institution, team or enterprise, send us an e-mail: sales@w3schools.com Report Error If you want to report an error, or if you want to make a suggestion, send us an e-mail: help@w3schools.com Top Tutorials HTML Tutorial CSS Tutorial JavaScript Tutorial How To Tutorial SQL Tutorial Python Tutorial W3.CSS Tutorial Bootstrap Tutorial PHP Tutorial Java Tutorial C++ Tutorial jQuery Tutorial Top References HTML Reference CSS Reference JavaScript Reference SQL Reference Python Reference W3.CSS Reference Bootstrap Reference PHP Reference HTML Colors Java Reference AngularJS Reference jQuery Reference Top Examples HTML Examples CSS Examples JavaScript Examples How To Examples SQL Examples Python Examples W3.CSS Examples Bootstrap Examples PHP Examples Java Examples XML Examples jQuery Examples Get Certified HTML Certificate CSS Certificate JavaScript Certificate Front End Certificate SQL Certificate Python Certificate PHP Certificate jQuery Certificate Java Certificate C++ Certificate C# Certificate XML Certificate     FORUM ABOUT ACADEMY W3Schools is optimized for learning and training. Examples might be simplified to improve reading and learning. Tutorials, references, and examples are constantly reviewed to avoid errors, but we cannot warrant full correctness of all content. While using W3Schools, you agree to have read and accepted our terms of use , cookie and privacy policy . Copyright 1999-2025 by Refsnes Data. All Rights Reserved. W3Schools is Powered by W3.CSS ."}
{"url": "https://www.w3schools.com/tryit/trycompiler.asp?filename=demo_python", "title": "Tryit Compiler v1.0", "text": "Tryit Compiler v1.0 Run ❯ Get your own website × Change Orientation Privacy policy and Copyright 1999-2025 Input + + print(\"Hello, World!\") Hello World! × Confirm your selection The source code will be changed. Are you sure you want to discard it and move to a new language? Yes! No! I want to stay!"}
{"url": "https://www.w3schools.com/tryit/tryit.asp?filename=tryhtml_hello", "title": "W3Schools Tryit Editor", "text": "W3Schools Tryit Editor Run ❯ Get your own website ❯ Run Code Ctrl+Alt+R Save Code Ctrl+Alt+A Change Orientation Ctrl+Alt+O Change Theme Ctrl+Alt+D Go to Spaces Ctrl+Alt+P Privacy policy and Copyright 1999-2025 Hello World! This is a paragraph."}
{"url": "https://www.w3schools.com/js/js_json.asp", "title": "JavaScript JSON", "text": "JavaScript JSON Tutorials References Exercises Certificates Menu Search field × See More Sign In ★ +1 Get Certified Upgrade For Teachers Spaces Get Certified Upgrade For Teachers Spaces  My W3Schools Tutorials References Exercises Certificates Spaces Get Certified Plus Academy All our Services Logout     × Tutorials Tutorials filter input × HTML and CSS Learn HTML Tutorial Reference Learn CSS Tutorial Reference Learn RWD Tutorial Learn Bootstrap Overview Learn W3.CSS Tutorial Reference Learn Sass Tutorial Reference Learn Colors Tutorial Reference Learn Icons Tutorial Reference Learn SVG Tutorial Reference Learn Canvas Tutorial Reference Learn Graphics Tutorial Learn UTF-8 and Emojis Reference Learn How To Tutorial Data Analytics Learn AI Tutorial Learn Generative AI Tutorial Learn ChatGPT-3.5 Tutorial Learn ChatGPT-4 Tutorial Learn Google Bard Tutorial Learn Machine Learning Tutorial Learn DSA Tutorial Learn Data Science Tutorial Learn NumPy Tutorial Learn Pandas Tutorial Learn SciPy Tutorial Learn Matplotlib Tutorial Learn Statistics Tutorial Learn Excel Tutorial Learn Google Sheets Tutorial Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter JavaScript Learn JavaScript Tutorial Reference Learn React Tutorial Learn jQuery Tutorial Reference Learn Vue Tutorial Reference Learn Angular Tutorial Learn AngularJS Tutorial Reference Learn JSON Tutorial Reference Learn AJAX Tutorial Learn AppML Tutorial Reference Learn W3.JS Tutorial Reference Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter Backend Learn Python Tutorial Reference Learn SQL Tutorial Reference Learn MySQL Tutorial Reference Learn PHP Tutorial Reference Learn Java Tutorial Reference Learn C Tutorial Reference Learn C++ Tutorial Reference Learn C# Tutorial Learn R Tutorial Learn Kotlin Tutorial Learn Rust Tutorial Learn Go Tutorial Learn Django Tutorial Reference Learn PostgreSQL Tutorial Learn TypeScript Tutorial Learn ASP Tutorial Reference Learn Node.js Tutorial Reference Learn Raspberry Pi Tutorial Learn Git Tutorial Learn Bash Tutorial Learn MongoDB Tutorial Learn XML Tutorial Reference Data Analytics Learn AI Tutorial Learn Generative AI Tutorial Learn ChatGPT-3.5 Tutorial Learn ChatGPT-4 Tutorial Learn Google Bard Tutorial Learn Machine Learning Tutorial Learn DSA Tutorial Learn Data Science Tutorial Learn NumPy Tutorial Learn Pandas Tutorial Learn SciPy Tutorial Learn Matplotlib Tutorial Learn Statistics Tutorial Learn Excel Tutorial Learn Google Sheets Tutorial Web Building Create a Website HOT! Create a Server NEW Where To Start Web Templates Web Statistics Web Certificates Web Development Introduction to Programming Code Editor Test Your Typing Speed Play a Code Game Cyber Security Accessibility Join our Newsletter × References References filter input × HTML and CSS HTML Tags Reference CSS Reference W3.CSS Reference Bootstrap 3 Reference Bootstrap 4 Reference Color Names Icons Reference SVG Reference Canvas Reference Sass Reference UTF-8 Charset Reference UTF-8 Emojis Reference JavaScript JavaScript Reference jQuery Reference Vue Reference Angular Reference JSON Reference AppML Reference W3.JS Reference Backend Python Reference SQL Reference MySQL Reference PHP Reference Java Reference C Reference C++ Reference Django Reference ASP Reference Node.js Reference XML Reference × Exercises Excercises filter input × HTML and CSS HTML Exercise Quiz CSS Exercise Quiz Bootstrap 3 Exercise Quiz Bootstrap 4 Exercise Quiz Bootstrap 5 Exercise Quiz Data Analytics DSA Exercise Quiz NumPy Exercise Quiz Pandas Exercise Quiz SciPy Exercise Quiz Excel Exercise What is an Exercise? What is a Quiz? JavaScript JavaScript Exercise Quiz React Exercise Quiz jQuery Exercise Quiz Vue Exercise Quiz Angular Exercise Quiz Backend Python Exercise Quiz SQL Exercise Quiz MySQL Exercise Quiz PHP Exercise Quiz Java Exercise Quiz C Exercise Quiz C++ Exercise Quiz C# Exercise Quiz R Exercise Quiz Kotlin Exercise Quiz Django Exercise Quiz Node.js Exercise Quiz PostgreSQL Exercise Quiz TypeScript Exercise Quiz Git Exercise Quiz Bash Exercise Quiz Go Exercise MongoDB Exercise Data Analytics DSA Exercise Quiz NumPy Exercise Quiz Pandas Exercise Quiz SciPy Exercise Quiz Excel Exercise What is an Exercise? What is a Quiz? × Certificates Filter field for certifications × HTML and CSS HTML Certificate Course CSS Certificate Course Bootstrap 3 Certificate Course Bootstrap 4 Certificate Course Bootstrap 5 Certificate Data Analytics DSA Certificate Data Analytics Course NumPy Certificate Course Pandas Certificate Course Excel Certificate Social Media Course What is a Certificate? Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course JavaScript JavaScript Certificate Course React Certificate Course jQuery Certificate Course Vue Certificate Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course Programs Full Access Best Value! Front End Certificate Course Web Dev. Certificate Course Web App Certificate Course Web Design Certificate Course Backend Python Certificate Course SQL Certificate Course MySQL Certificate PHP Certificate Course Java Certificate Course C Certificate C++ Certificate Course C# Certificate Course R Course Django Certificate NodeJS Certificate TypeScript Certificate Course XML Certificate Course Cyber Security Certificate Course Accessibility Certificate Course Data Analytics DSA Exam Data Analytics Course NumPy Course Pandas Course Excel Certificate Social Media Course What is a Certificate? × All Our Services Dark mode  Services filter input × W3Schools offers a wide range of services and products for beginners and professionals, helping millions of people everyday to learn and master new skills. Free Tutorials Enjoy our free tutorials like millions of other internet users since 1999 References Explore our selection of references covering all popular coding languages Create a Website Create your own website with W3Schools Spaces - no setup required Exercises Test your skills with different exercises Quizzes Test yourself with multiple choice questions Get Certified Document your knowledge Log in / Sign Up Create a free W3Schools Account to Improve Your Learning Experience My Learning Track your learning progress at W3Schools and collect rewards Upgrade Become a PLUS user and unlock powerful features (ad-free, hosting, support,..) Where To Start Not sure where you want to start? Follow our guided path Code Editor (Try it) With our online code editor, you can edit code and view the result in your browser Videos Learn the basics of HTML in a fun and engaging video tutorial Templates We have created a bunch of responsive website templates you can use - for free! Web Hosting Host your own website, and share it to the world with W3Schools Spaces Create a Server Create your own server using Python, PHP, React.js, Node.js, Java, C#, etc. How To's Large collection of code snippets for HTML, CSS and JavaScript CSS Framework Build fast and responsive sites using our free W3.CSS framework Browser Statistics Read long term trends of browser usage Typing Speed Test your typing speed Color Picker Use our color picker to find different RGB, HEX and HSL colors. Code Game W3Schools Coding Game! Help the lynx collect pine cones Newsletter Join our newsletter and get access to exclusive content every month For Teachers Contact us about W3Schools Academy for educational institutions For Businesses Contact us about W3Schools Academy for your organization Contact Us About sales: sales@w3schools.com About errors: help@w3schools.com Emojis Reference Check out our refererence page with all the emojis supported in HTML 😊 UTF-8 Reference Check out our full UTF-8 Character reference     × ❮ ❯ HTML CSS JAVASCRIPT SQL PYTHON JAVA PHP HOW TO W3.CSS C C++ C# BOOTSTRAP REACT MYSQL JQUERY EXCEL XML DJANGO NUMPY PANDAS NODEJS DSA TYPESCRIPT ANGULAR ANGULARJS GIT POSTGRESQL MONGODB ASP AI R GO KOTLIN SASS VUE GEN AI SCIPY CYBERSECURITY DATA SCIENCE INTRO TO PROGRAMMING BASH RUST Basic JavaScript JS Tutorial JS Tutorial JS Introduction JS Where To JS Output JS Syntax JS Syntax JS Statements JS Comments JS Variables JS Variables JS Let JS Const JS Types JS Operators JS Operators JS Arithmetic JS Assignment JS Comparisons JS If Conditions JS Conditional JS If JS If Else JS Ternary JS Switch JS Booleans JS Logical JS Loops JS Loops JS Loop for JS Loop while JS Break JS Continue JS Strings JS Strings JS String Templates JS String Methods JS String Search JS String Reference JS Numbers JS Numbers JS Number Methods JS Number Properties JS Number Reference JS BigInt JS Bitwise JS Functions JS Objects JS Dates JS Dates JS Date Formats JS Date Get JS Date Set JS Date Reference JS Arrays JS Arrays JS Array Methods JS Array Search JS Array Sort JS Array Iterations JS Array Reference JS Array Const JS Typed Arrays JS Typed Methods JS Typed Reference JS Sets JS Sets JS Set Methods JS Set Logic JS Set WeakSet JS Set Reference JS Maps JS Maps JS Map Methods JS Map WeakMap JS Map Reference JS Math JS Math JS Math Reference JS Random JS RegExp JS RegExp JS RegExp Flags JS RegExp Classes JS RegExp Metachars JS RegExp Assertions JS RegExp Quantifiers JS RegExp Patterns JS RegExp Objects JS RegExp Methods JS Data Types JS Data Types JS typeof JS toString() JS Type Conversion JS Errors JS Debugging JS Events JS Programming JS Control Flow JS Scope JS Hoisting JS Strict Mode JS Code Blocks JS Style Guide JS Best Practices JS Mistakes JS Performance JS References JS Keywords Reference JS Keywords Reserved JS Operator Reference JS Operator Precedence JS UTF-8 Characters JS UTF-8 Letters JS UTF-8 Symbols JS UTF-8 Emojis JS Versions JS Versions JS 2025 JS 2024 JS 2023 JS 2022 JS 2021 JS 2020 JS 2019 JS 2018 JS 2017 JS 2016 JS 2015 (ES6) JS 2009 (ES5) JS IE / Edge JS History JS Advanced JS Functions Function Definitions Function Arrows Function Parameters Function Invocation Function this Function Call Function Apply Function Bind Function Closures JS Objects Object Definitions Object Properties Object Methods Object Display Object Constructors Object this Object Destructuring Object Prototypes Object Iterations Object Management Object Get / Set Object Protection Object Reference JS Classes JS Classes JS Class Inheritance JS Class Static JS Iterations JS Loops JS Iterables JS Iterators JS Generators JS Promises JS Callbacks JS Asynchronous JS Promises JS Async/Await JS Modules JS HTML DOM DOM Intro DOM Methods DOM Document DOM Elements DOM HTML DOM Forms DOM CSS DOM Animations DOM Events DOM Event Listener DOM Navigation DOM Nodes DOM Collections DOM Node Lists JS Windows JS Window JS Screen JS Location JS History JS Navigator JS Popup Alert JS Timing JS Cookies JS Web API Web API Intro Web Validation API Web History API Web Storage API Web Worker API Web Fetch API Web Geolocation API JS AJAX AJAX Intro AJAX XMLHttp AJAX Request AJAX Response AJAX XML File AJAX PHP AJAX ASP AJAX Database AJAX Applications AJAX Examples JS JSON JSON Intro JSON Syntax JSON vs XML JSON Data Types JSON Parse JSON Stringify JSON Objects JSON Arrays JSON Server JSON PHP JSON HTML JSON JSONP JS jQuery jQuery Selectors jQuery HTML jQuery CSS jQuery DOM JS Graphics JS Graphics JS Canvas JS Plotly JS Chart.js JS Google Chart JS D3.js JS Examples JS Examples JS HTML DOM JS HTML Input JS HTML Objects JS HTML Events JS Browser JS Editor JS Exercises JS Quiz JS Website JS Syllabus JS Study Plan JS Interview Prep JS Bootcamp JS Certificate JS Reference JavaScript JSON ❮ Previous Next ❯ JSON JSON stands for J ava S cript O bject N otation. JSON is a plain text format for storing and transporting data. JSON is similar to the syntax for creating JavaScript objects. JSON is used to send , receive and store data . Example '{\"name\":\"John\", \"age\":30, \"car\":null}' The example above defines an object with 3 properties: \"name\" \"age\" \"car\" Each property has a value: \"John\" 30 null Why JSON? JSON is make it easy to send and store data between computers JSON is text only and language independent * * The syntax is derived from JavaScript object syntax, but JSON is text only. Code for reading and generating JSON data can be written in any programming language. The JSON format was originally specified by Douglas Crockford . JSON and JavaScript The JSON format is syntactically identical to the code for creating JavaScript objects. Because of this, a JavaScript program can easily convert JSON data into native JavaScript objects. JavaScript has a built in function for converting JSON strings into JavaScript objects: JSON.parse() JavaScript also has a built in function for converting an object into a JSON string: JSON.stringify() You can receive pure text from a server and use it as a JavaScript object. You can send a JavaScript object to a server in pure text format. You can work with data as JavaScript objects, with no complicated parsing and translations. Storing Data When storing data, the data has to be a certain format, and regardless of where you choose to store it, text is always one of the legal formats. JSON makes it possible to store JavaScript objects as text. JSON Example Text that defines an employees object with an array of 3 employee objects: { \"employees\":[ {\"firstName\":\"John\", \"lastName\":\"Doe\"}, {\"firstName\":\"Anna\", \"lastName\":\"Smith\"}, {\"firstName\":\"Peter\", \"lastName\":\"Jones\"} ] } If you parse the JSON string with a JavaScript program, you can access the data as an object: let personName = obj.name; let personAge = obj.age; JSON Data - A Name and a Value JSON data is written as name/value pairs, just like JavaScript object properties. A name/value pair consists of a field name (in double quotes), followed by a colon, followed by a value: \"firstName\":\"John\" JSON names require double quotes. JavaScript names do not. JSON Objects JSON objects are written inside curly braces. Just like in JavaScript, objects can contain multiple name/value pairs: {\"firstName\":\"John\", \"lastName\":\"Doe\"} JSON Arrays JSON arrays are written inside square brackets. Just like in JavaScript, an array can contain objects: \"employees\":[ {\"firstName\":\"John\", \"lastName\":\"Doe\"}, {\"firstName\":\"Anna\", \"lastName\":\"Smith\"}, {\"firstName\":\"Peter\", \"lastName\":\"Jones\"} ] In the example above, the object \"employees\" is an array. It contains three objects. Each object is a record of a person (with a first name and a last name). Converting a JSON Text to a JavaScript Object A common use of JSON is to read data from a web server, and display the data in a web page. For simplicity, this can be demonstrated using a string as input. First, create a JavaScript string containing JSON syntax: let text = '{ \"employees\" : [' + '{ \"firstName\":\"John\" , \"lastName\":\"Doe\" },' + '{ \"firstName\":\"Anna\" , \"lastName\":\"Smith\" },' + '{ \"firstName\":\"Peter\" , \"lastName\":\"Jones\" } ]}'; Then, use the JavaScript built-in function JSON.parse() to convert the string into a JavaScript object: const obj = JSON.parse(text); Finally, use the new JavaScript object in your page: Example <p id=\"demo\"></p> <script> document.getElementById(\"demo\").innerHTML = obj.employees[1].firstName + \" \" + obj.employees[1].lastName; </script> Try it Yourself » ❮ Previous Next ❯ ★ +1 Sign in to track progress COLOR PICKER REMOVE ADS PLUS SPACES GET CERTIFIED FOR TEACHERS FOR BUSINESS CONTACT US × Contact Sales If you want to use W3Schools services as an educational institution, team or enterprise, send us an e-mail: sales@w3schools.com Report Error If you want to report an error, or if you want to make a suggestion, send us an e-mail: help@w3schools.com Top Tutorials HTML Tutorial CSS Tutorial JavaScript Tutorial How To Tutorial SQL Tutorial Python Tutorial W3.CSS Tutorial Bootstrap Tutorial PHP Tutorial Java Tutorial C++ Tutorial jQuery Tutorial Top References HTML Reference CSS Reference JavaScript Reference SQL Reference Python Reference W3.CSS Reference Bootstrap Reference PHP Reference HTML Colors Java Reference AngularJS Reference jQuery Reference Top Examples HTML Examples CSS Examples JavaScript Examples How To Examples SQL Examples Python Examples W3.CSS Examples Bootstrap Examples PHP Examples Java Examples XML Examples jQuery Examples Get Certified HTML Certificate CSS Certificate JavaScript Certificate Front End Certificate SQL Certificate Python Certificate PHP Certificate jQuery Certificate Java Certificate C++ Certificate C# Certificate XML Certificate     FORUM ABOUT ACADEMY W3Schools is optimized for learning and training. Examples might be simplified to improve reading and learning. Tutorials, references, and examples are constantly reviewed to avoid errors, but we cannot warrant full correctness of all content. While using W3Schools, you agree to have read and accepted our terms of use , cookie and privacy policy . Copyright 1999-2025 by Refsnes Data. All Rights Reserved. W3Schools is Powered by W3.CSS ."}
{"url": "https://www.w3schools.com/sql/trysql.asp?filename=trysql_select_where", "title": "SQL Tryit Editor v1.6", "text": "SQL Tryit Editor v1.6 Get your own SQL server SQL Statement: SELECT * FROM Customers WHERE Country='Mexico'; Edit the SQL Statement, and click \"Run SQL\" to see the result. Run SQL » Result: Click \"Run SQL\" to execute the SQL statement above. W3Schools has created an SQL database in your browser. The menu to the right displays the database, and will reflect any changes. Feel free to experiment with any SQL statement. You can restore the database at any time. The Try-SQL Editor at w3schools.com This SQL-Statement is not supported in the WebSQL Database. The example still works, because it uses a modified version of SQL. Your browser does not support WebSQL. You are now using a light-version of the Try-SQL Editor, with a read-only Database. If you switch to a browser with WebSQL support, you can try any SQL statement, and play with the Database as much as you like. The Database can also be restored at any time. Our Try-SQL Editor uses WebSQL to demonstrate SQL. A Database-object is created in your browser, for testing purposes. You can try any SQL statement, and play with the Database as much as you like. The Database can be restored at any time, simply by clicking the \"Restore Database\" button. W3C WebSQL WebSQL stores a Database locally, on the user's computer. Each user gets their own Database object. WebSQL Browser Support WebSQL is supported in Chrome, Safari, Opera, and Edge(79). If you use another browser you will still be able to use our Try SQL Editor, but a different version, using a server-based ASP application, with a read-only Access Database, where users are not allowed to make any changes to the data. Your Database: Restore Database"}
{"url": "https://www.w3schools.com/python/trypython.asp?filename=demo_indentation", "title": "W3Schools Tryit Editor", "text": "W3Schools Tryit Editor Run ❯ Get your own Python server ❯ Run Code Ctrl+Alt+R Change Orientation Ctrl+Alt+O Change Theme Ctrl+Alt+D Go to Spaces Ctrl+Alt+P Privacy policy and Copyright 1999-2025 if 5 > 2: print(\"Five is greater than two!\") Five is greater than two!"}
{"url": "https://www.w3schools.com/js/tryit.asp?filename=tryjs_default", "title": "W3Schools Tryit Editor", "text": "W3Schools Tryit Editor Run ❯ Get your own website ❯ Run Code Ctrl+Alt+R Save Code Ctrl+Alt+A Change Orientation Ctrl+Alt+O Change Theme Ctrl+Alt+D Go to Spaces Ctrl+Alt+P Privacy policy and Copyright 1999-2025 JavaScript The onclick Event Click the button to change the layout of this paragraph Click Me!"}
{"url": "https://www.w3schools.com/css/tryit.asp?filename=trycss_default", "title": "W3Schools Tryit Editor", "text": "W3Schools Tryit Editor Home CSS Try CSS Run ❯ Get your own website ❯ Run Code Ctrl+Alt+R Save Code Ctrl+Alt+A Change Orientation Ctrl+Alt+O Change Theme Ctrl+Alt+D Go to Spaces Ctrl+Alt+P Privacy policy and Copyright 1999-2025 My First CSS Example This is a paragraph."}
{"url": "https://www.w3schools.com/html/tryit.asp?filename=tryhtml_default_default", "title": "W3Schools Tryit Editor", "text": "W3Schools Tryit Editor Run ❯ Get your own website ❯ Run Code Ctrl+Alt+R Save Code Ctrl+Alt+A Change Orientation Ctrl+Alt+O Change Theme Ctrl+Alt+D Go to Spaces Ctrl+Alt+P Privacy policy and Copyright 1999-2025 Page Title This is a Heading This is a paragraph."}
{"url": "https://www.w3schools.com/w3css/tryw3css_templates_food_blog.htm", "title": "W3.CSS Template", "text": "W3.CSS Template Close Menu Food About ☰ Mail My Food The Perfect Sandwich, A Real NYC Classic Just some random text, lorem ipsum text praesent tincidunt ipsum lipsum. Let Me Tell You About This Steak Once again, some random text to lorem lorem lorem lorem ipsum text praesent tincidunt ipsum lipsum. Cherries, interrupted Lorem ipsum text praesent tincidunt ipsum lipsum. What else? Once Again, Robust Wine and Vegetable Pasta Lorem ipsum text praesent tincidunt ipsum lipsum. All I Need Is a Popsicle Lorem ipsum text praesent tincidunt ipsum lipsum. Salmon For Your Skin Once again, some random text to lorem lorem lorem lorem ipsum text praesent tincidunt ipsum lipsum. The Perfect Sandwich, A Real Classic Just some random text, lorem ipsum text praesent tincidunt ipsum lipsum. Le French Lorem lorem lorem lorem ipsum text praesent tincidunt ipsum lipsum. « 1 2 3 4 » About Me, The Food Man I am Who I Am! With Passion For Real, Good Food Just me, myself and I, exploring the universe of unknownment. I have a heart of love and an interest of lorem ipsum and mauris neque quam blog. I want to share my world with you. Praesent tincidunt sed tellus ut rutrum. Sed vitae justo condimentum, porta lectus vitae, ultricies congue gravida diam non fringilla. Praesent tincidunt sed tellus ut rutrum. Sed vitae justo condimentum, porta lectus vitae, ultricies congue gravida diam non fringilla. FOOTER Praesent tincidunt sed tellus ut rutrum. Sed vitae justo condimentum, porta lectus vitae, ultricies congue gravida diam non fringilla. Powered by w3.css BLOG POSTS Lorem Sed mattis nunc Ipsum Praes tinci sed POPULAR TAGS Travel New York Dinner Salmon France Drinks Ideas Flavors Cuisine Chicken Dressing Fried Fish Duck"}
{"url": "https://www.w3schools.com/w3css/tryw3css_templates_design.htm", "title": "W3.CSS Template", "text": "W3.CSS Template Hello We are InShock We build design teams - we break things down and build it better - we deliver the best of solutions InShock means powerfull simplicity MOST RECENT WORK: Demos, Logos, Reports, Names, Events, Media, Wordpress, Google, Books, Optimisations Contact Info Chicago, US Phone: +00 151515 Email: mail@mail.com Contact Us If you have an idea. What are you waiting for? Like Us Powered by w3.css"}
{"url": "https://www.w3schools.com/w3css/tryw3css_templates_wedding.htm", "title": "W3.CSS Template", "text": "W3.CSS Template Jane & John Are getting married 17.07.2017 Home Jane & John Wedding RSVP Jane & John You all know us. And we all know you. We are getting married lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Wedding Details You Are Invited Of course.. THE WEDDING When Wedding Ceremony - 2:00pm Reception & Dinner - 5:00pm Where Some place, an address Some where, some address HOPE YOU CAN MAKE IT! Kindly Respond By January, 2017 RSVP CAN YOU COME? We really hope you can make it. Sincerely, John & Jane Going Can't come Powered by w3.css"}
{"url": "https://www.w3schools.com/w3css/tryw3css_templates_cafe.htm", "title": "W3.CSS Template", "text": "W3.CSS Template HOME ABOUT MENU WHERE Open from 6am to 5pm the Cafe 15 Adr street, 5015 ABOUT THE CAFE The Cafe was founded in blabla by Mr. Smith in lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. In addition to our full espresso and brew bar menu, we serve fresh made-to-order breakfast and lunch sandwiches, as well as a selection of sides and salads and other good stuff. \"Use products from nature for what it's worth - but never too early, nor too late.\" Fresh is the new sweet. Chef, Coffeeist and Owner: Liam Brown Opening hours: everyday from 6am to 5pm. Address: 15 Adr street, 5015, NY THE MENU Eat Drink Bread Basket Assortment of fresh baked fruit breads and muffins 5.50 Honey Almond Granola with Fruits Natural cereal of honey toasted oats, raisins, almonds and dates 7.00 Belgian Waffle Vanilla flavored batter with malted flour 7.50 Scrambled eggs Scrambled eggs, roasted red pepper and garlic, with green onions 7.50 Blueberry Pancakes With syrup, butter and lots of berries 8.50 Coffee Regular coffee 2.50 Chocolato Chocolate espresso with milk 4.50 Corretto Whiskey and coffee 5.00 Iced tea Hot tea, except not hot 3.00 Soda Coke, Sprite, Fanta, etc. 2.50 WHERE TO FIND US Find us at some address at some place. FYI! We offer full-service catering for any event, large or small. We understand your needs and we will cater the food to satisfy the biggerst criteria of them all, both look and taste. Reserve a table, ask for today's special or just send us a message: SEND MESSAGE Powered by w3.css"}
{"url": "https://www.w3schools.com/w3css/tryw3css_templates_architect.htm", "title": "W3.CSS Template", "text": "W3.CSS Template BR Architects Projects About Contact BR Architects Projects Summer House Brick House Renovated Barn House Summer House Brick House Renovated Barn House About Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. John Doe CEO & Founder Phasellus eget enim eu lectus faucibus vestibulum. Suspendisse sodales pellentesque elementum. Contact Jane Doe Architect Phasellus eget enim eu lectus faucibus vestibulum. Suspendisse sodales pellentesque elementum. Contact Mike Ross Architect Phasellus eget enim eu lectus faucibus vestibulum. Suspendisse sodales pellentesque elementum. Contact Dan Star Architect Phasellus eget enim eu lectus faucibus vestibulum. Suspendisse sodales pellentesque elementum. Contact Contact Lets get in touch and talk about your next project. SEND MESSAGE Powered by w3.css"}
{"url": "https://www.w3schools.com/w3css/tryw3css_templates_dark_portfolio.htm", "title": "W3.CSS Template", "text": "W3.CSS Template HOME ABOUT PHOTOS CONTACT HOME ABOUT PHOTOS CONTACT I'm John Doe. Photographer and Web Designer. My Name Some text about me. Some text about me. I am lorem ipsum consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. My Skills Photography Web Design Photoshop 11+ Partners 55+ Projects Done 89+ Happy Clients 150+ Meetings Download Resume My Price Basic Web Design Photography 5GB Storage Mail Support $ 10 per month Sign Up Pro Web Design Photography 50GB Storage Endless Support $ 25 per month Sign Up My Reputation Chris Fox. CEO at Mighty Schools. John Doe saved us from a web disaster. Rebecca Flex. CEO at Company. No one is better than John Doe. My Photos Contact Me Chicago, US Phone: +00 151515 Email: mail@mail.com Let's get in touch. Send me a message: SEND MESSAGE Powered by w3.css"}
{"url": "https://www.w3schools.com/w3css/tryw3css_templates_gourmet_catering.htm", "title": "W3.CSS Template", "text": "W3.CSS Template Gourmet au Catering About Menu Contact Le Catering About Catering Tradition since 1889 The Catering was founded in blabla by Mr. Smith in lorem ipsum dolor sit amet, consectetur adipiscing elit consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute iruredolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur.We only use seasonal ingredients. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum consectetur adipiscing elit, sed do eiusmod temporincididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Our Menu Bread Basket Assortment of fresh baked fruit breads and muffins 5.50 Honey Almond Granola with Fruits Natural cereal of honey toasted oats, raisins, almonds and dates 7.00 Belgian Waffle Vanilla flavored batter with malted flour 7.50 Scrambled eggs Scrambled eggs, roasted red pepper and garlic, with green onions 7.50 Blueberry Pancakes With syrup, butter and lots of berries 8.50 Contact We offer full-service catering for any event, large or small. We understand your needs and we will cater the food to satisfy the biggerst criteria of them all, both look and taste. Do not hesitate to contact us. Catering Service, 42nd Living St, 43043 New York, NY You can also contact us by phone 00553123-2323 or email catering@catering.com, or you can send us a message here: SEND MESSAGE Powered by w3.css"}
{"url": "https://www.w3schools.com/w3css/tryit.asp?filename=tryw3css_default_howto", "title": "W3Schools Tryit Editor", "text": "W3Schools Tryit Editor Run ❯ Get your own website ❯ Run Code Ctrl+Alt+R Save Code Ctrl+Alt+A Change Orientation Ctrl+Alt+O Change Theme Ctrl+Alt+D Go to Spaces Ctrl+Alt+P Privacy policy and Copyright 1999-2025 W3.CSS Header A car is a wheeled, self-powered motor vehicle used for transportation. Most definitions of the term specify that cars are designed to run primarily on roads, to have seating for one to eight people, to typically have four wheels. (Wikipedia) First Name Last Name Points Jill Smith 50 Eve Jackson 94 Adam Johnson 67 London is the capital city of England. It is the most populous city in the United Kingdom, with a metropolitan area of over 13 million inhabitants. London is the capital city of England. It is the most populous city in the United Kingdom, with a metropolitan area of over 13 million inhabitants. Footer Footer information goes here"}
{"url": "https://www.w3schools.com/w3css/tryit.asp?filename=tryw3css_default_intro", "title": "W3Schools Tryit Editor", "text": "W3Schools Tryit Editor Run ❯ Get your own website ❯ Run Code Ctrl+Alt+R Save Code Ctrl+Alt+A Change Orientation Ctrl+Alt+O Change Theme Ctrl+Alt+D Go to Spaces Ctrl+Alt+P Privacy policy and Copyright 1999-2025 W3.CSS My Car A car is a wheeled, self-powered motor vehicle used for transportation. My footer information"}
