{"url": "https://www.gla.ac.in", "title": "Best Private University in Mathura, Uttar Pradesh(UP), India", "text": "Best Private University in Mathura, Uttar Pradesh(UP), India Admission Open Rolling Advertisement Student Examination IQAC NRPP Careers ICPC Admission Helpline 9027068068 ABOUT US Who We Are About GLA University Government Recognition Academic and Industry Collaborations Awards and Achievements Code of Conduct and Ethics Policy Best Educational 110-Acre Campus 20-Acre Sports Facility 19 Modern Hostels 19 Modern Hostels Leadership Team Chancellor Vice Chancellor Pro Vice-Chancellor, Greater Noida Campus Registrar Dean Academic Affairs Dean Research & Development Dean Student's Welfare Dean Consultancy Dean, International Relations and Academic Collaborations Controller of Examinations Governing Body Executive Council Academic Council Administration Corporate Advisory Board CSR Activities PraYaas National Service Scheme Cell Udaan Ujjwal Braj Aashayein ACADEMICS Institutes Engineering & Technology Business Management Pharmaceutical Research Applied Sciences & Humanities Legal Studies and Research University Polytechnic Faculty of Education Centre for Distance and Online Education Centre for Vaccines and Diagnostic Research Courses Graduate Courses Post Graduate Courses Doctoral Programme Diploma Courses Departments CSED – Industry 4.0 Facility Social Science & Humanities Computer Engineering & Applications Electrical Engineering Electronics & Communication Mechanical Engineering Civil Engineering English Physics Chemistry Mathematics Biotechnology Library & Information Science Faculty of Agricultural Sciences Centers Indian Knowledge System Examinations and Results Academic Ordinance Results Students Anti Ragging Committee HELP-LINE Anti Ragging Committee Hostel Rules Student Grievance Redressal Committee (SGRC) Grievance Cell Proctorial Board NEP - 2020 Faculty Visiting faculty Distinguished faculty Library Academic Calendar University Holidays Faculty and staff members grievance redressel Committee (FSGRC) NRPP 70+ Multidisciplinary Programs Flexible Multidisciplinary Programs E-Content Facility Experiential Project Based Education COURSES Graduate Courses Post Graduate Courses Doctoral Programme Diploma Courses B.Tech Courses B.Tech in CSE B. Tech (Hons.) CSE (Spec. in AI & Analytics) B.Tech in ECE B.Tech CSE (Specialization in AIML) B.Tech EC (Minor in CS) B.Tech EC (Specialization in VLSI) B.Tech in Electronics and Computer Engineering B.Tech in EEE B.Tech in EE B.Tech EE (Minor in CS) B.Tech EE (EV Technology) B.Tech in ME B.Tech ME (Minor in CS) B.Tech ME (Automobile) B.Tech ME (Mechatronics) B.Tech in CE B.Tech in Biotech B. Tech ME in Smart Manufacturing B. Tech Lateral Entry EC ME CSE CE EE B.Tech EE (EV Technology) B.Tech in ECE - LE B.Tech in EEE B.Tech in Biotech B.Tech EC (Minor in CS) B.Tech EC (Specialization in VLSI) Other UG Courses BCA/ BCA (Hons./ By Research) BBA/ BBA (Hons./ By Rsearch) BBA (Management Sciences) B. Pharm B. Pharm (Lateral Entry) BBA (Family Business) B.Com/ B.Com (H/ By Research) B.A. Eco/ B.A. Eco (H/ By Research) B.A. Eng/ B.A. Eng (H/ By Research) BCA Data Science B.Sc. Biotech/ B.Sc. Biotech (H/ By Research) B.Sc. (Hons.) Agriculture B.Sc. Chem/ B.Sc. Chem (H/ By Research) B.Sc. Physics/ B.Sc. Physics (H/ By Research) B.Sc. Maths/ B.Sc. Maths(H./ BY Research) in DS BBA LLB (Hons.) B.A. LLB (Hons.) B.Ed. B. Com Global Accounting In Association with CIMA BCA in Digital Marketing Bachelor of Library and Information Science Postgraduate Courses M. Tech in ECE M. Tech in EE M. Tech in CSE M. Tech in CE (Structural Engineering) M. Tech ME (Design) M.Tech ME (Production) M. Tech (Energy Systems) Diploma Courses PG Diploma in CTS PG Diploma in AIML PG Diploma in DM PG Diploma in HA PG Diploma in Hospital and HM PG Diploma in CM PG Diploma in Banking and FSM PG Diploma in Web and AD PG Diploma in IoT Certificate Program in Banking and WM Other PG Courses M. Pharm (Pharmaceutics) M. Pharm (Pharmacology) MBA (Hons.) MBA MBA (Logistics and Supply Chain Management) MBA (Financial Markets & Banking) MBA (Business Analytics) MCA M.Sc. (Biotech) M.Sc (Microbiology) M.Sc. (Chemistry) M.Sc. (Physics) M.Sc. (Mathematics) M.Sc. (Agriculture) LL.M M.Sc. Bioinformatics Master of Library and Information Science Doctoral Programmes Ph.D. in Computer Application Ph.D (Law) Ph.D. in CSE Ph.D. in ECE Ph.D. in ME Ph.D. in EE Ph.D. in CE Ph.D. in Biotechnology Ph.D. in Microbiology Ph.D. in Physics Ph.D. in Chemistry Ph.D. in English Ph.D. in Mathematics Ph.D. in Pharmacy Ph.D in Management Ph.D in Education Ph.D Agriculture Diploma Courses D. Pharm Diploma (Electronics & Communication) Diploma (Civil Engineering) Diploma (Computer Science Engineering) Diploma (Electrical Engineering) Diploma (Mechanical Engineering) Diploma (Chemical Engineering) Diploma in Library and Information Science ADMISSIONS Overview Eligibility Criteria Admission Procedure GLAET Syllabus & Sample Paper Counselling Offices Admission Open for PhD (Session 2025-26)-odd Semester GLAET Result PhD Entrance Result for Academic Year 2025-26 (Session July-2025) Fee Structure Scholarship FAQs Fee Refund Policy Get In Touch Download Forms Admission Brochure International Admissions About GLA About India Local Attractions FAQ and Guidelines Courses and Fee Structure International Scholarship Hostel and Mess Fee Refund Policy SAARC Country Candidates Scholarship Hostel and Mess Fees Unlock your Career Goals Scholarship Financial Aid Education Loan GLAET CAMPUS LIFE A Bustling Campus Environment 70+ Clubs Shopping Mall Fests & Events Sports Skill Enhancement Overview Academic Facilities Lecture Theaters Conference Halls Laboratories Libraries Facility for e-Content Campus Facility Aarogyam (Medical Facilities) Hostel Cafeteria Transport Facility Happenings Media Coverage Photo Gallery Video Gallery Events TEDxGLAU Workshops Guest Lectures Sports Facility Sports Overview In Door Games Sports Ground Annual Sports Sports & Cultural Events ASC Other Facilities E-Content Student Ambassadors National Cadet Corps (NCC) Society Rules and Regulations Student Clubs Student Council PLACEMENTS Overview The Team Placement Policy Industry-Academia Partnership Industrial Visits Our Recruiters Corporate Testimonials Alumni Testimonials Helpline and FAQs Get in Touch Alumni Job Opportunities by Alumni GLA Discussion Forum Alumni of GLA Alumni Working Abroad Alumni Testimonials Alumni Portal Get In Touch RESEARCH AND INNOVATION RESEARCH Research Hierarchy Research Scholars Research Centres Research Publications Patents MoU Sponsored Project Consultancy Research Blog FAQ'S Technology Transfer Consultancy Policy (Revised) Research Promotion Policy (Revised) & IPR Policy Research Ordinance List of beneficiaries for National/International recognition Glimpses of Award Ceremony INNOVATION Incubation Entrepreneurship Cell NewGen IEDC Innovation Cell NISP Implementation Journal Research Journal A Research-Intensive Environment 750+ Patents Published 10000+ Publications 14 Research Centres 75+ Patents Granted Admission Open Admission Helpline - 9027068068 WHY GLA? RESEARCH ALUMNI CONTACT US (current) × Happenings Media Coverage Photo Gallery Video Gallery Events TEDxGLAU Workshops Guest Lectures NIRF Why GLA? Research Alumni Careers Contact Us Admission Query ✖ Admission Inquiry Select Campus* Mathura Campus Noida Campus Course* Select Branch* Select State* Andaman & Nicobar Andhra Pradesh Arunachal Pradesh Assam Bihar Chandigarh Chhatisgarh Dadra & Nagar Haveli Daman & Diu Delhi Goa Gujarat Haryana Himachal Pradesh Jammu & Kashmir Jharkhand Karnataka Kerala Lakshadweep Madhya Pradesh Maharashtra Manipur Meghalaya Mizoram Nagaland Orissa Puducherry Punjab Rajasthan Sikkim Tamil Nadu Tripura Uttar Pradesh Uttarakhand West Bengal Select City* Query Type* Need for counselling call Other I consent to receive SMS, email, and WhatsApp messages and agree to the terms and conditions. Legacy A Legacy of Educational Excellence 86% Overall Placement in Past 5 Years 46,000+ Alumni Settled across the Globe 700+ Faculty Members from Global Institutions 23,000+ Students Enrolled in Different Courses Innovation Think Beyond Innovation in a Research-Driven Environment Innovation Know More Solar Energy Research Centre I & II Know More All Terrain Vehicle Designed by GLAdiators Know More Centre for Automation Know More CNC Lathe Machine Know More CSED 4.0 Facility Know More CSED Lab Know More E-Rick Innovated by GLAdiators Know More GLAdiators designing ATV Know More Go Karting Car Designed by GLAdiators Know More Rockwell Automation Lab Know More Spot Welding Machine Know More Previous Next 650 + Patents Published 14 Research Centres 9000 + Publications 74 + Patents Granted Programme Our Futuristic Programs Graduate Courses Post Graduate Courses Doctoral Programme Diploma Courses Graduate Courses B.Tech (Computer Science & Engineering) Know More B. Tech (Hons.) B.Tech (Hons.) CSE (Specialization in AI and Analytics) in Partnership with Intel and NEC Know More B.Tech Electronics & Communication Engineering Know More B.Tech EC (With Minor in Computer Science) Know More B.Tech Electrical & Electronics Engineering Know More B.Tech (Electrical Engineering) Know More B.Tech Electrical Engineering (With Specialization in Electric Vehicle Technology) Know More BBA (Management Science) Know More B. Pharm Know More B.A. English / B.A. English (Hons./ By Research) Know More BCA with Specialization in Data Science Know More Post Graduate Courses M.Tech (Electronics and Communications Engineering) Know More M. Pharm (Pharmaceutics) Know More M. Pharm (Pharmacology) Know More MCA Know More PG Diploma in Digital Marketing Know More Doctoral Programme Ph.D (Electronics & Communications Engineering) Know More Ph.D (Electrical Engineering) Know More Ph.D (Biotechnology) Know More Ph.D (Pharmacy) Know More Diploma Courses D. Pharm Know More Diploma (Electronics & Communication) Know More Diploma (Civil Engineering) Know More Diploma (Computer Science Engineering) Know More How To Apply Admission Dates Download Brochure Speak To Counsellor Frequently Asked Questions Placements Top Placement Getters 2024 View More > ANJALI VISHWAKARMA Offered by Saint Gobain India Pvt. Ltd. ANSHIKA Offered by Padmini VNA Mechatronics BHOOMIKA MEHRA Offered by Amazon.In DIVYANSHI VARSHNEY Offered by Microsoft Corporation India FALGUNI KHANDELWAL Offered by Cmr Green Technologies Limited KARTIKEY VARSHNEY Offered by Gemini Solution Pvt. Ltd. SHREYA GUPTA Offered by Josh Technology Group SHYAMA AGRAWAL Offered by Jp Morgan Chase India Pvt. Ltd. TAMAN GARG Offered by Jsw Group PRACHI VISHWAKARMA Offered by Isgec Heavy Engineering Ltd PRIYANSHI AGRAWAL Offered by Capgemini Consulting India (P) Ltd. KHUSHI VARSHNEY Offered by Edunext Technologies Pvt Ltd. AKRATI RATHORE Offered by Meridian Solutions Private Limited SHUBH CHATURVEDI Offered by Pronnel VAISHNAVI GOYAL Offered by Edgene Biomed VISHAKHA SINGHAL Offered by Trijal Electrikals Pvt. Ltd. 3000 + Placement Offers for Previous Batch 60 LPA Highest CTC by Microsoft 500 + Global Recruiters from Diverse Domains 6.3 LPA Overall Average CTC Achievers Achievers At GLA University, we are proud of our students for achieving top positions in public, private and corporate sector. Aashish Bansal Engineering Group Supervisor, Bechtel India Pvt. Ltd. > Sadhvi Saxena Associate Manager (Business Transformation), Accenture Operations > Prankur Chaturvedi Assistant Manager, KPMG > Sanchit Kumar Garg Assistant Director General, Ministry of Communication > Awards & Accolades Awards & Accolades The educational excellence of GLA University has been identified by the most prestigious national bodies. # 1 Ranked #1 in UP amongst Best Private Universities in 2020 by Dainik Jagaran # 2 Ranked #2 in UP & #7 in India amongst all private B-Schools Ranking 2021 by TimesBschool # 3 Ranked #1 in UP amongst Best Private Universities in 2020 by Dainik Jagaran # 4 Ranked #2 in UP & #7 in India amongst all private B-Schools Ranking 2021 by TimesBschool Previous Next Alumni GLA Alumni GLA University testifies its excellence with some of the inspirational success stories of our alumni. Palak Agrawal VMware 19.30 LPA Package by VMware I had always heard about the amazing hostel stories and thanks to GLA for giving me some unforgettable hostel memories. The home-like environment and tongue-tickling food in the mess make the stay easy and comfortable. My memories overweighed my luggage.The excellent learning at GLA helped me get placed in the technical team of VMware with a whopping package of Rs 19.3 LPA. Our Gallery View More > Upcoming Events ANNUAL SUMMIT LEADERSHIP 2025 13 Dec 2025 > GLA University 17km Stone, NH-19, Mathura-Delhi Road P.O. Chaumuhan, Mathura-281 406 (U.P.) India Contact Us +91-5662-250900 , 250909 , 241489 , +91-9927064017 Email: [email protected] Admission Helpline Click here to call our counsellor in your city. Helpline No. 9027068068 Why GLA University About GLA University Rankings Faculty Alumni Infrastructure Testimonials Academic Ordinance Media News Events Workshops Convocation Photo Gallery Video Gallery Downloads Other Links Examinations Contact Us Careers Academic Calendar Staff Login Student Login Academic Bank of Credits(ABC) National Academic Depository(NAD) Cells at GLAU NIRF IQAC IDP Blog Public Self Disclosure Terms & Conditions Privacy Policy Disclaimer Sitemap Admissions Admission Process - 2025 Graduate Courses Post Graduate Courses Doctoral Programmes Diploma Courses Certificate Courses FAQs How to Apply Apply Now Social Link © 2025 - All Rights Reserved. Website Designed and Developed by Sterco Digitex Admission Helpline 9027068068"}
{"url": "https://www.gla.ac.in/alumni-testimonial", "title": "Alumni Testimonials  - GLA University Mathura", "text": "Alumni Testimonials - GLA University Mathura Admission Open Rolling Advertisement Student Examination IQAC NRPP Careers ICPC Admission Helpline 9027068068 ABOUT US Who We Are About GLA University Government Recognition Academic and Industry Collaborations Awards and Achievements Code of Conduct and Ethics Policy Best Educational 110-Acre Campus 20-Acre Sports Facility 19 Modern Hostels 19 Modern Hostels Leadership Team Chancellor Vice Chancellor Pro Vice-Chancellor, Greater Noida Campus Registrar Dean Academic Affairs Dean Research & Development Dean Student's Welfare Dean Consultancy Dean, International Relations and Academic Collaborations Controller of Examinations Governing Body Executive Council Academic Council Administration Corporate Advisory Board CSR Activities PraYaas National Service Scheme Cell Udaan Ujjwal Braj Aashayein ACADEMICS Institutes Engineering & Technology Business Management Pharmaceutical Research Applied Sciences & Humanities Legal Studies and Research University Polytechnic Faculty of Education Centre for Distance and Online Education Centre for Vaccines and Diagnostic Research Courses Graduate Courses Post Graduate Courses Doctoral Programme Diploma Courses Departments CSED – Industry 4.0 Facility Social Science & Humanities Computer Engineering & Applications Electrical Engineering Electronics & Communication Mechanical Engineering Civil Engineering English Physics Chemistry Mathematics Biotechnology Library & Information Science Faculty of Agricultural Sciences Centers Indian Knowledge System Examinations and Results Academic Ordinance Results Students Anti Ragging Committee HELP-LINE Anti Ragging Committee Hostel Rules Student Grievance Redressal Committee (SGRC) Grievance Cell Proctorial Board NEP - 2020 Faculty Visiting faculty Distinguished faculty Library Academic Calendar University Holidays Faculty and staff members grievance redressel Committee (FSGRC) NRPP 70+ Multidisciplinary Programs Flexible Multidisciplinary Programs E-Content Facility Experiential Project Based Education COURSES Graduate Courses Post Graduate Courses Doctoral Programme Diploma Courses B.Tech Courses B.Tech in CSE B. Tech (Hons.) CSE (Spec. in AI & Analytics) B.Tech in ECE B.Tech CSE (Specialization in AIML) B.Tech EC (Minor in CS) B.Tech EC (Specialization in VLSI) B.Tech in Electronics and Computer Engineering B.Tech in EEE B.Tech in EE B.Tech EE (Minor in CS) B.Tech EE (EV Technology) B.Tech in ME B.Tech ME (Minor in CS) B.Tech ME (Automobile) B.Tech ME (Mechatronics) B.Tech in CE B.Tech in Biotech B. Tech ME in Smart Manufacturing B. Tech Lateral Entry EC ME CSE CE EE B.Tech EE (EV Technology) B.Tech in ECE - LE B.Tech in EEE B.Tech in Biotech B.Tech EC (Minor in CS) B.Tech EC (Specialization in VLSI) Other UG Courses BCA/ BCA (Hons./ By Research) BBA/ BBA (Hons./ By Rsearch) BBA (Management Sciences) B. Pharm B. Pharm (Lateral Entry) BBA (Family Business) B.Com/ B.Com (H/ By Research) B.A. Eco/ B.A. Eco (H/ By Research) B.A. Eng/ B.A. Eng (H/ By Research) BCA Data Science B.Sc. Biotech/ B.Sc. Biotech (H/ By Research) B.Sc. (Hons.) Agriculture B.Sc. Chem/ B.Sc. Chem (H/ By Research) B.Sc. Physics/ B.Sc. Physics (H/ By Research) B.Sc. Maths/ B.Sc. Maths(H./ BY Research) in DS BBA LLB (Hons.) B.A. LLB (Hons.) B.Ed. B. Com Global Accounting In Association with CIMA BCA in Digital Marketing Bachelor of Library and Information Science Postgraduate Courses M. Tech in ECE M. Tech in EE M. Tech in CSE M. Tech in CE (Structural Engineering) M. Tech ME (Design) M.Tech ME (Production) M. Tech (Energy Systems) Diploma Courses PG Diploma in CTS PG Diploma in AIML PG Diploma in DM PG Diploma in HA PG Diploma in Hospital and HM PG Diploma in CM PG Diploma in Banking and FSM PG Diploma in Web and AD PG Diploma in IoT Certificate Program in Banking and WM Other PG Courses M. Pharm (Pharmaceutics) M. Pharm (Pharmacology) MBA (Hons.) MBA MBA (Logistics and Supply Chain Management) MBA (Financial Markets & Banking) MBA (Business Analytics) MCA M.Sc. (Biotech) M.Sc (Microbiology) M.Sc. (Chemistry) M.Sc. (Physics) M.Sc. (Mathematics) M.Sc. (Agriculture) LL.M M.Sc. Bioinformatics Master of Library and Information Science Doctoral Programmes Ph.D. in Computer Application Ph.D (Law) Ph.D. in CSE Ph.D. in ECE Ph.D. in ME Ph.D. in EE Ph.D. in CE Ph.D. in Biotechnology Ph.D. in Microbiology Ph.D. in Physics Ph.D. in Chemistry Ph.D. in English Ph.D. in Mathematics Ph.D. in Pharmacy Ph.D in Management Ph.D in Education Ph.D Agriculture Diploma Courses D. Pharm Diploma (Electronics & Communication) Diploma (Civil Engineering) Diploma (Computer Science Engineering) Diploma (Electrical Engineering) Diploma (Mechanical Engineering) Diploma (Chemical Engineering) Diploma in Library and Information Science ADMISSIONS Overview Eligibility Criteria Admission Procedure GLAET Syllabus & Sample Paper Counselling Offices Admission Open for PhD (Session 2025-26)-odd Semester GLAET Result PhD Entrance Result for Academic Year 2025-26 (Session July-2025) Fee Structure Scholarship FAQs Fee Refund Policy Get In Touch Download Forms Admission Brochure International Admissions About GLA About India Local Attractions FAQ and Guidelines Courses and Fee Structure International Scholarship Hostel and Mess Fee Refund Policy SAARC Country Candidates Scholarship Hostel and Mess Fees Unlock your Career Goals Scholarship Financial Aid Education Loan GLAET CAMPUS LIFE A Bustling Campus Environment 70+ Clubs Shopping Mall Fests & Events Sports Skill Enhancement Overview Academic Facilities Lecture Theaters Conference Halls Laboratories Libraries Facility for e-Content Campus Facility Aarogyam (Medical Facilities) Hostel Cafeteria Transport Facility Happenings Media Coverage Photo Gallery Video Gallery Events TEDxGLAU Workshops Guest Lectures Sports Facility Sports Overview In Door Games Sports Ground Annual Sports Sports & Cultural Events ASC Other Facilities E-Content Student Ambassadors National Cadet Corps (NCC) Society Rules and Regulations Student Clubs Student Council PLACEMENTS Overview The Team Placement Policy Industry-Academia Partnership Industrial Visits Our Recruiters Corporate Testimonials Alumni Testimonials Helpline and FAQs Get in Touch Alumni Job Opportunities by Alumni GLA Discussion Forum Alumni of GLA Alumni Working Abroad Alumni Testimonials Alumni Portal Get In Touch RESEARCH AND INNOVATION RESEARCH Research Hierarchy Research Scholars Research Centres Research Publications Patents MoU Sponsored Project Consultancy Research Blog FAQ'S Technology Transfer Consultancy Policy (Revised) Research Promotion Policy (Revised) & IPR Policy Research Ordinance List of beneficiaries for National/International recognition Glimpses of Award Ceremony INNOVATION Incubation Entrepreneurship Cell NewGen IEDC Innovation Cell NISP Implementation Journal Research Journal A Research-Intensive Environment 750+ Patents Published 10000+ Publications 14 Research Centres 75+ Patents Granted Admission Open Admission Helpline - 9027068068 WHY GLA? RESEARCH ALUMNI CONTACT US (current) × Happenings Media Coverage Photo Gallery Video Gallery Events TEDxGLAU Workshops Guest Lectures NIRF Why GLA? Research Alumni Careers Contact Us Admission Query ✖ Admission Inquiry Select Campus* Mathura Campus Noida Campus Course* Select Branch* Select State* Andaman & Nicobar Andhra Pradesh Arunachal Pradesh Assam Bihar Chandigarh Chhatisgarh Dadra & Nagar Haveli Daman & Diu Delhi Goa Gujarat Haryana Himachal Pradesh Jammu & Kashmir Jharkhand Karnataka Kerala Lakshadweep Madhya Pradesh Maharashtra Manipur Meghalaya Mizoram Nagaland Orissa Puducherry Punjab Rajasthan Sikkim Tamil Nadu Tripura Uttar Pradesh Uttarakhand West Bengal Select City* Query Type* Need for counselling call Other I consent to receive SMS, email, and WhatsApp messages and agree to the terms and conditions. Testimonials Home Testimonials Alumni Students Corporate --Select Department-- Department of Computer Engineering & Applications Department of Electrical Engineering Department of Electronics & Communication Department of Mechanical Engineering Department of Civil Engineering Department of Mathematics Department of Biotechnology Pharmaceutical Research Himank Bansal Associate Software Engineer - Torry Harris Business Solution Batch - 2013-17, B.Tech CSE Vansh Mehrotra Associate Software Engineer - Accenture Batch - 2013-16, BCA Yadvendra Singh Bhadauria Executive Officer - FlexFilms Europa Batch - 2013-17, B.Tech in Mechanical Engineering Apoorva Mishra Quality Analyst - InnovationM SHIVA MISHRA Placed in Johnson Controls (India) Pvt Ltd , Mumbai - Dip. - EE 2017-2018 HIMANSHU CHAUDHARY Kirloskar Brothers Ltd - Dip. - ME 2017-2018 SANJEEV UPADHYAY Placed in Bridgecon India Pvt. Ltd., New Delhi - Dip. - CE 2017-2018 SUSHANT MISHRA Placed in Balkrishnan Industries Ltd. (BKT Tyres), Mumbai - Dip. - EE 2017-2018 SACHIN VERMA Placed in Uflex Ltd., Poland - Dip. - ME 2016-2017 PRASHANT KUMAR UPADHYAY Placed in Uniparts India Ltd, Noida - Dip. - ME 2017-2018 Arjun Singh Scientist “B”/System Analyst, National Informatics Center, Ministry of Comm. & IT, Govt. of India Ajay Kumar Apollo Hospital D.PHARM-2016 Vaibhav Kulshrestha Manager Sales Aditya Kothari Design Engineer-Rail Track & Alignment - Parsons Corporation B. Tech - Civil - 2017 Prakhar Srivastava Executive TCIL, Kolkata B. Tech - ME - 2015 Sumit Gupta EC- Terminal Manager - AAI B. Tech - ECE - 2006 « Previous 1 2 3 4 5 » Next GLA University 17km Stone, NH-19, Mathura-Delhi Road P.O. Chaumuhan, Mathura-281 406 (U.P.) India Contact Us +91-5662-250900 , 250909 , 241489 , +91-9927064017 Email: [email protected] Admission Helpline Click here to call our counsellor in your city. Helpline No. 9027068068 Why GLA University About GLA University Rankings Faculty Alumni Infrastructure Testimonials Academic Ordinance Media News Events Workshops Convocation Photo Gallery Video Gallery Downloads Other Links Examinations Contact Us Careers Academic Calendar Staff Login Student Login Academic Bank of Credits(ABC) National Academic Depository(NAD) Cells at GLAU NIRF IQAC IDP Blog Public Self Disclosure Terms & Conditions Privacy Policy Disclaimer Sitemap Admissions Admission Process - 2025 Graduate Courses Post Graduate Courses Doctoral Programmes Diploma Courses Certificate Courses FAQs How to Apply Apply Now Social Link © 2025 - All Rights Reserved. Website Designed and Developed by Sterco Digitex Admission Helpline 9027068068"}
{"url": "https://www.gla.ac.in/apply-now", "title": "", "text": "Admission Open Rolling Advertisement Student Examination IQAC NRPP Careers ICPC Admission Helpline 9027068068 ABOUT US Who We Are About GLA University Government Recognition Academic and Industry Collaborations Awards and Achievements Code of Conduct and Ethics Policy Best Educational 110-Acre Campus 20-Acre Sports Facility 19 Modern Hostels 19 Modern Hostels Leadership Team Chancellor Vice Chancellor Pro Vice-Chancellor, Greater Noida Campus Registrar Dean Academic Affairs Dean Research & Development Dean Student's Welfare Dean Consultancy Dean, International Relations and Academic Collaborations Controller of Examinations Governing Body Executive Council Academic Council Administration Corporate Advisory Board CSR Activities PraYaas National Service Scheme Cell Udaan Ujjwal Braj Aashayein ACADEMICS Institutes Engineering & Technology Business Management Pharmaceutical Research Applied Sciences & Humanities Legal Studies and Research University Polytechnic Faculty of Education Centre for Distance and Online Education Centre for Vaccines and Diagnostic Research Courses Graduate Courses Post Graduate Courses Doctoral Programme Diploma Courses Departments CSED – Industry 4.0 Facility Social Science & Humanities Computer Engineering & Applications Electrical Engineering Electronics & Communication Mechanical Engineering Civil Engineering English Physics Chemistry Mathematics Biotechnology Library & Information Science Faculty of Agricultural Sciences Centers Indian Knowledge System Examinations and Results Academic Ordinance Results Students Anti Ragging Committee HELP-LINE Anti Ragging Committee Hostel Rules Student Grievance Redressal Committee (SGRC) Grievance Cell Proctorial Board NEP - 2020 Faculty Visiting faculty Distinguished faculty Library Academic Calendar University Holidays Faculty and staff members grievance redressel Committee (FSGRC) NRPP 70+ Multidisciplinary Programs Flexible Multidisciplinary Programs E-Content Facility Experiential Project Based Education COURSES Graduate Courses Post Graduate Courses Doctoral Programme Diploma Courses B.Tech Courses B.Tech in CSE B. Tech (Hons.) CSE (Spec. in AI & Analytics) B.Tech in ECE B.Tech CSE (Specialization in AIML) B.Tech EC (Minor in CS) B.Tech EC (Specialization in VLSI) B.Tech in Electronics and Computer Engineering B.Tech in EEE B.Tech in EE B.Tech EE (Minor in CS) B.Tech EE (EV Technology) B.Tech in ME B.Tech ME (Minor in CS) B.Tech ME (Automobile) B.Tech ME (Mechatronics) B.Tech in CE B.Tech in Biotech B. Tech ME in Smart Manufacturing B. Tech Lateral Entry EC ME CSE CE EE B.Tech EE (EV Technology) B.Tech in ECE - LE B.Tech in EEE B.Tech in Biotech B.Tech EC (Minor in CS) B.Tech EC (Specialization in VLSI) Other UG Courses BCA/ BCA (Hons./ By Research) BBA/ BBA (Hons./ By Rsearch) BBA (Management Sciences) B. Pharm B. Pharm (Lateral Entry) BBA (Family Business) B.Com/ B.Com (H/ By Research) B.A. Eco/ B.A. Eco (H/ By Research) B.A. Eng/ B.A. Eng (H/ By Research) BCA Data Science B.Sc. Biotech/ B.Sc. Biotech (H/ By Research) B.Sc. (Hons.) Agriculture B.Sc. Chem/ B.Sc. Chem (H/ By Research) B.Sc. Physics/ B.Sc. Physics (H/ By Research) B.Sc. Maths/ B.Sc. Maths(H./ BY Research) in DS BBA LLB (Hons.) B.A. LLB (Hons.) B.Ed. B. Com Global Accounting In Association with CIMA BCA in Digital Marketing Bachelor of Library and Information Science Postgraduate Courses M. Tech in ECE M. Tech in EE M. Tech in CSE M. Tech in CE (Structural Engineering) M. Tech ME (Design) M.Tech ME (Production) M. Tech (Energy Systems) Diploma Courses PG Diploma in CTS PG Diploma in AIML PG Diploma in DM PG Diploma in HA PG Diploma in Hospital and HM PG Diploma in CM PG Diploma in Banking and FSM PG Diploma in Web and AD PG Diploma in IoT Certificate Program in Banking and WM Other PG Courses M. Pharm (Pharmaceutics) M. Pharm (Pharmacology) MBA (Hons.) MBA MBA (Logistics and Supply Chain Management) MBA (Financial Markets & Banking) MBA (Business Analytics) MCA M.Sc. (Biotech) M.Sc (Microbiology) M.Sc. (Chemistry) M.Sc. (Physics) M.Sc. (Mathematics) M.Sc. (Agriculture) LL.M M.Sc. Bioinformatics Master of Library and Information Science Doctoral Programmes Ph.D. in Computer Application Ph.D (Law) Ph.D. in CSE Ph.D. in ECE Ph.D. in ME Ph.D. in EE Ph.D. in CE Ph.D. in Biotechnology Ph.D. in Microbiology Ph.D. in Physics Ph.D. in Chemistry Ph.D. in English Ph.D. in Mathematics Ph.D. in Pharmacy Ph.D in Management Ph.D in Education Ph.D Agriculture Diploma Courses D. Pharm Diploma (Electronics & Communication) Diploma (Civil Engineering) Diploma (Computer Science Engineering) Diploma (Electrical Engineering) Diploma (Mechanical Engineering) Diploma (Chemical Engineering) Diploma in Library and Information Science ADMISSIONS Overview Eligibility Criteria Admission Procedure GLAET Syllabus & Sample Paper Counselling Offices Admission Open for PhD (Session 2025-26)-odd Semester GLAET Result PhD Entrance Result for Academic Year 2025-26 (Session July-2025) Fee Structure Scholarship FAQs Fee Refund Policy Get In Touch Download Forms Admission Brochure International Admissions About GLA About India Local Attractions FAQ and Guidelines Courses and Fee Structure International Scholarship Hostel and Mess Fee Refund Policy SAARC Country Candidates Scholarship Hostel and Mess Fees Unlock your Career Goals Scholarship Financial Aid Education Loan GLAET CAMPUS LIFE A Bustling Campus Environment 70+ Clubs Shopping Mall Fests & Events Sports Skill Enhancement Overview Academic Facilities Lecture Theaters Conference Halls Laboratories Libraries Facility for e-Content Campus Facility Aarogyam (Medical Facilities) Hostel Cafeteria Transport Facility Happenings Media Coverage Photo Gallery Video Gallery Events TEDxGLAU Workshops Guest Lectures Sports Facility Sports Overview In Door Games Sports Ground Annual Sports Sports & Cultural Events ASC Other Facilities E-Content Student Ambassadors National Cadet Corps (NCC) Society Rules and Regulations Student Clubs Student Council PLACEMENTS Overview The Team Placement Policy Industry-Academia Partnership Industrial Visits Our Recruiters Corporate Testimonials Alumni Testimonials Helpline and FAQs Get in Touch Alumni Job Opportunities by Alumni GLA Discussion Forum Alumni of GLA Alumni Working Abroad Alumni Testimonials Alumni Portal Get In Touch RESEARCH AND INNOVATION RESEARCH Research Hierarchy Research Scholars Research Centres Research Publications Patents MoU Sponsored Project Consultancy Research Blog FAQ'S Technology Transfer Consultancy Policy (Revised) Research Promotion Policy (Revised) & IPR Policy Research Ordinance List of beneficiaries for National/International recognition Glimpses of Award Ceremony INNOVATION Incubation Entrepreneurship Cell NewGen IEDC Innovation Cell NISP Implementation Journal Research Journal A Research-Intensive Environment 750+ Patents Published 10000+ Publications 14 Research Centres 75+ Patents Granted Admission Open Admission Helpline - 9027068068 WHY GLA? RESEARCH ALUMNI CONTACT US (current) × Happenings Media Coverage Photo Gallery Video Gallery Events TEDxGLAU Workshops Guest Lectures NIRF Why GLA? Research Alumni Careers Contact Us Admission Query ✖ Admission Inquiry Select Campus* Mathura Campus Noida Campus Course* Select Branch* Select State* Andaman & Nicobar Andhra Pradesh Arunachal Pradesh Assam Bihar Chandigarh Chhatisgarh Dadra & Nagar Haveli Daman & Diu Delhi Goa Gujarat Haryana Himachal Pradesh Jammu & Kashmir Jharkhand Karnataka Kerala Lakshadweep Madhya Pradesh Maharashtra Manipur Meghalaya Mizoram Nagaland Orissa Puducherry Punjab Rajasthan Sikkim Tamil Nadu Tripura Uttar Pradesh Uttarakhand West Bengal Select City* Query Type* Need for counselling call Other I consent to receive SMS, email, and WhatsApp messages and agree to the terms and conditions. Home Course* B Pharm (Lateral Entry) B. Pharm. B. Sc. (Hons.) B. Tech (Lateral Entry) B. Tech. B. Tech. B.Com. B.Sc. Bachelor of Arts Bachelor of Arts LLB (Hons.). Bachelor of Library and Information Science BBA BBA BBA (Family Business) BBA LLB (Hons.) BBA Management Science BCA BCA BCA (Data Science) D. Pharm. Diploma in Engineering Diploma in Engineering (Lateral Entry) Diploma in Library and Information Science LL.M M Pharm M. Sc. M. Tech M.Sc. Biotechnology M.Sc. Microbiology Master of Arts Master of Business Administration (Hons.) Master of Library and Information Science MBA MBA MBA (Financial Markets and Banking) MBA (Logistics and Supply Chain Management) MBA - Business Analytics Ph.D. Pharm D Select Branch Select City* Select State* Andaman & Nicobar Andhra Pradesh Arunachal Pradesh Assam Barisal Bihar Biratnagar Birendranagar Butwal Chandigarh Chhatisgarh Chittagong Dadra & Nagar Haveli Daman & Diu Delhi Dhaka Goa Godawari Gujarat Haryana Hetauda Himachal Pradesh Jammu & Kashmir Janakpur Jharkhand Karnataka Kerala Khulna Lakshadweep Madhya Pradesh Maharashtra Manipur Meghalaya Mizoram Mymensingh Nagaland Orissa Pokhara Puducherry Punjab Rajasthan Rajshahi Rangpur Sikkim Sylhet Tamil Nadu Tripura Uttar Pradesh Uttarakhand West Bengal Submit GLA University 17km Stone, NH-19, Mathura-Delhi Road P.O. Chaumuhan, Mathura-281 406 (U.P.) India Contact Us +91-5662-250900 , 250909 , 241489 , +91-9927064017 Email: [email protected] Admission Helpline Click here to call our counsellor in your city. Helpline No. 9027068068 Why GLA University About GLA University Rankings Faculty Alumni Infrastructure Testimonials Academic Ordinance Media News Events Workshops Convocation Photo Gallery Video Gallery Downloads Other Links Examinations Contact Us Careers Academic Calendar Staff Login Student Login Academic Bank of Credits(ABC) National Academic Depository(NAD) Cells at GLAU NIRF IQAC IDP Blog Public Self Disclosure Terms & Conditions Privacy Policy Disclaimer Sitemap Admissions Admission Process - 2025 Graduate Courses Post Graduate Courses Doctoral Programmes Diploma Courses Certificate Courses FAQs How to Apply Apply Now Social Link © 2025 - All Rights Reserved. Website Designed and Developed by Sterco Digitex Admission Helpline 9027068068"}
{"url": "https://www.gla.ac.in/alumni", "title": "Alumni – GLA University Mathura", "text": "Alumni – GLA University Mathura Admission Open Rolling Advertisement Student Examination IQAC NRPP Careers ICPC Admission Helpline 9027068068 ABOUT US Who We Are About GLA University Government Recognition Academic and Industry Collaborations Awards and Achievements Code of Conduct and Ethics Policy Best Educational 110-Acre Campus 20-Acre Sports Facility 19 Modern Hostels 19 Modern Hostels Leadership Team Chancellor Vice Chancellor Pro Vice-Chancellor, Greater Noida Campus Registrar Dean Academic Affairs Dean Research & Development Dean Student's Welfare Dean Consultancy Dean, International Relations and Academic Collaborations Controller of Examinations Governing Body Executive Council Academic Council Administration Corporate Advisory Board CSR Activities PraYaas National Service Scheme Cell Udaan Ujjwal Braj Aashayein ACADEMICS Institutes Engineering & Technology Business Management Pharmaceutical Research Applied Sciences & Humanities Legal Studies and Research University Polytechnic Faculty of Education Centre for Distance and Online Education Centre for Vaccines and Diagnostic Research Courses Graduate Courses Post Graduate Courses Doctoral Programme Diploma Courses Departments CSED – Industry 4.0 Facility Social Science & Humanities Computer Engineering & Applications Electrical Engineering Electronics & Communication Mechanical Engineering Civil Engineering English Physics Chemistry Mathematics Biotechnology Library & Information Science Faculty of Agricultural Sciences Centers Indian Knowledge System Examinations and Results Academic Ordinance Results Students Anti Ragging Committee HELP-LINE Anti Ragging Committee Hostel Rules Student Grievance Redressal Committee (SGRC) Grievance Cell Proctorial Board NEP - 2020 Faculty Visiting faculty Distinguished faculty Library Academic Calendar University Holidays Faculty and staff members grievance redressel Committee (FSGRC) NRPP 70+ Multidisciplinary Programs Flexible Multidisciplinary Programs E-Content Facility Experiential Project Based Education COURSES Graduate Courses Post Graduate Courses Doctoral Programme Diploma Courses B.Tech Courses B.Tech in CSE B. Tech (Hons.) CSE (Spec. in AI & Analytics) B.Tech in ECE B.Tech CSE (Specialization in AIML) B.Tech EC (Minor in CS) B.Tech EC (Specialization in VLSI) B.Tech in Electronics and Computer Engineering B.Tech in EEE B.Tech in EE B.Tech EE (Minor in CS) B.Tech EE (EV Technology) B.Tech in ME B.Tech ME (Minor in CS) B.Tech ME (Automobile) B.Tech ME (Mechatronics) B.Tech in CE B.Tech in Biotech B. Tech ME in Smart Manufacturing B. Tech Lateral Entry EC ME CSE CE EE B.Tech EE (EV Technology) B.Tech in ECE - LE B.Tech in EEE B.Tech in Biotech B.Tech EC (Minor in CS) B.Tech EC (Specialization in VLSI) Other UG Courses BCA/ BCA (Hons./ By Research) BBA/ BBA (Hons./ By Rsearch) BBA (Management Sciences) B. Pharm B. Pharm (Lateral Entry) BBA (Family Business) B.Com/ B.Com (H/ By Research) B.A. Eco/ B.A. Eco (H/ By Research) B.A. Eng/ B.A. Eng (H/ By Research) BCA Data Science B.Sc. Biotech/ B.Sc. Biotech (H/ By Research) B.Sc. (Hons.) Agriculture B.Sc. Chem/ B.Sc. Chem (H/ By Research) B.Sc. Physics/ B.Sc. Physics (H/ By Research) B.Sc. Maths/ B.Sc. Maths(H./ BY Research) in DS BBA LLB (Hons.) B.A. LLB (Hons.) B.Ed. B. Com Global Accounting In Association with CIMA BCA in Digital Marketing Bachelor of Library and Information Science Postgraduate Courses M. Tech in ECE M. Tech in EE M. Tech in CSE M. Tech in CE (Structural Engineering) M. Tech ME (Design) M.Tech ME (Production) M. Tech (Energy Systems) Diploma Courses PG Diploma in CTS PG Diploma in AIML PG Diploma in DM PG Diploma in HA PG Diploma in Hospital and HM PG Diploma in CM PG Diploma in Banking and FSM PG Diploma in Web and AD PG Diploma in IoT Certificate Program in Banking and WM Other PG Courses M. Pharm (Pharmaceutics) M. Pharm (Pharmacology) MBA (Hons.) MBA MBA (Logistics and Supply Chain Management) MBA (Financial Markets & Banking) MBA (Business Analytics) MCA M.Sc. (Biotech) M.Sc (Microbiology) M.Sc. (Chemistry) M.Sc. (Physics) M.Sc. (Mathematics) M.Sc. (Agriculture) LL.M M.Sc. Bioinformatics Master of Library and Information Science Doctoral Programmes Ph.D. in Computer Application Ph.D (Law) Ph.D. in CSE Ph.D. in ECE Ph.D. in ME Ph.D. in EE Ph.D. in CE Ph.D. in Biotechnology Ph.D. in Microbiology Ph.D. in Physics Ph.D. in Chemistry Ph.D. in English Ph.D. in Mathematics Ph.D. in Pharmacy Ph.D in Management Ph.D in Education Ph.D Agriculture Diploma Courses D. Pharm Diploma (Electronics & Communication) Diploma (Civil Engineering) Diploma (Computer Science Engineering) Diploma (Electrical Engineering) Diploma (Mechanical Engineering) Diploma (Chemical Engineering) Diploma in Library and Information Science ADMISSIONS Overview Eligibility Criteria Admission Procedure GLAET Syllabus & Sample Paper Counselling Offices Admission Open for PhD (Session 2025-26)-odd Semester GLAET Result PhD Entrance Result for Academic Year 2025-26 (Session July-2025) Fee Structure Scholarship FAQs Fee Refund Policy Get In Touch Download Forms Admission Brochure International Admissions About GLA About India Local Attractions FAQ and Guidelines Courses and Fee Structure International Scholarship Hostel and Mess Fee Refund Policy SAARC Country Candidates Scholarship Hostel and Mess Fees Unlock your Career Goals Scholarship Financial Aid Education Loan GLAET CAMPUS LIFE A Bustling Campus Environment 70+ Clubs Shopping Mall Fests & Events Sports Skill Enhancement Overview Academic Facilities Lecture Theaters Conference Halls Laboratories Libraries Facility for e-Content Campus Facility Aarogyam (Medical Facilities) Hostel Cafeteria Transport Facility Happenings Media Coverage Photo Gallery Video Gallery Events TEDxGLAU Workshops Guest Lectures Sports Facility Sports Overview In Door Games Sports Ground Annual Sports Sports & Cultural Events ASC Other Facilities E-Content Student Ambassadors National Cadet Corps (NCC) Society Rules and Regulations Student Clubs Student Council PLACEMENTS Overview The Team Placement Policy Industry-Academia Partnership Industrial Visits Our Recruiters Corporate Testimonials Alumni Testimonials Helpline and FAQs Get in Touch Alumni Job Opportunities by Alumni GLA Discussion Forum Alumni of GLA Alumni Working Abroad Alumni Testimonials Alumni Portal Get In Touch RESEARCH AND INNOVATION RESEARCH Research Hierarchy Research Scholars Research Centres Research Publications Patents MoU Sponsored Project Consultancy Research Blog FAQ'S Technology Transfer Consultancy Policy (Revised) Research Promotion Policy (Revised) & IPR Policy Research Ordinance List of beneficiaries for National/International recognition Glimpses of Award Ceremony INNOVATION Incubation Entrepreneurship Cell NewGen IEDC Innovation Cell NISP Implementation Journal Research Journal A Research-Intensive Environment 750+ Patents Published 10000+ Publications 14 Research Centres 75+ Patents Granted Admission Open Admission Helpline - 9027068068 WHY GLA? RESEARCH ALUMNI CONTACT US (current) × Happenings Media Coverage Photo Gallery Video Gallery Events TEDxGLAU Workshops Guest Lectures NIRF Why GLA? Research Alumni Careers Contact Us Admission Query ✖ Admission Inquiry Select Campus* Mathura Campus Noida Campus Course* Select Branch* Select State* Andaman & Nicobar Andhra Pradesh Arunachal Pradesh Assam Bihar Chandigarh Chhatisgarh Dadra & Nagar Haveli Daman & Diu Delhi Goa Gujarat Haryana Himachal Pradesh Jammu & Kashmir Jharkhand Karnataka Kerala Lakshadweep Madhya Pradesh Maharashtra Manipur Meghalaya Mizoram Nagaland Orissa Puducherry Punjab Rajasthan Sikkim Tamil Nadu Tripura Uttar Pradesh Uttarakhand West Bengal Select City* Query Type* Need for counselling call Other I consent to receive SMS, email, and WhatsApp messages and agree to the terms and conditions. ALUMNI Home ALUMNI The GLA University Alumni Association aims to foster long-lasting and strong ties between GLA and its alumni. Besides providing opportunities for interactions, the Training and Placement Cell provides special facilities like career options, new job openings, etc to the alumni We at GLA strongly believe that the alumni of our University are no less than our brand ambassadors and are a true reflection of the principles and values we stand for. Our association with our students lasts much beyond the tenure of their course at GLA and we feel extremely proud of the accolades they have won in the corporate world. The Alumni Association provides a wide range of, organizes reunion events and provides other benefits exclusively for the alumni. Every alumnus is given access to a unique email ID which helps them connect and network with other alumni. The GLA alumni has helped the legacy of this institution and done us proud with the accolades they have won in the corporate world. The Alumni Association provides the members of GLA a platform to stay connected. Alumni Association A/C details.. A/C Name – GLAITM ALUMNI ASSOCIATION Saving A/C no. – 199901000012094 Bank Name – Indian Overseas Bank Branch – GLA University Mathura IFSC Code – IOBA0001999 500 + Reputed MNCs 3000 + Placements offers (batch 2023) & still counting... 86 % Average placement over the past decade 55 LPA Highest Package Offfered GLA Discussion Forum Here is an online platform for current and former faculty members to connect and discuss. Welcome to the GLA Discussion Forum. Objectives of this forum are: A discussion platform for the faculty members (former and current). To discuss relevant topics and taking GLA University in the right direction. To discuss contemporary ideas and learnings which we, as the stakeholder of the GLA University, have for the advancement of GLA University as a destination for quality education. Create Account New Users First time users can click on the \"New Users\" button for Registration. (You will receive your login information within two working days.) Click Here Registered Users Already Registered Users can click click on the \"Registered Users\" for login to the Forum. click here Get In Touch Contact Person Prince Vohra Vice president - Alumni Relation +91-9878350051 +91-5662-250953 [email protected] Mr. Aasheesh Shukla Treasurer – Alumni Association +91-9412254460 [email protected] Postal Address GLA University 17km Stone, NH-19, Mathura-Delhi Road P.O. Chaumuhan, Mathura-281 406 (U.P.) INDIA +91-5662-250900, 908, 909 +91-5662-241687 [email protected] 6000+ GLAians Working Abroads with the most reputed companies Ravendra Singh Diploma - CE, Bgsb Concrete Solutions (P) Ltd, Package - 2.4 Lakh Batch - Diploma - CE Ravendra Singh Currently Working : Diploma - CE, Bgsb Concrete Solutions (P) Ltd, Package - 2.4 Lakh Batch : Diploma - CE X Karan Singh Diploma - CE, Bgsb Concrete Solutions (P) Ltd, Package - 2.4 Lakh Batch - Diploma - CE Karan Singh Currently Working : Diploma - CE, Bgsb Concrete Solutions (P) Ltd, Package - 2.4 Lakh Batch : Diploma - CE X Rupendra Kumar Diploma - CE, Chicago Bridge & Iron Company (Mcdermott), Package - 5 Lakh Batch - Diploma - CE Rupendra Kumar Currently Working : Diploma - CE, Chicago Bridge & Iron Company (Mcdermott), Package - 5 Lakh Batch : Diploma - CE X Saksham Singh Diploma - CE, Durafloor Concrete Solutions Llp, Package - 2.76 Lakh Batch - Diploma - CE Saksham Singh Currently Working : Diploma - CE, Durafloor Concrete Solutions Llp, Package - 2.76 Lakh Batch : Diploma - CE X Kamlendra Tripathi Scientist - India Space Research Organisation Batch - B. Tech - Electronics & Communication (2005) Kamlendra Tripathi Currently Working : Scientist - India Space Research Organisation Batch : B. Tech - Electronics & Communication (2005) GLA has been always a pivotal point in my career. I am blessed to had such an academic environment which helps me to realize my goal and to excel in my professional career. It is a perfect adobe for not only academic activity but for overall development of one's personality. Proud to be a GLAite. X Mr. Deepak Sanadhya Director - Blue Star InfoTech, South East Asia Batch - MBA (2004) Mr. Deepak Sanadhya Currently Working : Director - Blue Star InfoTech, South East Asia Batch : MBA (2004) Education is what transforms the life from dull lead to dazzling gold which not only shines in itself but brightens the beholder too…A successful MBA experience is not necessarily equated to the syllabus; it is the holistic exposure.\" My MBA degree has been instrumental in giving a kick-start to my career and thereof boosting it to a professional environment of Indian Job Market. The college and the faculty has furnished a full-fledged support in whatever way it could and even in all the initiatives taken by us. This was more than what we could have expected from a college for its student fraternity. The employers nowadays are looking for candidates with positive attitude and aptitude rather than big names in the background. What matters is 'How you do it' rather than 'What you do'. MBA program helps on 3 perspectives: Tools - Conceptual and quantitative skills to understand the dynamics of real business Soft Skills - Negotiations, Leadership, Strategy and Self-awareness that is absolutely vital to personal success Internalized Value - that comes from the confidence that this degree and the association brings in In my opinion, the biggest contribution that GLA did my life is to bring in self-belief “I CAN”. X Mr. Arjun Singh Scientist “B”/ System Analyst,Ministry of Comm. & of Information Technology Govt of India Batch - Mr. Arjun Singh Currently Working : Scientist “B”/ System Analyst,Ministry of Comm. & of Information Technology Govt of India Batch : It’s been a pleasure to be Part of MCA program at GLA, Mathura. I once again wants to live the glorious days with the most supportive and informative faculty. I got my life time friends here only and I surely want to name the Mentors of GLA like Mr Jalal our HOD, Mr Diwaker, Mr Ashish and most favorite Shalini madam. Management put’s all the effort for providing best environment and world class facilities like library, Computer Labs, Canteen, Hostel, etc. When it comes to judge our knowledge in the outer world, I always remember and thankful to Shri Neeraj Agarwal from the core of my heart. X Mr. Ashish Kaul Associate Director - SHRM Batch - B.Tech - Computer Science (2002) Mr. Ashish Kaul Currently Working : Associate Director - SHRM Batch : B.Tech - Computer Science (2002) Through experiences with incredibly supportive classmates, and professors who were nothing less than champions, I was challenged to discover methods and ways to look at innovative ideas and different perspective to jobs at hand. When I reflect on my four years in GLAITM and now GLA University in the BE Computer Science program, it is a no brainer that the experience not only gave me technical skills, but also prepared me in unpredictable ways for my career. My four years in GLA University have played a central role in my work and career. Apart from the technical skill that I learnt, the ability to collaborate in the face of conflict, logical mindset which is vital to decision making, planning, and powerful communication was encouraged and drilled into each one of us. These attributes and skills come in handy at later stages of anybody’s career progression. I was lucky to have my roots built in a very welcoming yet rigorous, environment at GLA University where I found myself able to communicate, innovate, and collaborate in ways that enabled me to build a successful career in consulting practice, and eventually to move up in the corporate ladder to be part of management. In my current role as Director at Jombay, I work with Business Heads, CHRO's and CEO's of many organisations and I draw every day on the dispositions I developed during my time at GLA. It was a wonderful time in my life, and the best educational experience I've had. Through experiences with incredibly supportive classmates, and professors who were nothing less than champions, I was challenged to discover methods and ways to look at innovative ideas and different perspective to jobs at hand. My four years in GLA University have played a central role in my work and career. Apart from the technical skill that I learnt, the ability to collaborate in the face of conflict, logical mindset which is vital to decision making, planning, and powerful communication was encouraged and drilled into each one of us. These attributes and skills come in handy at later stages of anybody’s career progression. I was lucky to have my roots built in a very welcoming yet rigorous, environment at GLA University where I found myself able to communicate, innovate, and collaborate in ways that enabled me to build a successful career in consulting practice, and eventually to move up in the corporate ladder to be part of management. In my current role as Director at Jombay, I work with Business Heads, CHRO’s and CEO’s of many organizations and I draw every day on the dispositions I developed during my time at GLA. It was a wonderful time in my life, and the best educational experience I’ve had. X Mr. Mohit Varshney Senior Data Analytics Specialist, Vodafone Group Services GmbH, Germany Batch - B. Tech - EC, 2009 Mr. Mohit Varshney Currently Working : Senior Data Analytics Specialist, Vodafone Group Services GmbH, Germany Batch : B. Tech - EC, 2009 A strong structure can only be built on a strong foundation. My years in GLA helped carving my foundation and thus I am, and I will always stand the test of time. X Mr. Vishal Vasudev Chief Technology Officer - Vinfotech Batch - B.Tech-CS Mr. Vishal Vasudev Currently Working : Chief Technology Officer - Vinfotech Batch : B.Tech-CS Have spent 4 golden years and has got me an identity, Something that has branded for life now. My love for the institute has always motivated to be associated and to contribute to the place where I have learnt everything. Institute has offered me everything that I could have demanded from it, from a great environment, Great education, Amazing peers, Smartest faculties, Great library and laboratories to a wonderful job. I would like to congratulate GLA for the success and will always be ready to be associated with this in my full capacity, I wish GLA the greatest success and I am sure soon it will not just number 1 in North India but number 1 in entire India. I have learnt from here. It has not just taught me basic engineering concepts but holistic learning which I believe is still guiding force in my life. X Mr. Ashish Kumar Mishra Sr. Manager –Exports (South East Asia) JK Tyre & Industries Ltd Batch - MBA – 2004 Mr. Ashish Kumar Mishra Currently Working : Sr. Manager –Exports (South East Asia) JK Tyre & Industries Ltd Batch : MBA – 2004 My main objective to study at GLA was \"to KNOW management;\" in other words, \"to earn management skills systematically\" and \"to gain insights on what essential problems are in today’s corporate world.\" In that sense, GLA’s MBA Program was truly satisfactory. I recall that the period spent here was one of the best periods of my life. I was very satisfied with the flexibility and variety of options available in choosing courses. There is a strong correlation between courses and they are well organized to focus on career objectives. The multicultural environment and capable FACULTY MEMBERS at GLA furnished me with a solid academic foundation and skills for my current responsibilities. I am so certain that I would not have been able to step up to my current job and future promotion prospects as well as the knowledge I gained from GLA I believe that GLA UNIVERSITY, MATHURA is really the best place to learn about the Management. With Sincerity/Self Honesty, Self Discipline, Maturity, Patience & dedication, we can achieve anything in this world and this I have learned in this University. X Mr. Kishore Kunal CEO - ANTECH Pvt. Ltd. Batch - B.Tech-CS Mr. Kishore Kunal Currently Working : CEO - ANTECH Pvt. Ltd. Batch : B.Tech-CS The time spent in GLA University has been blissful and gave me memories of a lifetime. In GLA i got a chance to learn something new everyday and i am still using what i learned there. I have done B.Tech from GLA and it makes me happy to say that i am a GLA alumnus. I have workedwith international operators like SK Telecom (South Korea) as well as NTT Docomo (Tokyo). I finished his MBA from Stuart School Of business USA and completed his M.Tech in Computer Science from South Korea under 100% scholarship scheme granted by Govt. of Korea. Currently I am CEO and co founder of Anchal Technovations Pvt LTD and imparting skill training to BPL rural students and ready them for Job under NSDC. X « Previous 1 2 3 » Next GLA University 17km Stone, NH-19, Mathura-Delhi Road P.O. Chaumuhan, Mathura-281 406 (U.P.) India Contact Us +91-5662-250900 , 250909 , 241489 , +91-9927064017 Email: [email protected] Admission Helpline Click here to call our counsellor in your city. Helpline No. 9027068068 Why GLA University About GLA University Rankings Faculty Alumni Infrastructure Testimonials Academic Ordinance Media News Events Workshops Convocation Photo Gallery Video Gallery Downloads Other Links Examinations Contact Us Careers Academic Calendar Staff Login Student Login Academic Bank of Credits(ABC) National Academic Depository(NAD) Cells at GLAU NIRF IQAC IDP Blog Public Self Disclosure Terms & Conditions Privacy Policy Disclaimer Sitemap Admissions Admission Process - 2025 Graduate Courses Post Graduate Courses Doctoral Programmes Diploma Courses Certificate Courses FAQs How to Apply Apply Now Social Link © 2025 - All Rights Reserved. Website Designed and Developed by Sterco Digitex Admission Helpline 9027068068"}
{"url": "https://www.gla.ac.in/testimonial-detail.aspx?mpgid=157&pgidtrail=157&testimonialid=131", "title": "Testimonials", "text": "Testimonials Admission Open Rolling Advertisement Student Examination IQAC NRPP Careers ICPC Admission Helpline 9027068068 ABOUT US Who We Are About GLA University Government Recognition Academic and Industry Collaborations Awards and Achievements Code of Conduct and Ethics Policy Best Educational 110-Acre Campus 20-Acre Sports Facility 19 Modern Hostels 19 Modern Hostels Leadership Team Chancellor Vice Chancellor Pro Vice-Chancellor, Greater Noida Campus Registrar Dean Academic Affairs Dean Research & Development Dean Student's Welfare Dean Consultancy Dean, International Relations and Academic Collaborations Controller of Examinations Governing Body Executive Council Academic Council Administration Corporate Advisory Board CSR Activities PraYaas National Service Scheme Cell Udaan Ujjwal Braj Aashayein ACADEMICS Institutes Engineering & Technology Business Management Pharmaceutical Research Applied Sciences & Humanities Legal Studies and Research University Polytechnic Faculty of Education Centre for Distance and Online Education Centre for Vaccines and Diagnostic Research Courses Graduate Courses Post Graduate Courses Doctoral Programme Diploma Courses Departments CSED – Industry 4.0 Facility Social Science & Humanities Computer Engineering & Applications Electrical Engineering Electronics & Communication Mechanical Engineering Civil Engineering English Physics Chemistry Mathematics Biotechnology Library & Information Science Faculty of Agricultural Sciences Centers Indian Knowledge System Examinations and Results Academic Ordinance Results Students Anti Ragging Committee HELP-LINE Anti Ragging Committee Hostel Rules Student Grievance Redressal Committee (SGRC) Grievance Cell Proctorial Board NEP - 2020 Faculty Visiting faculty Distinguished faculty Library Academic Calendar University Holidays Faculty and staff members grievance redressel Committee (FSGRC) NRPP 70+ Multidisciplinary Programs Flexible Multidisciplinary Programs E-Content Facility Experiential Project Based Education COURSES Graduate Courses Post Graduate Courses Doctoral Programme Diploma Courses B.Tech Courses B.Tech in CSE B. Tech (Hons.) CSE (Spec. in AI & Analytics) B.Tech in ECE B.Tech CSE (Specialization in AIML) B.Tech EC (Minor in CS) B.Tech EC (Specialization in VLSI) B.Tech in Electronics and Computer Engineering B.Tech in EEE B.Tech in EE B.Tech EE (Minor in CS) B.Tech EE (EV Technology) B.Tech in ME B.Tech ME (Minor in CS) B.Tech ME (Automobile) B.Tech ME (Mechatronics) B.Tech in CE B.Tech in Biotech B. Tech ME in Smart Manufacturing B. Tech Lateral Entry EC ME CSE CE EE B.Tech EE (EV Technology) B.Tech in ECE - LE B.Tech in EEE B.Tech in Biotech B.Tech EC (Minor in CS) B.Tech EC (Specialization in VLSI) Other UG Courses BCA/ BCA (Hons./ By Research) BBA/ BBA (Hons./ By Rsearch) BBA (Management Sciences) B. Pharm B. Pharm (Lateral Entry) BBA (Family Business) B.Com/ B.Com (H/ By Research) B.A. Eco/ B.A. Eco (H/ By Research) B.A. Eng/ B.A. Eng (H/ By Research) BCA Data Science B.Sc. Biotech/ B.Sc. Biotech (H/ By Research) B.Sc. (Hons.) Agriculture B.Sc. Chem/ B.Sc. Chem (H/ By Research) B.Sc. Physics/ B.Sc. Physics (H/ By Research) B.Sc. Maths/ B.Sc. Maths(H./ BY Research) in DS BBA LLB (Hons.) B.A. LLB (Hons.) B.Ed. B. Com Global Accounting In Association with CIMA BCA in Digital Marketing Bachelor of Library and Information Science Postgraduate Courses M. Tech in ECE M. Tech in EE M. Tech in CSE M. Tech in CE (Structural Engineering) M. Tech ME (Design) M.Tech ME (Production) M. Tech (Energy Systems) Diploma Courses PG Diploma in CTS PG Diploma in AIML PG Diploma in DM PG Diploma in HA PG Diploma in Hospital and HM PG Diploma in CM PG Diploma in Banking and FSM PG Diploma in Web and AD PG Diploma in IoT Certificate Program in Banking and WM Other PG Courses M. Pharm (Pharmaceutics) M. Pharm (Pharmacology) MBA (Hons.) MBA MBA (Logistics and Supply Chain Management) MBA (Financial Markets & Banking) MBA (Business Analytics) MCA M.Sc. (Biotech) M.Sc (Microbiology) M.Sc. (Chemistry) M.Sc. (Physics) M.Sc. (Mathematics) M.Sc. (Agriculture) LL.M M.Sc. Bioinformatics Master of Library and Information Science Doctoral Programmes Ph.D. in Computer Application Ph.D (Law) Ph.D. in CSE Ph.D. in ECE Ph.D. in ME Ph.D. in EE Ph.D. in CE Ph.D. in Biotechnology Ph.D. in Microbiology Ph.D. in Physics Ph.D. in Chemistry Ph.D. in English Ph.D. in Mathematics Ph.D. in Pharmacy Ph.D in Management Ph.D in Education Ph.D Agriculture Diploma Courses D. Pharm Diploma (Electronics & Communication) Diploma (Civil Engineering) Diploma (Computer Science Engineering) Diploma (Electrical Engineering) Diploma (Mechanical Engineering) Diploma (Chemical Engineering) Diploma in Library and Information Science ADMISSIONS Overview Eligibility Criteria Admission Procedure GLAET Syllabus & Sample Paper Counselling Offices Admission Open for PhD (Session 2025-26)-odd Semester GLAET Result PhD Entrance Result for Academic Year 2025-26 (Session July-2025) Fee Structure Scholarship FAQs Fee Refund Policy Get In Touch Download Forms Admission Brochure International Admissions About GLA About India Local Attractions FAQ and Guidelines Courses and Fee Structure International Scholarship Hostel and Mess Fee Refund Policy SAARC Country Candidates Scholarship Hostel and Mess Fees Unlock your Career Goals Scholarship Financial Aid Education Loan GLAET CAMPUS LIFE A Bustling Campus Environment 70+ Clubs Shopping Mall Fests & Events Sports Skill Enhancement Overview Academic Facilities Lecture Theaters Conference Halls Laboratories Libraries Facility for e-Content Campus Facility Aarogyam (Medical Facilities) Hostel Cafeteria Transport Facility Happenings Media Coverage Photo Gallery Video Gallery Events TEDxGLAU Workshops Guest Lectures Sports Facility Sports Overview In Door Games Sports Ground Annual Sports Sports & Cultural Events ASC Other Facilities E-Content Student Ambassadors National Cadet Corps (NCC) Society Rules and Regulations Student Clubs Student Council PLACEMENTS Overview The Team Placement Policy Industry-Academia Partnership Industrial Visits Our Recruiters Corporate Testimonials Alumni Testimonials Helpline and FAQs Get in Touch Alumni Job Opportunities by Alumni GLA Discussion Forum Alumni of GLA Alumni Working Abroad Alumni Testimonials Alumni Portal Get In Touch RESEARCH AND INNOVATION RESEARCH Research Hierarchy Research Scholars Research Centres Research Publications Patents MoU Sponsored Project Consultancy Research Blog FAQ'S Technology Transfer Consultancy Policy (Revised) Research Promotion Policy (Revised) & IPR Policy Research Ordinance List of beneficiaries for National/International recognition Glimpses of Award Ceremony INNOVATION Incubation Entrepreneurship Cell NewGen IEDC Innovation Cell NISP Implementation Journal Research Journal A Research-Intensive Environment 750+ Patents Published 10000+ Publications 14 Research Centres 75+ Patents Granted Admission Open Admission Helpline - 9027068068 WHY GLA? RESEARCH ALUMNI CONTACT US (current) × Happenings Media Coverage Photo Gallery Video Gallery Events TEDxGLAU Workshops Guest Lectures NIRF Why GLA? Research Alumni Careers Contact Us Admission Query ✖ Admission Inquiry Select Campus* Mathura Campus Noida Campus Course* Select Branch* Select State* Andaman & Nicobar Andhra Pradesh Arunachal Pradesh Assam Bihar Chandigarh Chhatisgarh Dadra & Nagar Haveli Daman & Diu Delhi Goa Gujarat Haryana Himachal Pradesh Jammu & Kashmir Jharkhand Karnataka Kerala Lakshadweep Madhya Pradesh Maharashtra Manipur Meghalaya Mizoram Nagaland Orissa Puducherry Punjab Rajasthan Sikkim Tamil Nadu Tripura Uttar Pradesh Uttarakhand West Bengal Select City* Query Type* Need for counselling call Other I consent to receive SMS, email, and WhatsApp messages and agree to the terms and conditions. Testimonials Home Testimonials Sumit Gupta EC- Terminal Manager - AAI B. Tech - ECE - 2006 GLA is like a second home for me. One of the most important lessons that I have learned at GLA is “How to live in a competitive and stressful corporate world with a smile on your face. The teachers at GLA are well experienced, friendly and approachable. I feel myself extremely lucky that I spent four years in such a vibrant learning environment. GLA University 17km Stone, NH-19, Mathura-Delhi Road P.O. Chaumuhan, Mathura-281 406 (U.P.) India Contact Us +91-5662-250900 , 250909 , 241489 , +91-9927064017 Email: [email protected] Admission Helpline Click here to call our counsellor in your city. Helpline No. 9027068068 Why GLA University About GLA University Rankings Faculty Alumni Infrastructure Testimonials Academic Ordinance Media News Events Workshops Convocation Photo Gallery Video Gallery Downloads Other Links Examinations Contact Us Careers Academic Calendar Staff Login Student Login Academic Bank of Credits(ABC) National Academic Depository(NAD) Cells at GLAU NIRF IQAC IDP Blog Public Self Disclosure Terms & Conditions Privacy Policy Disclaimer Sitemap Admissions Admission Process - 2025 Graduate Courses Post Graduate Courses Doctoral Programmes Diploma Courses Certificate Courses FAQs How to Apply Apply Now Social Link © 2025 - All Rights Reserved. Website Designed and Developed by Sterco Digitex Admission Helpline 9027068068"}
